{
"source_article_link": "https://www.thehindu.com/news/national/jaitley-gets-an-attentive-house-rahul-takes-notes/article22625470.ece",
"title": "Jaitley gets an attentive House; Rahul takes notes - The Hindu",
"date_published": "2018-02-01T22:41:44+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/article22625469.ece/ALTERNATES/FREE_1080/02TH-PAPERS"
],
"article_body": "Prime Minister Narendra Modi walked up to congratulate Finance Minister Arun Jaitley soon after he concluded his nearly two-hour budget speech in the Lok Sabha on Thursday. Mr. Jaitley was the man of the moment as several of his Cabinet colleagues came to congratulate him. Railway Minister Piyush Goyal and Minister of State for Civil Aviation Jayant Sinha — both believed to be part of the Modi government’s economic team — trooped in for an impromptu analysis. Opposition members did not bother for such pleasantries. But the suspended Biju Janata Dal member Baijayant Panda walked over from his seat to speak to the Finance Minister and shook hands with the Prime Minister. There were interesting sidelights even when Mr. Jaitley was delivering his speech. Congress president Rahul Gandhi was seen breaking into short conversations with his colleagues Jyotiraditya Scindia and Kamal Nath. But when Mr. Jaitley started talking about his tax proposal, he was seen taking notes. Opposition members were quite disciplined, except when the Finance Minister said the government would give farmers the minimum support price more than one-and-a-half times the input cost. All Opposition members stood up to protest this statement. Shatrughan Sinha of the BJP, seated in the fourth row of the middle column, was using sign language to talk to his party colleague Hema Malini. As Sangeeta Jaitley, wife of the Finance Minister, watched him spell out his plans from the visitors’ gallery, BJP MP from Assam R.P. Sharma was vying for attention with slogans like Jai Ho !",
"description": "Prime Minister Narendra Modi walked up to congratulate Finance Minister Arun Jaitley soon after he concluded his nearly two-hour budget speech in the Lok Sabha on Thursday. Mr. Jaitley was the man of the moment as several of his Cabinet colleagues came to congratulate him. Railway Minister Piyush Goyal and Minister of State for Civil Aviation Jayant Sinha — both believed to be part of the Modi government’s economic team — trooped in for an impromptu analysis. Opposition members did not bother for such pleasantries. But the suspended Biju Janata Dal member Baijayant Panda walked over from his seat to speak to the Finance Minister and shook hands with the Prime Minister. There were interesting sidelights even when Mr. Jaitley was delivering his speech. Congress president Rahul Gandhi was seen breaking into short conversations with his colleagues Jyotiraditya Scindia and Kamal Nath. But when Mr. Jaitley started talking about his tax proposal, he was seen taking notes. Opposition members were quite disciplined, except when the Finance Minister said the government would give farmers the minimum support price more than one-and-a-half times the input cost. All Opposition members stood up to protest this statement.",
"time_scraped": "2018-08-17 04:59:05.303539",
"article_id": "22625470",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/article22625469.ece/ALTERNATES/FREE_1080/02TH-PAPERS",
"path": "full/b1b56271c132ba319b4bd2beea2f9988015b0446.jpg",
"checksum": "0a871e859e8e5b1e33d8674e21581c61"
}
]
}