{
"source_article_link": "https://www.thehindu.com/news/national/budget-brings-hope-to-bamboo-rich-northeast/article22623985.ece",
"title": "Budget brings hope to bamboo-rich northeast - The Hindu",
"date_published": "2018-02-01T20:15:10+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/article22625145.ece/ALTERNATES/FREE_1080/THJC-BAMBOO"
],
"article_body": "What’s in a name? A lot, if we are talking about bamboo. Bamboo is essentially a type of grass, but its classification as a tree for 90 years prevented the northeast, which grows 67% of India’s bamboo, from exploiting it commercially unlike China, the only country with richer bamboo genetic resources. Follow The Hindu's comprehensive coverage of Budget 2018 here Now Budget 2018 has ignited farm hope for this tree-turned-grass which once fuelled insurgency in the northeastern states. The allocation of ₹1,290 crore for a restructured National Bamboo Mission (NBM) has raised hopes for a range of bamboo-based industries – from food professing to construction. “Bamboo is a wonder, multi-utility grass that more than 300 ethnic groups in the northeast have traditionally been using in every stages of life, from birth to death, besides it being a delicacy. Bamboo’s commercial journey began when it was struck off the list of trees by amending the Indian Forest Act last year,” said Chandra Mohan Patowary, Assam’s industry and commerce minister. If the ‘tree’ tag prevented tribal people from using bamboos in forestland – the Northeast has 25% of India’s forests – the lack of policy support never allowed commercial use of non-forest bamboo, experts said. “The Budget provision is one of the best initiatives to promote holistic development of bamboo. But the restructured NBM needs to be more focussed on value-chain management and value-addition of bamboo at community level which will bring more income to the bamboo farmers and bamboo processors,” Kamesh Salam, a former member of NBM, told The Hindu Called the green gold, the bamboo has often been in focus for the wrong reasons in the northeast. A rat famine triggered by flowering of this grass had in 1966 led to the creation of the Mizo National Front that metamorphosed into a political party two decades later. The flowering of bamboo every 50-55 years leads to dramatic increase in the population of rats that destroy crops triggering famine, locally called mautam. There have also been instances of bamboo cartels shedding blood while competing for limited commercial opportunities such as two paper plants in Assam that have been struggling to survive. But things for the grass began looking up last year when the Arunachal Pradesh and Manipur governments signed an agreement for supplying bamboo to the Assam-based Numaligarh Refinery’s upcoming bio-refinery. “Such initiatives will offer a permanent source of revenue generation to bamboo growers and communities owning bamboo groves,” Arunachal Pradesh chief minister Pema Khandu said.",
"description": "What’s in a name? A lot, if we are talking about bamboo. Bamboo is essentially a type of grass, but its classification as a tree for 90 years prevented the northeast, which grows 67% of India’s bamboo, from exploiting it commercially unlike China, the only country with richer bamboo genetic resources. Follow The Hindu's comprehensive coverage of Budget 2018 here Now Budget 2018 has ignited farm hope for this tree-turned-grass which once fuelled insurgency in the northeastern states. The allocation of ₹1,290 crore for a restructured National Bamboo Mission (NBM) has raised hopes for a range of bamboo-based industries – from food professing to construction. “Bamboo is a wonder, multi-utility grass that more than 300 ethnic groups in the northeast have traditionally been using in every stages of life, from birth to death, besides it being a delicacy. Bamboo’s commercial journey began when it was struck off the list of trees by amending the Indian Forest Act last year,” said Chandra Mohan Patowary, Assam’s industry and commerce minister.",
"time_scraped": "2018-08-17 04:59:05.119647",
"article_id": "22623985",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/article22625145.ece/ALTERNATES/FREE_1080/THJC-BAMBOO",
"path": "full/ea3e04fa80c1ad159ea5cf03998102502debd88a.jpg",
"checksum": "cc8e72b390945e3400ea433a1def7e37"
}
]
}