{
"source_article_link": "https://www.thehindu.com/news/national/budget-caused-stock-crash-rahul/article22637592.ece",
"title": "Budget caused stock crash, says Rahul Gandhi - The Hindu",
"date_published": "2018-02-02T22:31:59+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/article22638445.ece/ALTERNATES/FREE_1080/02TH-THGRP-RAHUL"
],
"article_body": "On a day when the stock market plummeted, Congress president Rahul Gandhi said the bourses did not have confidence in the Modi government’s Budget and started a hashtag #*BasEkAurSaal, meaning just one more year for the government to complete its term. Former Finance Minister P. Chidambaram, on the other hand, had compared the ambitious healthcare scheme to “kite flying without string”. Referring to the fall in Sensex, Mr. Gandhi tweeted, “In parliamentary language, the Sensex just placed a solid 800 point No Confidence Motion against Modi’s budget. #BasEkAurSaal.” Mr. Chidambaram too took to twitter to further his argument, made on Thursday, that the government had not provided budgetary support for the healthcare scheme. ‘No allocation’ “Yesterday [Thursday], I had said that the new healthcare scheme is a jumla (mere claim) with no money provided in the budget. Today, [the Finance Minister] has admitted that no money has been provided and he will ‘raise money in the future’. Perfect jumla,” Mr. Chidambaram tweeted. “Scheme without money is like flying a kite without a string. The kite flyer will say that the kite is flying, but there will be no kite and nothing will be flying.’’ Reacting to the proposed scheme, the Congress leader said, “The promise of Rs. 5 lakh per family for secondary and tertiary healthcare is a big jumla . The target group is 10 crore families. Assuming each family will avail of Rs 50,000 — one tenth of Rs 5 lakh — the amount required per year will be Rs 5 lakh crore.” He argued that if the insurance companies paid the bill, the estimated premium at ₹5,000 to ₹15,000 per family would require an outgo from ₹50,000 crore to ₹1.5 lakh crore per year. “Is the Finance Minister serious,” Mr. Chidambaram asked.",
"description": "Chidambaram says healthcare scheme is ‘kite flying without string’",
"time_scraped": "2018-08-17 04:54:13.157593",
"article_id": "22637592",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/article22638445.ece/ALTERNATES/FREE_1080/02TH-THGRP-RAHUL",
"path": "full/850a816cc3b3cc06fd1d2e09743b7057a4149658.jpg",
"checksum": "a5b9c5107bd98dd4ecccaaa74888b6ca"
}
]
}