{
"source_article_link": "https://www.thehindu.com/news/national/pm-promises-farmers-income-doubling-by-2022/article24212508.ece",
"title": "PM promises farmers income doubling by 2022 - The Hindu",
"date_published": "2018-06-20T21:54:35+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/25yk80/article24212507.ece/ALTERNATES/FREE_1080/21TH-SUGARCANEFARMERS"
],
"article_body": "At a time of acute agrarian distress, Prime Minister Narendra Modi spoke in glowing terms of his government’s schemes and programmes in a video interaction with farmers from nine States on Wednesday. Reiterating the government’s promise to double farmers’ income by 2022, Mr. Modi claimed that the budget allocation for agriculture between 2014-19 was ₹ 2.12 lakh crore, almost double the amount — ₹ 1.21 lakh crore — allocated in the previous five years by the UPA government. Worry-free now Because of the government’s efforts, farmers were now “chinta mukt” or worry-free, protected from nature’s fury by insurance schemes such as the Pradhan Mantri Fasal Bima Yojana, he said. Farmers, speaking from Krishi Vigyan Kendras, also praised various government schemes, with themes by location — organic farming in Sikkim, fish farming in West Bengal and crop insurance in Karnataka, for example. The event was the seventh in a series of interactions the Prime Minister has been having with beneficiaries of various schemes. It was described as “a direct dialogue with farmers across the country, in which various initiatives related to doubling the income of farmers by 2022 will also be discussed.” Of the 24 farmers who spoke to Mr. Modi during the interaction, only one raised any concerns regarding income. Speaking from Shahjahanpur in Uttar Pradesh, Rajwinder Singh, who has been farming 15 acres of leased land for the last 20 years, told the Prime Minister that guidance on drip irrigation for his crop of melons had improved his returns. Noting the cauliflowers placed on the table in front of the farmer, the Prime Minister commented on their large size. “Yes, I have left rice and wheat farming and shifted to vegetables. But there are some problems,” said Mr. Singh. “Unlike the cost of inputs, which go up every year, income remains a constant.” At that point, the Prime Minister cut him off with assurances that government initiatives were helping farmers on this issue, and asked if any other farmer had anything to say. ‘Publicity trick’ Several critics slammed the scripted nature of the event. “A meaningful interaction with farmers would be to talk to those, whose family member committed suicide due to agrarian distress or those farmers who have a huge burden of debt,” tweeted Congress leader Ashok Gehlot, dismissing the event as a publicity trick. “It’s a misnomer to call that an interaction. It was a pre-scripted TV show, the Prime Minister was the anchor and the farmers were no more than props...Notice that no one asked the Prime Minister any questions,” said Yogendra Yadav, president of Swaraj India party. He accused the Prime Minister of ignoring the reality of the agricultural crisis in the country, where farmers were unable to get minimum support prices for their crops, despite government promises. “In the last four years, the Prime Minister has not once uttered the words ‘farmer suicide’ and he did not do it today either.” “Even while the Prime Minister was speaking on video this morning, 25 farmers in Tamil Nadu were being arrested as they gathered to protest against the forced acquisition of farmland for the 8-lane Chennai-Salem highway,” said Vijoo Krishnan, joint secretary of the CPI(M)-affiliated All India Kisan Sabha, speaking from that agitation at Tiruvannamalai in Tamil Nadu. “This is what is actually happening to farmers on the ground.”",
"description": "Critics call Modi’s video interaction a ‘pre-scripted TV show’ that failed to address suicides due to agrarian distress",
"time_scraped": "2018-08-17 04:58:38.038469",
"article_id": "24212508",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/25yk80/article24212507.ece/ALTERNATES/FREE_1080/21TH-SUGARCANEFARMERS",
"path": "full/9da897a94532d59041350a2db2a6f6ed91874dbd.jpg",
"checksum": "d099378c5ef27a8f5a9d09c8bc1119e2"
}
]
}