{
"source_article_link": "https://www.thehindu.com/news/national/couple-in-yemen-to-join-hadiya-probe/article24542634.ece",
"title": "Couple in Yemen to join Hadiya probe - The Hindu",
"date_published": "2018-07-28T22:24:47+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "The National Investigation Agency (NIA) has asked an Indian man and woman based in Yemen to cooperate in the investigation into the Hadiya case through video call. The couple — Shirin Shahana and and Fasal Musthafa — allegedly persuaded Akhila Asokan, alias Hadiya, a homeopathy student from Kerala, to convert to Islam. Ms. Hadiya’s parents had moved the Kerala High Court in 2016 alleging that she was radicalised to convert to Islam and forcibly married to a Muslim man. After the High Court annulled the marriage, her husband, Shafin Jahan, moved the Supreme Court, which asked the NIA to investigate the case. The apex court restored Ms. Hadiya’s marriage to Mr. Jahan on March 8 but allowed the NIA to continue with its ongoing investigation into any criminality involved. It asked the agency to steer clear of Ms. Hadiya’s choice to marry Mr. Jahan. Status report The NIA, in a status report to the SC, had said the agency had evidence that Hadiya was brainwashed by the couple who she met at Sathya Sarani, a religious institution affiliated to the Popular Front of India (PFI) in Mallapuram district. “We have located the couple in Yemen. They claim that they are pursuing some religious studies there. We will take help of local authorities to question them through video call, we don’t think they are going to come back to India anytime soon. They are likely to join the probe as they would want to clear their name from police records,” a senior NIA official said. The official said the NIA had examined a few members of the Sathya Sarani in the past few days. The agency said they spoke to six persons who said that none of them were enticed by monetary benefits to convert to Islam. The NIA said there were other methods used to convert them to Islam that included religious propaganda.",
"description": "NIA will quiz them through video call",
"time_scraped": "2018-08-17 04:58:01.726428",
"article_id": "24542634",
"article_category": "National",
"image_details": []
}