{
"source_article_link": "https://www.thehindu.com/news/national/centre-tells-states-to-count-rohingya-migrants/article24566817.ece",
"title": "Centre tells States to count Rohingya migrants - The Hindu",
"date_published": "2018-08-01T02:56:28+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/qy3f52/article24566791.ece/ALTERNATES/FREE_1080/Rohingyajpg"
],
"article_body": "The Union Home Ministry has sent an advisory to State governments to enumerate, observe and collect biometric data of Rohingya migrants living in India, and told the Lok Sabha that the government had received reports of their involvement in illegal activities. The government also made it clear that Rohingyas were “illegal migrants” and not “refugees.” Responding to a question in the Lok Sabha on Rohingya migrants, Home Minister Rajnath Singh said the advisory for enumeration had been sent. BSF to prevent entry “The Border Security Force (BSF) and Assam Rifles have also been sensitised over not allowing in more illegal immigrants,” he said. Responding to a question on deporting the migrants, Mr. Singh said his department was waiting for the enumeration process to be complete, after which it would be sent to the Ministry of External Affairs (MEA) who will in turn take it up with the government of Myanmar. Answering supplementary questions on the issue, Minister of State for Home Kiren Rijiju said there had been reports of Rohingya being involved in illegal activities, but did not share the nature of these activities. He informed the House that the 40,000 or so Rohingya in India were mostly found in Jammu and Kashmir, Hyderabad (Telangana), Mewat in Haryana and Tripura. Also Read Can India ignore the Rohingya crisis? India’s ‘soft approach’ In a response to concerns of inhumane treatment being meted out to the Rohingya, raised by Trinamool Congress’s Sugata Bose, who also questioned the government’s stand on not adhering to India’s traditional generosity towards refugees, Mr. Rijiju said India had been “most soft” in its approach to the issue. “We are not signatories to the UN Convention on Refugees but have our own laws and have been most soft on refugees. That does not mean that there should be no regulation of the system. We should take care of our citizens first before taking care of others. Through the MEA we have helped in camps in Bangladesh and even in Rakhine, the province in Myanmar from where the Rohingya hail. Instead of appreciating our stand, you are questioning the good name of our country on this matter,” he said.",
"description": "Govt. has reports of their illegal activities, Kiren Rijiju tells Lok Sabha",
"time_scraped": "2018-08-17 04:54:46.486466",
"article_id": "24566817",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/qy3f52/article24566791.ece/ALTERNATES/FREE_1080/Rohingyajpg",
"path": "full/175397481342cb96ebefd729c3a957c521b8521c.jpg",
"checksum": "34b388777fe01610a87ff089e747c32e"
}
]
}