{
"source_article_link": "https://www.thehindu.com/news/national/with-rain-deficit-looming-imd-to-review-forecast/article24584860.ece",
"title": "With rain deficit looming, IMD reviewing its projections - The Hindu",
"date_published": "2018-08-02T22:12:56+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/k7ejao/article24584859.ece/ALTERNATES/FREE_1080/03THRAIN"
],
"article_body": "Amidst concern that monsoon rains could fall short of “normal,” the India Meteorological Department (IMD) is reviewing its projections. Officials, however, told The Hindu that while July rains were less than expected, the shortfall was confined to the northeastern States and below normal rains were unlikely to impede agriculture production. It’s expected to take a call before the weekend on whether to stick to — or downgrade — its May 30 forecast. On Wednesday, private forecaster Skymet Weather said monsoon rains — June to September—would be at 92% of the historical Long Period Average (LPA) of 89 cm. It had earlier forecast rains to be “normal” or 100% of the LPA. The larger-than-anticipated shortfall in July and anticipated weak rains during the whole of August were key dampeners. The IMD hasn’t indicated any change in its numbers. On May 30, it said monsoon rains, overall, would be 97% of the LPA. July would see excess rains (101% of that month’s LPA) and August would see a shortfall (94% LPA), it said. “We are reviewing the situation, and will soon issue a statement. The monsoon has spread well to all the agriculturally important regions,” said K.J. Ramesh, Director General of IMD. At the start of the monsoon, weather agencies around the world had indicated that the weather conditions in the Indian Ocean wouldn’t be very helpful to the monsoon, particularly after July. However, fears of an El Nino, an anomalous warming of the Central Pacific that frequently dries up monsoon rains in northwest India, also sharply receded. Madhavan Rajeevan, Secretary, Ministry of Earth Sciences, said, “If you ignore the northeastern States, it’s actually above average rainfall in the rest of India. Regions of Bihar and Uttar Pradesh, which had been registering deficit rains, have also improved. So it’s not a situation to worry about.” Decline in sowing? Estimates from the Agriculture Ministry suggest a decline in sowing from last year. Paddy farmers in Bihar and Uttar Pradesh have sown almost 20 lakh hectares less than normal for this point in the kharif season; in Bihar, paddy acreage is only 40% of the acreage sown at the same time last year. According to data from the Ministry, kharif crops have been sown on almost 738 lakh hectares till July 27. That is a 7.5% drop from the previous year. Sowing of most major crops has been slower than last year, with the exceptions being soya bean, moong and sugarcane. But the situation in the country's reservoirs is better. The total water available in 91 reservoirs in the country, being monitored by Central Water Commission (CWC), was 63.333 BCM (billion cubic metre) as on July 26. This is 41% of the total live storage capacity of these reservoirs and 116% of storage of average of last 10 years. “The overall storage position is better than the corresponding period of last year,” the CWC said in a statement.",
"description": "Shortfall unlikely to impede agriculture, officials say.",
"time_scraped": "2018-08-17 04:55:09.916531",
"article_id": "24584860",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/k7ejao/article24584859.ece/ALTERNATES/FREE_1080/03THRAIN",
"path": "full/c4d1f3ff35775bf2dd2bca8e4866ddb2cdd9d0a0.jpg",
"checksum": "09f53d4e7ec05817b7084b2a6fb3b39c"
}
]
}