{
"source_article_link": "https://www.thehindu.com/news/national/issue-of-pm-candidate-will-be-taken-up-after-polls-oppn/article24596306.ece",
"title": "Issue of PM candidate will be taken up after polls: Opposition - The Hindu",
"date_published": "2018-08-03T23:27:32+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/jvy37u/article24596311.ece/ALTERNATES/FREE_1080/PMsjpg"
],
"article_body": "Opposition parties have reached a “strategic understanding to work together” to stop the BJP-RSS combine from coming to power in 2019 and the issue of a Prime Ministerial candidate will be tackled later in a two-stage action plan, top Congress sources said on Friday. Top leaders said discussions on the Prime Ministerial candidate is divisive at this stage. “So the focus is to have one platform where every like-minded Opposition party can be accommodated without any confusion and disruption.” Leaving the choice of a PM candidate for post-poll discussions is significant as already West Bengal Chief Minister Mamata Banerjee has positioned herself as the front-runner. BSP chief Mayawati too has not shied away from expressing her prime ministerial ambitions if the grand alliance does well in Uttar Pradesh. Also Read Our first aim is to oust BJP from power: Mamata The Congress is of the view that alliances and pre-poll understanding in States such as Uttar Pradesh, Bihar, Maharashtra are crucial in the Opposition’s effort to stop PM Narendra Modi. Party leaders claim that the alliance in Maharashtra with Sharad Pawar’s NCP is cemented and so is the case with Lalu Prasad’s RJD in Bihar. But in Uttar Pradesh, which elects 80 Lok Sabha members, the party is yet to stitch up a grand alliance with the Samajwadi Party and the Bahujan Samaj Party. The Congress Working Committee (CWC) has authorized Congress chief Rahul Gandhi \"to have alliances with like minded parties. Top leaders admit that conversations are on for a tie up in Uttar pradesh even as they denied media reports that Congress may be offered no more than two or three seats in the State on the basis of its strength. Congress pins hopes on Hindi heartland The party is looking at Rajasthan, Madhya Pradesh, Maharashtra, Punjab, Chhattisgarh and Haryana among States where it expects to do well in next Lok Sabha polls. And that will help catapult it to the centre-stage of an opposition alliance. In States like Delhi and Punjab, where the Congress and AAP are on the same side in their opposition the Modi government, top leadership of the Congress will give priority to the views of the State unit. Despite its now strident opposition to the BJP, the Congress will not have any understanding with Shiv Sena since their ideologies don't align. Senior leaders of the Congress are of the view that if the BJP doesn't get 230 seats or more on its own, NDA allies may prefer another Prime Ministerial candidate over Mr Narendra Modi. Top leaders of the Congress asserted that despite attempts to tie them down in a polarising discourse, the Congress would run a campaign that would focus on a new deal for farmers, jobs and opportunities for India's youth.",
"description": "Focus is on bringing like-minded parties on one platform",
"time_scraped": "2018-08-17 04:55:11.637600",
"article_id": "24596306",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/jvy37u/article24596311.ece/ALTERNATES/FREE_1080/PMsjpg",
"path": "full/4f4da3debbdb7f7f0e9e89e81cccb9df510f5ad7.jpg",
"checksum": "62774f7e3e34f163bfcdd168131d658c"
}
]
}