{
"source_article_link": "https://www.thehindu.com/news/national/sc-asks-tn-to-seal-11-resorts-on-nilgiris-elephant-corridor-within-48-hrs/article24640844.ece",
"title": "SC asks TN to seal 11 resorts on Nilgiris elephant corridor within 48 hrs - The Hindu",
"date_published": "2018-08-09T13:37:44+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/85awoc/article24640843.ece/ALTERNATES/FREE_1080/IN08ELEPHANTCORRIDOR"
],
"article_body": "The Supreme Court on Thursday directed the Tamil Nadu government to seal or close down within 48 hours 11 resorts and hotels constructed on the elephant corridor of Nilgiris in violation of law. A Bench headed by Justice Madan B Lokur directed the owners of the other resorts and hotels located in the area to place their documents of approval before the Collector within 24 hours. The apex court said the Collector will verify the documents and if he arrives at the conclusion that a resort or hotel has been constructed without prior approval, the same should also be closed down within 48 hours. The Bench, also comprising justices S Abdul Nazeer and Deepak Gupta, said elephants were our “national heritage” and expressed displeasure as to how constructions had come up on the elephant corridor of Nilgiris. Also Read SC urged to issue directions to protect elephant corridor During an earlier hearing, one of the counsels for the petitioners had alleged that several hotels and resorts had come up in the elephant corridor areas of Tamil Nadu. The Bench had made it clear that no construction activity would be carried out in those areas of the southern state and asked the Collector of the Nilgiris area, where the hotels and resorts have come up, to file a report in this regard. It had also asked the Collector to inform the court as to how these establishments could be identified, when were they built and how. The counsel had also told the court that around 18,000 elephants came to Tamil Nadu during the monsoon season and the court should direct that the power connection to these resorts and hotels be snapped. The owners of some of these hotels and resorts have also filed appeals in the apex court against a Madras High Court order against them in this regard. The apex court had earlier said it was “extremely unfortunate” that several states had not responded to two communications sent by the Centre on the issue of elephant corridors to curb incidents of human-animal conflict and reduce animal fatalities. Also Read Proposed Nilgiris elephant corridor runs into resistance The Centre had told the court that a committee was formed to consider the suggestions, including making corridors across the country for the safe passage of elephants and other endangered animals. The apex court had stressed on the need to have elephant corridors across the country to reduce animal fatalities due to accidents and other reasons and asked the Centre to come up with some “workable solution” in this regard. The Centre had told the court that there were 27 “critical” elephant corridors in 22 states, but despite the top court’s directions, 13 of those states had not responded to the government on the matter.",
"description": "Owners of hotels and resorts in the area asked to submit documents of approval to the Collector",
"time_scraped": "2018-08-17 04:53:47.379988",
"article_id": "24640844",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/85awoc/article24640843.ece/ALTERNATES/FREE_1080/IN08ELEPHANTCORRIDOR",
"path": "full/233b0309fee5477185d33be2f9ac08f227c0d044.jpg",
"checksum": "d06e3f0f45677d38492c392798ea97bd"
}
]
}