{
"source_article_link": "https://www.thehindu.com/news/national/centre-launches-portal-for-scientific-research-funding/article24657313.ece",
"title": "Centre launches portal for scientific research, funding - The Hindu",
"date_published": "2018-08-10T18:50:15+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "How does a budding math enthusiast figure out career prospects for pursuing mathematics in India? Which individual professors are blazing new trails in, say, climate change research here? The Union science ministry’s communication wing, Vigyan Prasar, has launched the India Science Technology and Innovation portal that can help with such queries. Currently the portal can be queried for information about the organisations carrying out research, those funding them, international collaborations, the scientists involved in the research, the states in which they are being carried out, their achievements and impact. Prime focus There’s also a compilation of technologies developed in India, the organisations that have developed these technologies, those that have funded them and the status of the technologies. “A major thrust of the portal is to reach out to students, researchers, scholars, scientists both from India and abroad, so that they can choose from the mine of fellowships, scholarships and funding and startup opportunities that India puts on their plate,” says a note accompanying the portal. The portal follows a launch this week of India Science (indiascience.in), an Internet-based science channel, to showcase the developments in science and technology in India. Both the portal and the channel are part of a push by the Science Ministry to improve its public outreach. By next year, the Ministry hopes to offer science programmes on Doordarshan and eventually launch a dedicated science channel. According to a roadmap prepared by the Union government, the Science Ministry proposes to spend ₹15 crore over five years to cover costs of portal development and updates.",
"description": "There’s also a compilation of technologies developed in India, the organisations that have developed these technologies and the status of the technologies.",
"time_scraped": "2018-08-17 04:58:25.587571",
"article_id": "24657313",
"article_category": "National",
"image_details": []
}