{
"source_article_link": "https://www.thehindu.com/news/national/supreme-court-admits-cbi-appeal-against-talwars-acquittal/article24652776.ece",
"title": "SC admits CBI appeal against Talwars' acquittal in daughter Aarushi, Hemraj murder case - The Hindu",
"date_published": "2018-08-10T13:00:03+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/migration_catalog/1qowsr/article11718795.ece/ALTERNATES/FREE_1080/TALWARS-01"
],
"article_body": "The Supreme Court on Friday admitted a CBI appeal against the acquittal of Rajesh and Nupur Talwar in the case of murder of their teenaged daughter, Aarushi, and domestic help Hemraj in 2008. Aarushi was found with her throat slit in her bedroom and Hemraj's body was found on the terrace of the dentist couple's home a day later. Hemraj's wfe, Khumkala Banjade, had appealed against the acquittal by the Allahabad High Court in October 2017 in December last and the Supreme Court admitted it. A Bench, led by Justice Ranjan Gogoi, granted leave to the CBI appeal and tagged it along with Ms. Banjade's appeal. The CBI, which filed the appeal in March last, has said the High Court had erred on many counts. Also Read Aarushi murder case: a timeline of events In a stinging judgment, the High Court had set aside the life sentence awarded to the couple on November 26, 2013 by the CBI court at Ghaziabad. The Talwars had already served four years of their life sentence in Ghaziabad’s Dasna jail. The suspicion in the murder of 14-year-old Aarushi initially fell on the 45-year-old Hemraj, as he had gone missing. But his body was found on the terrace of the house the next day.",
"description": "Domestic help Hemraj's wife Khumkala Banjade has already appealed against their acquittal by Allahabad High Court in October 2017 and Supreme Court has admitted it.",
"time_scraped": "2018-08-17 04:55:09.664732",
"article_id": "24652776",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/migration_catalog/1qowsr/article11718795.ece/ALTERNATES/FREE_1080/TALWARS-01",
"path": "full/0bcddb142f0c03e0a0a96c698dee3f17d0e6bb1c.jpg",
"checksum": "13a489de0ff3e4b007d10233bcccb58c"
}
]
}