{
"source_article_link": "https://www.thehindu.com/news/national/monsoon-session-of-parliament-at-a-glance/article24663440.ece",
"title": "Monsoon session of Parliament: At a glance - The Hindu",
"date_published": "2018-08-11T13:52:39+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/st2ege/article24629828.ece/ALTERNATES/FREE_1080/Parliament"
],
"article_body": "The monsoon session of the Parliament began on July 18 and ended on August 10. The session saw 17 sittings, with August 8 seeing a notable adjournment to pay homage to the former chief minister of Tamil Nadu M. Karunanidhi who passed away the previous day. This Monsoon session of Parliament was the “most productive” for Lok Sabha since 2000, PRS Legislative Research has said. The productivity of Lok Sabha was 118% and that of Rajya Sabha was 68%, according to the Ministry of Parliamentary Affairs. As many as 22 Bills (21 in the Lok Sabha and one in the Rajya Sabha)were introduced. The Lok Sabha passed 21 Bills while the Rajya Sabha passed 14 Bills during the session. There are two more reasons for the government to cheer. It defeated a motion of No-Confidence moved by TDP member Kesineni Srinivas in the Lok Sabha, and its candidate Harivansh of the JD(U) was elected as Deputy Chairman of Rajya Sabha. In the Lok Sabha, one Short Duration Discussion was held on the recent floods and drought situation in various parts of the country. Rajya Sabha witnessed four discussions — on the status of the implementation of the Andhra Pradesh Re-Organization Act, 2014, on the final draft of the National Register of Citizens in Assam, on the the misuse of social media platforms and lynchings across the country, and on the challenges in the agricultural sector, which however remained inconclusive.",
"description": "The monsoon session of the Parliament began on July 18 and ended on August 10. The session saw 17 sittings, with August 8 seeing a notable adjournment to pay homage to the former chief minister of Tamil Nadu M. Karunanidhi who passed away the previous day. This Monsoon session of Parliament was the “most productive” for Lok Sabha since 2000, PRS Legislative Research has said. The productivity of Lok Sabha was 118% and that of Rajya Sabha was 68%, according to the Ministry of Parliamentary Affairs. As many as 22 Bills (21 in the Lok Sabha and one in the Rajya Sabha)were introduced. The Lok Sabha passed 21 Bills while the Rajya Sabha passed 14 Bills during the session. There are two more reasons for the government to cheer. It defeated a motion of No-Confidence moved by TDP member Kesineni Srinivas in the Lok Sabha, and its candidate Harivansh of the JD(U) was elected as Deputy Chairman of Rajya Sabha. In the Lok Sabha, one Short Duration Discussion was held on the recent floods and drought situation in various parts of the country.",
"time_scraped": "2018-08-17 04:53:44.237458",
"article_id": "24663440",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/st2ege/article24629828.ece/ALTERNATES/FREE_1080/Parliament",
"path": "full/d342f025348e2d23f5c9bb1311bdafcba21a9b69.jpg",
"checksum": "3d4eacf46ae6ab1a4baf44745c87963b"
}
]
}