{
"source_article_link": "https://www.thehindu.com/news/national/in-kolkata-amit-shah-says-trinamool-patronising-infiltration/article24663961.ece",
"title": "Trinamool Congress patronising infiltration, alleges Amit Shah - The Hindu",
"date_published": "2018-08-11T13:30:01+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "BJP president Amit Shah said here on Saturday that West Bengal Chief Minister Mamata Banerjee’s opposition to the update of the National Register of Citizens (NRC) in Assam would have no impact on the exercise, and the process would be completed in a judicious manner. “Mamata di , the NRC will not stop at your opposition. You can oppose, Congress party’s leader Rahul Gandhi can oppose, but our commitment is to complete the process of NRC in Assam in a judicious manner,” he said at a Bharatiya Janata Yuva Morcha meeting. Mr. Shah accused the Trinamool Congress chairperson of creating confusion about the NRC in West Bengal. He referred to the Citizenship (Amendment) Bill, 2016, brought by the BJP-led government, and said it had the provision to provide citizenship to Hindus, Buddhists and Christians who had come from Afghanistan, Bangladesh and Pakistan. “The Government of India will ensure that asylum seekers are allowed to stay in the country,” he said. Mr. Shah recalled Ms. Banerjee’s opposition to “illegal infiltration” in 2005, and alleged that she had taken a U-turn as the “infiltrators” were now voting for the Trinamool Congress. “Mamata ji , you will have to make your stand clear before the people of the State, whether you are for infiltrators or for national security,” he said. Unlike the State leadership of the party, which has been claiming that the BJP will initiate a similar process of NRC in West Bengal if it comes to power, the BJP president did not make any such claims. However, he alleged that the way infiltration is taking place, “West Bengal will turn into West Bangladesh”. He gave a call to “uproot” the Trinamool Congress from power. Observing that the people of the State had “given a chance to the Congress, the communists and the Trinamool Congress,” he urged them to give an opportunity to the BJP.",
"description": "In Kolkata, BJP chief flays Congress president, Mamata over NRC.r",
"time_scraped": "2018-08-17 04:54:10.960829",
"article_id": "24663961",
"article_category": "National",
"image_details": []
}