{
"source_article_link": "https://www.thehindu.com/news/national/gst-sop-likely-ahead-of-polls-in-mp-rajasthan-and-chattisgarh/article24682505.ece",
"title": "GST sop likely ahead of polls in M.P., Rajasthan and Chattisgarh - The Hindu",
"date_published": "2018-08-13T23:30:06+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/ain62k/article24682504.ece/ALTERNATES/FREE_1080/13TH-THGRP-SSI"
],
"article_body": "The run-up to the polls in Gujarat saw a massive rejig of Goods and Services Tax (GST) rates across the board as disenchantment with the regime was at a peak. Ahead of the Assembly polls in three BJP-ruled States — Madhya Pradesh, Rajasthan and Chattisgarh — some relief for Micro Small and Medium Enterprises (MSMEs) is likely. A possible exemption from filing for firms with a turnover of up to ₹5 crore is said to be in the offing. Senior sources in the GST Council told The Hindu that during the last meeting of the Council, it was decided that rate cuts etc. were not the route to take to give relief to the MSME sector; instead exemptions from the GST ambit for firms with a turnover of upto ₹5 crore could be the way to go. “Several States, specifically Gujarat and Delhi, have asked that exemptions be given for MSMEs with a turnover of upto ₹5 crore, whereas some other States have asked [that] the limit be for firms of upto ₹1.5 lakh,” said a source. The decision may be announced in the next meeting of the Council on September 28 in Goa — close to polling in the three States, scheduled for the end of the year. Union Minister Arun Jaitley is expected to be back at the helm of affairs at the Finance Ministry by then. At the last meeting of the Council, Finance Minister Piyush Goyal had said all suggestions from various States should be collated and considered. Madhya Pradesh with 26.74 lakh firms and Rajasthan with 26.87 lakh have a huge MSME presence and the any relief to the sector, currently dissatisfied with cumbersome filing procedures, would be politically important. “Rate cuts in the context of MSMEs have been dismissed as not workable and these cuts will affect not just these units but bigger suppliers etc. Exemptions from tax and filing procedures will have a more direct impact in terms of giving relief,” said a member of the GST Council.",
"description": "MSMEs with a turnover of up to ₹5 crore may be exempted from filing returns.",
"time_scraped": "2018-08-17 04:57:04.527597",
"article_id": "24682505",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/ain62k/article24682504.ece/ALTERNATES/FREE_1080/13TH-THGRP-SSI",
"path": "full/392bbd2e6e08a07576de9d85a0897e99408916ba.jpg",
"checksum": "4b242752e9c52233597e804271f31642"
}
]
}