{
"source_article_link": "https://www.thehindu.com/news/national/pms-speech-hollow-rahul/article24698215.ece",
"title": "PM’s speech hollow: Rahul - The Hindu",
"date_published": "2018-08-15T21:54:15+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/7i1wgd/article24698214.ece/ALTERNATES/FREE_1080/15TH-THGRP-RAHUL"
],
"article_body": "Congress president Rahul Gandhi unfurled the tricolour at party headquarters on Monday in the presence of senior leaders including former Prime Minister Manmohan Singh and former party president Sonia Gandhi. Though Mr. Gandhi didn’t speak to the media, he tweeted to “remember all those brave men and women, our freedom fighters, whose sacrifices and dedication helped us win our independence.” Reacting to Prime Minister Narendra Modi’s Red Fort speech, the party dared the Prime Minister to accept the Congress chief’s challenge to have a public debate on issues such as Rafale, allegations of corruption, mob lynching, and Chinese incursions, among others. A couple of days ago, Mr. Gandhi had said “Prime Minister won’t be able to last a few seconds” if he accepted an open debate on Rafale. Congress’s chief spokesperson Randeep Surjewala recalled how Mr. Modi, in 2013, had created a Red Fort-like replica in Chhattisgarh from where he had challenged the then Prime Minister, Dr. Manmohan Singh, to an open debate on issues like corruption, China and Pakistan threatening India’s territorial integrity, falling rupee and failing economy, plight of farmers and unemployment. “As Modi ji addressed the nation for the fifth time today after taking over as the Prime Minister, we would like to ask him: are you ready for a debate on these very issues with Congress president Rahul Gandhi? Will you debate on the issue of corruption and Rafale and Vyapam and other corruption scams of your government about which you did not utter a single word from the precincts of the Red Fort?”asked Mr. Surjewala. The Congress described Mr. Modi’s Independence Day address as “hollow” and devoid of truth and meaning for the common person as it didn’t talk about issues such as “women’s safety, unemployment, growing atmosphere of hatred and discrimination.” Achche din is ‘fake’ The Congress claimed that people were now tired of the “fake achche din” promised by the BJP and are waiting for “sachche din” (truthful days). Mr. Surjewala added that the Prime Minister should not insult the contribution of millions of Indians by claiming that India got its rightful place in the world only after May 2014. The Congress leader also said there was a need to engage in a second struggle for independence from discrimination, unemployment, poverty, and from empty rhetoric and promises.",
"description": "Modi failed to address key issues troubling the nation, says Congress",
"time_scraped": "2018-08-17 04:57:07.177706",
"article_id": "24698215",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/7i1wgd/article24698214.ece/ALTERNATES/FREE_1080/15TH-THGRP-RAHUL",
"path": "full/51c6dcf88663ce1b45437b2a44220c466abbe0e7.jpg",
"checksum": "4c7f51af2c10c9d6ac84fd64d887bd4d"
}
]
}