{
"source_article_link": "https://www.thehindu.com/news/national/kashmir-candidates-allege-skewed-police-recruitment/article24693543.ece",
"title": "Kashmir candidates allege ‘skewed’ police recruitment - The Hindu",
"date_published": "2018-08-15T00:17:00+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Over 7,000 Kashmir-based aspirants for the recently announced posts of sub-inspector in Jammu and Kashmir have made representations before the state police’s brass, alleging “skewed recruitment” in which over 70% candidates who made it to the final list were from the Jammu region. The J&K Police Recruitment Board on August 6 declared the results for the examination conducted in June this year for 2,057 posts meant for executive and telecom wings of the force. “The results reflected an unimaginable tilt towards the candidates from the Jammu region. Only 30% of the [selected] candidates were from the Kashmir region, which has more population than Jammu,” a candidate told The Hindu on the condition of anonymity. The official figures, accessed by The Hindu , suggested that a total of 16,130 candidates from both Kashmir and Jammu regions qualified the physical test conducted in August-September 2017. As many as 8,069 candidates from Jammu and 8,061 from Kashmir passed the physical test in order to be eligible for the written test. Of these 16,130 candidates, 15,425 appeared in the written test held this year. Later, a total of 2,057 candidates were selected, of which 1,442 were from the Jammu region and only 615 from Kashmir. “Candidates in Kashmir are at the receiving end. They face militant threats. Despite the hardships, candidates appear for police force examinations. But such a result will dampen their enthusiasm, which seems to be the design,” said another candidate. Senior BJP leader Chowdhary Lal Singh on Monday sought a division of all major recruitment agencies, such as the Public Service Commission (PSC) and Service Selection Board (SSB), between Jammu and Kashmir regions. “There is discrimination in recruitment. Youth from Jammu are being humiliated on every count. The time has come to split the PSC and the SSB to make recruitments region wise. Even the tax collection should be separated so that the collections are spent in their respective regions,” he said.",
"description": "Over 7,000 Kashmir-based aspirants for the recently announced posts of sub-inspector in Jammu and Kashmir have made representations before the state police’s brass, alleging “skewed recruitment” in which over 70% candidates who made it to the final list were from the Jammu region. The J&K Police Recruitment Board on August 6 declared the results for the examination conducted in June this year for 2,057 posts meant for executive and telecom wings of the force. “The results reflected an unimaginable tilt towards the candidates from the Jammu region. Only 30% of the [selected] candidates were from the Kashmir region, which has more population than Jammu,” a candidate told The Hindu on the condition of anonymity.",
"time_scraped": "2018-08-17 04:58:24.684078",
"article_id": "24693543",
"article_category": "National",
"image_details": []
}