{
"source_article_link": "https://www.thehindu.com/news/national/assam-rejected-move-to-shrink-area-under-afspa/article24698220.ece",
"title": "‘Assam rejected move to shrink area under AFSPA’ - The Hindu",
"date_published": "2018-08-15T21:54:58+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/4sasom/article24698219.ece/ALTERNATES/FREE_1080/15TH-ARMY"
],
"article_body": "According to a parliamentary standing committee report tabled in Parliament last month, the Centre wanted to reduce the areas under the Armed Forces Special Power Act (AFSPA) in Assam but the State government did not concur. Over the past two years, the Union Home Ministry has proposed reducing the areas under AFSPA in the northeast, only to face stiff resistance from the Army and the Defence Ministry. On Tuesday, over 300 Army officers moved the Supreme Court challenging registration of FIRs against them for operations in areas where AFSPA is in force. The parliamentary committee headed by former Union finance minister and senior Congress leader P. Chidambaram in its report tabled on July 19 said with improvement in security situation in most northeast States, “the Government should consider gradually reducing the area under AFSPA, especially in the States of Assam and Meghalaya.” As per Section 3 of the AFSPA, it can be invoked in places “where the use of armed forces in aid of the civil power is necessary.” AFSPA empowers Army and Central forces personnel deployed in “disturbed areas” to kill anyone acting in contravention of the law, arrest and search any premises without a warrant and provide cover to forces from prosecution and legal suits without the Centre’s sanction. Difference of opinion The parliamentary panel report said there was some difference of opinion between the Government of India and the State government with regard to the areas to be declared as “disturbed areas.” “The Committee is unable to comprehend the divergent perceptions of the situation in Assam. On the one hand, the Ministry has asserted that there has been an improvement in the security situation in Assam and on the other hand, the area declared as disturbed area under the AFSPA has been increased on the plea that it is not the appropriate time to reduce the area... . This is a paradoxical situation that needs to be resolved,” the report said. The committee also noted that the State Government has notified the whole State as disturbed on the plea that it was not the right time to reduce the area under AFSPA.",
"description": "Parliamentary panel says the Centre wanted to reduce the coverage of the Act as the security situation had improved",
"time_scraped": "2018-08-17 04:54:43.335063",
"article_id": "24698220",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/4sasom/article24698219.ece/ALTERNATES/FREE_1080/15TH-ARMY",
"path": "full/32e13164659033bb90b6a918f1b70c3864979f3d.jpg",
"checksum": "d682b0a94bfa39bec175ddfa5915dc1e"
}
]
}