{
"source_article_link": "https://www.thehindu.com/news/national/will-move-forward-in-jk-by-embracing-all-not-by-goli-and-gaali-says-modi/article24696861.ece",
"title": "Will move forward in J&K by embracing all, not by ‘goli and gaali’, says Modi - The Hindu",
"date_published": "2018-08-15T16:49:03+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/l02a7i/article24696860.ece/ALTERNATES/FREE_1080/NARENDRAMODI-KESAVAN"
],
"article_body": "The government will move forward in Jammu and Kashmir by adopting an approach of embracing all and not by ‘ goli and gaali ’ (bullet and abuse), Prime Minister Narendra Modi said on Wednesday as he announced that elections to village panchayats and local bodies in the state would be held in coming months. Speaking from the ramparts of Red Fort on the 72nd Independence Day, Mr. Modi said his government will move ahead in the state by following the path of ‘ Insaaniyat, Kashmiriyat and Jamhuriyat ’ as shown by former prime minister Atal Bihari Vajpayee. He said his government wants to ensure balanced development of the three regions of Jammu and Kashmir - Ladakh, Jammu and the Kashmir Valley — and the communities living there. The prime minister said the central government is now directly sending funds to villages to ensure speedy development. Through this, he added, elected village heads will get more power to take their areas forward. “In Jammu and Kashmir, Atal Bihari Vajpayee ji had shown us the path — and that path is right. We want to move forward on that path. Vajpayee ji had said we have to move forward to ensure Kashmir’s development on ‘ Insaaniyat, Kashmiriyat and Jamhuriyat ’ “Be it Ladakh, Jammu or Kashmir Valley, there should be balanced development in the state and hopes and aspirations of common people there should be fulfilled. Infrastructure should be improved and we should move forward with the sentiment of embracing all. “We want to move forward by embracing the people of Kashmir, who live with great patriotic feelings, and not on the path of ‘ goli and gaali ’ (bullet and abuse),” he said. Mr. Modi said irrigation schemes were moving forward in the state and work to set up an IIT, an IIM and an AIIMS and the reconstruction of the famous Dal Lake is also being undertaken. “In very near future, we are moving forward towards holding panchayat and local body elections,” he said, noting that efforts are being made to strengthen democratic institutions in the state. Mr. Modi said people living in villages of Jammu and Kashmir and village heads were meeting him in large numbers, demanding early elections to panchayats and local bodies. The elections have remained stalled for some reason or the other. The last panchayat polls in Jammu and Kashmir were held in 2011 and the urban local body elections have not been held for nearly eight years. “I am happy to say that in coming months, people of Jammu and Kashmir will get an opportunity to exercise their right and set up their own system,” the prime minister said. In Srinagar, Jammu and Kashmir Governor N N Vohra said the urban local body and panchayat polls will be held from September. He said elections to urban local bodies will take place in September-October while the phased panchayat polls will be held in October-December.",
"description": "The prime minister said the central government is now directly sending funds to villages to ensure speedy development.",
"time_scraped": "2018-08-17 04:57:40.681221",
"article_id": "24696861",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/l02a7i/article24696860.ece/ALTERNATES/FREE_1080/NARENDRAMODI-KESAVAN",
"path": "full/80288b059c4f29093bed520355041a3f6ee7014a.jpg",
"checksum": "fe8959fe4c4e0edb666c6c94e627b4fa"
}
]
}