{
"source_article_link": "https://www.thehindu.com/news/national/cong-mocks-bjp-over-video-of-tricolour-falling-at-party-headquarters/article24697325.ece",
"title": "Congress mocks BJP over video of tricolour falling at party headquarters - The Hindu",
"date_published": "2018-08-15T19:01:29+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "The Congress on Wednesday took a swipe at the BJP after the tricolour at the ruling party’s headquarters slid to the ground when BJP chief Amit Shah was trying to unfurl it. The Congress questioned how the BJP planned to manage the country when they cannot even handle the national flag. The Congress posted a video on its official Twitter handle in which the BJP chief was seen unfurling the flag, which slid to the ground accidentally when he pulled the string to unfurl it. However, Mr. Shah immediately caught hold of the string and pulled the flag up. The Congress tweeted, “Those who cannot handle the flag, how will they handle the country?” जो देश का झंडा नहीं संभाल सकते, वो देश क्या संभालेंगे? 50 साल से ज्यादा देश के तिरंगे का तिरस्कार करने वालों ने अगर ये नहीं किया होता तो शायद आज तिरंगे का ऐसा अपमान न होता। दूसरों को देशभक्ति का सर्टिफिकेट देने वालों को राष्ट्रगान का तौर-तरीका तक पता नहीं। pic.twitter.com/FmiEI5B7D7 — Congress (@INCIndia) August 15, 2018 “If those people who have treated the flag with contempt for over 50 years had not done so, the flag would not have been insulted like it was today,” the party said. Those that give “certificates of patriotism” to people, do not even know the etiquettes of the national anthem, the Congress said. Bharat Mata is sad: Kejriwal Taking a dig at the flag falling incident at the BJP headquarters on Independence Day, Delhi Chief Minister Arvind Kejriwal said it reflected that “Bharat Mata” is “sad”, and added that no matter how strong, one has to bow down before the nature. Mr. Kejriwal’s reaction came on a video showing BJP chief Amit unfurling the national flag that fell as he pulled the string. “Nature works in strange ways. No matter how strong one is, he has to bow down before the nature. The tricolour refused to be unfurled at the hands of Amit Shah. Bharat Mata is saying through this flag that she is sad,” he tweeted in Hindi. The video went viral, with Mr. Kejriwal also sharing it on his official Twitter handle. It was also shared by the Congress that took a swipe at the BJP, questioning how the party would manage the country when they cannot handle the national flag.",
"description": "The Congress questioned how the BJP planned to manage the country when they cannot even handle the national flag.",
"time_scraped": "2018-08-17 04:54:44.808157",
"article_id": "24697325",
"article_category": "National",
"image_details": []
}