{
"source_article_link": "https://www.thehindu.com/news/national/keeping-leh-free-of-plastics/article24697999.ece",
"title": "Keeping Leh free of plastics - The Hindu",
"date_published": "2018-08-15T21:24:19+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/xjqy16/article24697998.ece/ALTERNATES/FREE_1080/thjc-Leh"
],
"article_body": "Tsering Chondol, 60, remembers a time when the water that flowed through the town of Leh, high in the Himalayas, was pristine. “We used to drink directly from the streams — until our land became a tourist hub,” said Ms. Chondol, who heads the Women’s Alliance of Ladakh. More than 2,77,000 tourists visited Leh last year alone, the local tourism body said, twice the number of residents in the region. Rigzin Spalgon, who heads Leh’s municipal committee, said that a decade ago the city produced almost no waste. “All of a sudden we started generating more than 20 tonnes of waste and a lot of sewage per day,” Mr. Spalgon said. The steady environmental deterioration spurred more than 4,000 volunteers in the Women’s Alliance of Ladakh to take measures to tackle plastic waste. Jammu and Kashmir, where Ladakh is located, has banned plastic bags. Using a plastic bag carries a fine of ₹5,000 or up to one month in jail, or both. “We were able to make Ladakh free of plastic carry-bags all because of the efforts of Women’s Alliance of Ladakh. They initiated the whole process and later ensured that the ban on plastic bags works,” said Mr. Spalgon. In Ladakh, alliance volunteers — backed by the local council and the police — inspect shops and markets up to three times a year. They also come armed with a solution: not only do they warn locals about the damage plastic bags do in the environment, but they sell handmade cloth bags as an alternative.",
"description": "Women volunteers have played a key role in enforcing the ban in the tourist town",
"time_scraped": "2018-08-17 04:54:14.257128",
"article_id": "24697999",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/xjqy16/article24697998.ece/ALTERNATES/FREE_1080/thjc-Leh",
"path": "full/7e1e3d135924df165deda4de4820465eadd6be8e.jpg",
"checksum": "20531ffbaf979175221f0be1430f8d08"
}
]
}