{
"source_article_link": "https://www.thehindu.com/news/national/modis-big-ticket-announcement-is-ayushman-bharat/article24698351.ece",
"title": "Narendra Modi’s big-ticket Independence Day announcement is Ayushman Bharat - The Hindu",
"date_published": "2018-08-15T22:13:46+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/sci-tech/health/z5yiw6/article24698936.ece/ALTERNATES/FREE_1080/Jan%20Arogya%20Abhiyaan%20Scheme"
],
"article_body": "The healthcare sector has welcomed Prime Minister Narendra Modi’s announcement in his Independence Day address that the Pradhan Mantri Jan Arogya Abhiyaan, also known as Ayushman Bharat or the National Health Protection Mission (AB-NHPM), will be launched on September 25. The government-sponsored health insurance scheme will provide free coverage of up to ₹5 lakh a family a year in any government or even empanelled private hospitals all over India. Meant to help the poor and the economically deprived, the scheme will be available for 10.74 crore beneficiary families and about 50 crore Indian citizens. Universal healthcare Healthcare experts said Ayushman Bharat was an attempt to ensure that universal healthcare reached the weaker sections of society and it could raise the ratio of people availing primary and secondary healthcare. “It is really good to see that the government is actively working on rolling out the policy on the ground. The government has made this a technology-driven initiative, which is a great step to ensure transparency and effective implementation, and at a grander scale, this initiative would encourage more work in development of overall health infrastructure in the country,” said Sanjeev Gupta of the Kusum Group of Companies, a pharmaceutical organisation. “We welcome these steps taken by the government as growing healthcare infrastructure in the country will help 50 crore poor people access medicines and essential drugs. What we look forward from the government is a mechanism which encourages public private partnership while ensuring that quality medicines reach the masses.” Rana Mehta, partner and leader healthcare, PwC, India, said that besides addressing the challenges of geographic inaccessibility and unaffordability, Ayushman Bharat had the potential of creating a cost-effective digitalised health economy and catapulting India to the league of developed nations. B.S. Ajai Kumar, founder chairman, HCG Hospitals, said: “Today, nearly 80% of the healthcare in India is provided by the private healthcare system and in order to meet the burgeoning healthcare needs of Indian population through value-based medicine, the country needs a synchronised effort by both private and public sector.’’ “But the current framework of the scheme will not be beneficial for people who need tertiary care as the remunerations under the scheme will not be sufficient to avail value-based healthcare. Under the scheme, tertiary healthcare service providers will be forced to cut cost at every level, which will lead to offering a sub-standard healthcare to patients under the scheme. They may not be able to avail the necessary medication, technology and clinical expertise to get the best outcome and will soon lose confidence in the system,” Dr. Kumar said. The healthcare sector has noted that the government should look at mandatory universal health cover for all sections of society which will increase the pool and allow cross-subsidy between the government and the private sector.",
"description": "Health protection scheme for 10.74 crore beneficiary families and 50 crore Indian citizens",
"time_scraped": "2018-08-17 04:54:42.626469",
"article_id": "24698351",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/sci-tech/health/z5yiw6/article24698936.ece/ALTERNATES/FREE_1080/Jan%20Arogya%20Abhiyaan%20Scheme",
"path": "full/9f01be4f60adbd693b793d3e847d235e5f37c991.jpg",
"checksum": "6eeca669039feecd4fc825e7fb077aa5"
}
]
}