{
"source_article_link": "https://www.thehindu.com/news/national/breath-of-freedom-amid-constraints-of-security/article24698263.ece",
"title": "Breath of freedom amid constraints of security - The Hindu",
"date_published": "2018-08-15T22:05:06+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/omltco/article24698262.ece/ALTERNATES/FREE_1080/15TH-THGRP-FORT"
],
"article_body": "Amid tight security, Prime Minister Narendra Modi addressed the nation from the ramparts of the Red Fort on the occasion of 72nd Independence Day. Mr. Modi unfurled the national flag amid 21 gun salute at 7.30 a.m. The national capital was on high alert and a multi-layer security system was in place around the Red Fort. Various entry points were sealed and movement of heavy vehicles was restricted. The 3-km area across the Red Fort was sanitised for general vehicles. Buses, cars and government vehicles with valid passes were allowed to enter. NSG commandos and women commandos of the Delhi Police’s SWAT unit were deployed for security in and out of the Red Fort. “Multiple security units comprising Delhi police, paramilitary, Intelligence Bureau, military intelligence, NSG and other units were deployed for the Prime Minister’s security,” said a senior police official. Students among the audience cheered when Mr. Modi announced that women officers who have been selected through the Short Service Commission in defence forces would now have the option to take up permanent commission. “I always wanted to be a part of the Independence Day event at Red Fort and since it was the Prime Minister’s last speech from the Red Fort of this term, I do not want to miss it. I really appreciate Mr. Modi for his concern on women safety and supporting capital punishment for rape accused,” said Neha Bhati, a spectator. A group of differently abled children were accompanied by an interpreter who translated the Prime Minister’s speech and other announcements to them live. “Children were excited to be a part of the event. I and three other interpreters helped them to understand the speech. Mr. Modi in his speech also mentioned about the e-dictionary developed by the Indian Sign Language Research and Training Centre (ISLRTC) to overcome language barrier for hearing and speech impaired people,” said Sanskriti Bhatia, an interpreter from Sai Swayam Society. As anticipated by the security agencies, Mr. Modi, after delivering his speech, while moving out of the Red Fort in his cavalcade, got out of the vehicle to meet school children who had performed at the event. He interacted with them while security persons were seen having a tough time in controlling over-enthusiastic children who tried to shake hands with the Prime Minister. “We have to form a new nation and achieve new heights,” said Mr. Modi in his speech which ended with chanting of ‘Bharat Mata Ki Jai’.",
"description": "National capital was on high alert, with entrances sealed and movement of heavy vehicles restricted",
"time_scraped": "2018-08-17 04:54:11.803695",
"article_id": "24698263",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/omltco/article24698262.ece/ALTERNATES/FREE_1080/15TH-THGRP-FORT",
"path": "full/aa840e18506f975247fa9dc79913e591554a78d7.jpg",
"checksum": "d43d42ca48b766026ff01433c86cdb94"
}
]
}