{
"source_article_link": "https://www.thehindu.com/news/national/easy-to-criticise-but-difficult-to-transform-an-institution-cji-dipak-misra/article24696858.ece",
"title": "We serve the Lady of Justice, says CJI Dipak Misra - The Hindu",
"date_published": "2018-08-15T16:48:41+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "After a year of facing dissent from within the Supreme Court judiciary and an impeachment motion by Opposition MPs, Chief Justice of India Dipak Misra on Wednesday said it is easy to criticise and attack but transforming an institution into a performing one is the difficult part. The image of the apex court has recently taken a beating over a range of issues starting with the January 12 press meet of its four senior most judges – Justices (now retired) J. Chelameswar, Ranjan Gogoi, Madan B. Lokur and Kurian Joseph – to the failed bid by the Opposition to remove Chief Justice Misra. On January 12, the four Supreme Court judges had held a press conference, a first of its kind in the history of the apex court, to accuse recent Chief Justices of India of “selective” allocation of cases to certain judges. The press meet had followed a decision of a Constitution Bench led by Chief Justice Misra, declaring the Chief Justice of India’s dominance as the master of the roster in order to protect the Supreme Court from “anarchy”. “To criticise, attack and destroy the system is quite easy what is difficult and challenging is to transform it into a performing one. For that one has to transcend one’s personal ambitions or grievances rather constructive steps need to be taken with positive mindset,” Chief Justice Misra said in his Independence Day address. He quickly added “let us not identify with anyone… there may be some elements who may endeavor to weaken the institution”. The Supreme Court, while hearing a PIL filed by an organisation called ‘In Pursuit of Justice’ in April, had orally observed that it was “unfortunate” that the judiciary was subjected to unrestrained verbal assault by certain parliamentarians and the media in the backdrop of an unprecedented impeachment motion for the removal of Chief Justice Misra by Opposition MPs. The petition had alleged that the “acts of certain parliamentarians, as revealed in newspaper reports, have demeaned, damaged and placed at risk the independence of judiciary.”",
"description": "After a year of facing dissent from within the Supreme Court judiciary and an impeachment motion by Opposition MPs, Chief Justice of India Dipak Misra on Wednesday said it is easy to criticise and attack but transforming an institution into a performing one is the difficult part. The image of the apex court has recently taken a beating over a range of issues starting with the January 12 press meet of its four senior most judges – Justices (now retired) J. Chelameswar, Ranjan Gogoi, Madan B. Lokur and Kurian Joseph – to the failed bid by the Opposition to remove Chief Justice Misra. On January 12, the four Supreme Court judges had held a press conference, a first of its kind in the history of the apex court, to accuse recent Chief Justices of India of “selective” allocation of cases to certain judges. The press meet had followed a decision of a Constitution Bench led by Chief Justice Misra, declaring the Chief Justice of India’s dominance as the master of the roster in order to protect the Supreme Court from “anarchy”. “To criticise, attack and destroy the system is quite easy what is difficult and challenging is to transform it into a performing one. For that one has to transcend one’s personal ambitions or grievances rather constructive steps need to be taken with positive mindset,” Chief Justice Misra said in his Independence Day address.",
"time_scraped": "2018-08-17 04:57:07.146334",
"article_id": "24696858",
"article_category": "National",
"image_details": []
}