{
"source_article_link": "https://www.thehindu.com/news/national/permanent-commission-will-lift-the-morale-of-women/article24698292.ece",
"title": "Permanent commission will lift the morale of women - The Hindu",
"date_published": "2018-08-15T22:08:10+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/r18pxu/article24698291.ece/ALTERNATES/FREE_1080/16TH-GRP-IDAY-WOMEN"
],
"article_body": "Prime Minister Narendra Modi on Wednesday announced in his Independence Day address that women officers in the military would get permanent commission on a par with their male counterparts. Details will be issued shortly, official sources said. “From the ramparts of the Red Fort today, I announce this for the lakhs of daughters who wear the uniform and want to work for the country. This is my gift for them today,” Mr. Modi said. Permanent commission exists for women in select areas in the military. However, Mr. Modi’s speech makes it clear that the government wants to expand these categories. “I want to give good news to our brave daughters. Women officers who have been selected through the short service commission in our defence forces will get the opportunity for a permanent commission,” Mr. Modi said. Many women officers have taken the legal route demanding permanent commission, and in April, the government told the Supreme Court that it was open to it. The contours of implementation are being finalised by the Defence Ministry, an official source said. Official figures Going by the official figures available in March, the Army has 1,561 women officers, the Air Force 1,594 and the Navy 644. So far, women officers are recruited mostly on short service commission for 14 years and permanent commission is allowed in select streams, which means they are not eligible to get pension. The Army is the most reluctant in granting it. While women are given commission in all arms and services other than infantry, mechanised infantry, armoured and Artillery, permanent commission is currently limited to education, legal branches apart from medical and dental services. These two streams were opened for permanent commission in all three services in 2011.",
"description": "This is a good news to our brave daughters, says Modi in I-Day speech",
"time_scraped": "2018-08-17 04:53:50.408562",
"article_id": "24698292",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/r18pxu/article24698291.ece/ALTERNATES/FREE_1080/16TH-GRP-IDAY-WOMEN",
"path": "full/94f55d4cb4258d1da41d4e897fe7bb39a87fb0a4.jpg",
"checksum": "f3536570f460dc2eb2b069f3c4b1eb04"
}
]
}