{
"source_article_link": "https://www.thehindu.com/news/national/in-independence-day-speech-modi-sets-up-2019-battle/article24695589.ece",
"title": "Narendra Modi sounds 2019 poll bugle from Red Fort - The Hindu",
"date_published": "2018-08-15T10:40:03+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/8ix4xn/article24698226.ece/ALTERNATES/FREE_1080/TH16NEWMODIjpg"
],
"article_body": "In his last Independence Day address before the next General Elections, Prime Minister Narendra Modi announced not just the launch date for the Pradhan Mantri Jan Aarogya Abhiyan health insurance scheme, but also that women officers in short service commissions in uniformed services will be eligible for permanent commission similar to male counterparts. The speech, at 82 minutes, repeatedly compared his own government’s achievements to the “situation in 2013”. The speech was not just a report card of his tenure as Prime Minister but also a signal on future priorities if elected back next year. He said India will launch its first manned space mission by 2022, which could make it the fourth nation to do so after the United States, Russia and China. As emphasis went, the speech dwelt the longest on women and the poor. Mr. Modi decried the “demonic tendencies” of violence against women, and lauded fast track courts handing out death penalties in several cases -- a mention that got a round of applause from the audience. He also announced that women short service commission officers in uniformed forces would get permanent commissions on transparent lines. “I’m proud to say that my Cabinet has the largest representation of women since independence,” he said. He made a special mention of his government’s efforts at bringing a Bill banning the practice of instant Triple Talaq among Muslims. “We tried to pass the Bill in the last session but there are those who have an interest in blocking it. It is my promise to my Muslim sisters that my government will try get the Bill passed,” he said. Prime Minister Modi also emphasised the speed at which his government had moved on basic developmental work like providing power, housing and toilets in villages and small towns. “We have the same people and systems but look at the speed at which things have been done. Achievements of this government have to be weighed in against what went on before, in 2013,” he said, targeting the previous UPA government. He announced anti-corruption measures and reassured tax payers that their money was not being wasted in leakages of government funds. The Prime Minister pointed to several pieces of legislation passed by his government to tackle graft. “We have passed the banking reforms bill, the bankruptcy code and the benami properties act. We are a government that has the will to take tough decisions,” he said. “Our government has added, in the last four years, double the number of direct tax payers from the last 70 years. I want the unsung tax payers of this country to know that my government is committed to ending leakage of public funds, and when you sit down for a meal be assured that a poor man and his family is also getting a meal under welfare programmes funded by your honestly paid tax,” he said. While the speech in 2017 was dominated by Jammu and Kashmir, this year Mr. Modi repeated his call for dialogue and reconciliation, plumping for gale milna (a hug) rather than g ali (abuse) or goli (bullet) and former Prime Minister A.B. Vajpayee’s approach of ‘Insaaniyat, Kashmriyat and Jamhooriyat.’ He also said that panchayat polls in Jammu and Kashmir would be held soon, and wished for a “balanced development” of all regions of the State. He quoted Tamil poet Subramania Bharathiyar to emphasise that India was on its way to assuming some leadership in international fora: “India will show the world the way to freedom from all forms of slavery” he quoted from a poem by Bharathiyar, and said that India was being heard seriously at international multilateral fora. “The strength of the Indian passport has gone up and Indians know that wherever they are in trouble, the Indian government will not abandon them,” he said. He ended the speech on a poetic note, exhorting the dawn of a “Navyug” or a new era, hewing to the meta narrative of the speech for a political renaissance.",
"description": "Prime Minister Narendra Modi’s speech was not just a report card of his tenure as Prime Minister but a signal on future priorities if elected again",
"time_scraped": "2018-08-17 04:58:03.485231",
"article_id": "24695589",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/8ix4xn/article24698226.ece/ALTERNATES/FREE_1080/TH16NEWMODIjpg",
"path": "full/5f4df8712a7c5ac0104ebc6e2a867f4329c4bdf2.jpg",
"checksum": "4cbc5cdd4eff212115ec476fc5ce0ea5"
}
]
}