{
"source_article_link": "https://www.thehindu.com/news/national/venkaiah-writes-a-book-on-first-year-in-office/article24693568.ece",
"title": "Venkaiah writes a book on first year in office - The Hindu",
"date_published": "2018-08-15T00:23:40+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/hk0xwt/article24693571.ece/ALTERNATES/FREE_1080/VENKAIAHSWEARINGINjpg"
],
"article_body": "Venkaiah Naidu, who took up the office of Vice-President reluctantly, is coming up with a book detailing his experience in the first year. A year in office , published by Rupa Publishers, will be released by Prime Minister Narendra Modi on August 20, in presence of two former Prime Ministers Manmohan Singh and Deve Gowda. Also in attendance will be Leader of the Rajya Sabha Arun Jaitley and Leader of the Opposition Ghulam Nabi Azad. Mr. Naidu completed one year as Vice-President on August 11. He broke down at a meeting in which BJP president Amit Shah announced his nomination. “I lost my mother when I was a year old. For me, my party was my mother. But the day I was picked up for the post, I lost my second mother, too,” he has often said. The book, largely a collection of pictures, details the initiatives taken by him. The highlights of his first year are the disqualification of Rajya Sabha member Sharad Yadav within three months of the JD(U) moving a plea, while his predecessors took years to do so. The second was to reject the Opposition’s petition to impeach Supreme Court Chief Justice Dipak Mishra, a decision that was criticised by many for its speed. More recently, he made the headlines for expunging Prime Minister Narendra Modi’s remarks in his felicitation for the newly elected Deputy Chairman. Mr. Naidu has so far visited 28 of the 29 States. He was to have visited the 29th State, Sikkim, but the trip was cancelled after he reached the Bagdogra airport in West Bengal because of bad weather.",
"description": "Venkaiah Naidu, who took up the office of Vice-President reluctantly, is coming up with a book detailing his experience in the first year. A year in office , published by Rupa Publishers, will be released by Prime Minister Narendra Modi on August 20, in presence of two former Prime Ministers Manmohan Singh and Deve Gowda. Also in attendance will be Leader of the Rajya Sabha Arun Jaitley and Leader of the Opposition Ghulam Nabi Azad. Mr. Naidu completed one year as Vice-President on August 11. He broke down at a meeting in which BJP president Amit Shah announced his nomination. “I lost my mother when I was a year old. For me, my party was my mother. But the day I was picked up for the post, I lost my second mother, too,” he has often said. The book, largely a collection of pictures, details the initiatives taken by him.",
"time_scraped": "2018-08-17 04:54:12.715734",
"article_id": "24693568",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/hk0xwt/article24693571.ece/ALTERNATES/FREE_1080/VENKAIAHSWEARINGINjpg",
"path": "full/e5c7bd2230cf2070498f15cc23226ed2807b162b.jpg",
"checksum": "650595adb7ed011a0b00dceea30d103b"
}
]
}