{
"source_article_link": "https://www.thehindu.com/news/national/a-post-truth-speech-says-yechury/article24698318.ece",
"title": "A post-truth speech, says Yechury - The Hindu",
"date_published": "2018-08-15T22:09:19+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "The Opposition termed the Independence Day address of Prime Minister Narendra Modi an election campaign speech, packed with rhetoric and divorced from reality. “It is a classic post-truth speech which was completely divorced from the ground realities and harps solely on propaganda. The Prime Minister absolutely did not mention anything about the killing of innocents by mobs and did not spell out steps that his government plans to take to stop it,” CPI(M) general secretary Sitaram Yechury said. “He spoke of Ambedkar and Subramania Bharati. I want to ask him, who is working against the vision of these two men? It is the BJP and the RSS,” CPI leader D. Raja said. He slammed the Prime Minister for claiming that development was growing at a snail’s pace before 2014. “If that is the case, then he is also criticising his own party’s government led by Atal Bihari Vajpayee from 1998 to 2004,” he said. NCP MP Majeed Memon said.“The Triple Talaq Bill is a farce and only a political instrument. If this government was keen on passing it, why was it not listed from the very first day of the monsoon session. Why put it up only on the last day of the session, which was a Friday, a day marked for private members’ Bills.” Manoj Jha, Rashtriya Janata Dal MP, said the Modi government had read the writing on the wall since the PM’s address was more like a campaign speech rather than a sombre Independence Day address. Political style BSP chief Mayawati dubbed it an “election speech” delivered in political style. Ms. Mayawati said Mr. Modi’s speech failed to provide new energy to citizens and focussed on boasting about the achievements of his own government. “It would have been better if the annual speech from the Red Fort was not used for political greed. But it seems like the BJP will never rise from its narrow-minded and malicious politics,” she said.",
"description": "Opposition leaders say Modi’s address resembled an election speech",
"time_scraped": "2018-08-17 04:53:50.007186",
"article_id": "24698318",
"article_category": "National",
"image_details": []
}