{
"source_article_link": "https://www.thehindu.com/news/national/cji-launches-mobile-apps-for-e-filing-of-cases/article24693668.ece",
"title": "CJI launches mobile apps for e-filing of cases - The Hindu",
"date_published": "2018-08-15T00:40:49+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "In a “giant leap” towards a litigant-friendly court system, Chief Justice of India Dipak Misra on Tuesday heralded the launch of a host of smartphone apps to help litigants, including convicts, from all parts of the country file cases and even make e-payments to courts. In a function organised at the Supreme Court Judges’ Lounge inside the apex court building, Chief Justice Misra inaugurated the apps along with Union Law and Justice Minister Ravi Shankar Prasad, who also holds the portfolio for Information Technology, and Justices Madan B. Lokur and A.M. Khanwilkar, both of whom led the efforts of the apex court’s e-committee. The function was attended by all the Supreme Court judges. Chief Justice Misra said the services provided by the apps, include e-filing along with user manual, e-payment options, National Service and Tracking of Electronic Processes (NTSEP), Supreme Court Legal Services Committee and awareness guide for services offered by the e-courts programme. “Captains of technology” Chief Justice Misra said those who have devised the apps were “captains of technology” and captains do not lose battles. He said the judicial system is moulded to bring justice to the litigant and not burden him with years of suffering and monetary loss. Justice Lokur called the apps “futuristic” and said they would be crucial in preventing pendency. Justice Lokur said 25% to 30% of pendency was because of delay in services. Thr apps would also save the exchequer over ₹ 1,600 crore. Justice Lokur said 16,000 plus district and taluka courts would be connected by these apps.",
"description": "Chief Justice Dipak Misra inaugurated the apps along with Union Law and Justice Minister Ravi Shankar Prasad, who also holds the portfolio for Information Technology, and Justices Madan B. Lokur and A.M. Khanwilkar",
"time_scraped": "2018-08-17 04:55:43.511562",
"article_id": "24693668",
"article_category": "National",
"image_details": []
}