{
"source_article_link": "https://www.thehindu.com/news/national/vajpayee-on-life-support/article24698469.ece",
"title": "Former PM Atal Bihari Vajpayee on life support - The Hindu",
"date_published": "2018-08-15T22:35:31+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/34kqqk/article24698468.ece/ALTERNATES/FREE_1080/VAJPAYEE"
],
"article_body": "Former Prime Minister Atal Bihari Vajpayee has been put on life support system as his health deteriorated late on August 15, the All India Institute of Medical Sciences said in a statement. “Former Prime Minister Atal Bihar Vajpayee has been admitted for the last nine weeks at AIIMS. Unfortunately his condition has worsened over the past 24 hours. His condition is critical and he is on life support system,” Aarti Vij, chairperson, media and protocol division of the AIIMS, said in a release on August 15. In the evening, Prime Minister Narendra Modi visited the AIIMS to enquire about Mr. Vajpayee’s condition. Mr. Modi reached the hospital at around 7.15 pm and spent about 50 minutes there. After Mr. Modi, Railway Minister Piyush Goyal and BJP MP Meenakshi Lekhi also paid a visit. Earlier in the evening, Union Textiles Minister Smriti Irani visited the hospital to enquire about on Mr. Vajpayee. Mr. Vajpayee was admitted at the AIIMS on June 11 with a kidney tract infection, urinary tract infection, low urine output and chest congestion. The 93-year-old Bharatiya Janata Party leader, a diabetic, has only one functional kidney. He had suffered a stroke in 2009 that weakened his cognitive abilities. Subsequently, he developed dementia. (With PTI inputs)",
"description": "The former Prime Minister's condition has worsened over the past 24 hours and his condition is critical, the AIIMS said in a statement.",
"time_scraped": "2018-08-17 04:54:42.639533",
"article_id": "24698469",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/34kqqk/article24698468.ece/ALTERNATES/FREE_1080/VAJPAYEE",
"path": "full/f5c1704ddbc89a672b7ab8528d64e4e1dc595234.jpg",
"checksum": "8fc9033e68a5813a1f288ae42943039d"
}
]
}