{
"source_article_link": "https://www.thehindu.com/news/national/centre-may-relax-nrc-guidelines/article24698230.ece",
"title": "Centre may relax NRC guidelines - The Hindu",
"date_published": "2018-08-15T21:59:18+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "The Centre is mulling relaxed guidelines for migrant workers and labourers from other States who were not included in the final draft of the National Register of Citizens (NRC) in Assam that was published on July 30. As per revised standard operating procedure (SOP) prepared by the Centre that was filed in the Supreme Court a day ago, around 40 lakh applicants not included in the final draft would get time till November 28 to file claims and objections. Earlier the process of claims and objections was to be done from August 30 to September 28. The court had asked the Centre to prepare a detailed SOP last week. The report was filed before the SC registry on Tuesday and it will be taken up for hearing on August 16. The Centre informed the court that biometric details of the 40 lakh applicants will be recorded and after the publication of the final NRC legal residents of the country will be given Aadhaar number. It said that during the course of the hearings by NCR authorities on disposing of claims and objections, the State government in collaboration with UIDAI will undertake the process of biometric enrolment of all the applicants of NRC. The government, which filed the SOPs to be adopted for disposing of claims and objections with regard to NRC, said that various organisations have made representations that adequate time period of at least three to four months be provided for the purpose of filing the claims and objections. Giving a timeline, it said that Class-1 officers will be deployed by the State government and five hearings per day will take place or eight hearings for cases involving children of 14 years or less. It said that although the hearings on claims and objections will commence from December 15, 2018, the timeline for disposal can only be firmed up once the actual number of claims and objections received are known.",
"description": "Time period for hearings on claims and objections likely to be extended",
"time_scraped": "2018-08-17 04:58:24.665722",
"article_id": "24698230",
"article_category": "National",
"image_details": []
}