{
"source_article_link": "https://www.thehindu.com/news/national/allow-video-conference-between-lawyer-client-supreme-court/article24698117.ece",
"title": "Allow video-conference between lawyer, client: Supreme Court - The Hindu",
"date_published": "2018-08-15T21:41:09+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "In a significant verdict, the Supreme Court has directed legal services authorities and committees to extend video-conferencing in every criminal case whenever the accused is in jail. “They shall extend the facility of video-conferencing between counsel and the accused or anybody in the know of the matter, so that the cause of justice is well served,” a Bench of Justices A.M. Sapre and U.U. Lalit said in its order pronounced on August 14. The direction was made on appeals filed by murder convicts, one from Maharashtra and the other from Chhattisgarh, who were sentenced to life imprisonment. The court said both accused were represented by advocate Shikhil Suri in the Supreme Court. Mr. Suri, who was entrusted with the appeals by the Supreme Court Legal Services Committee, had written to the Bench, insisting that he talk to his clients in jail before presenting their cases in the Supreme Court, the last court of appeal. Mr. Suri wrote that the Supreme Court Legal Services Committee had made it mandatory that legal services advocates get in touch with their clients who were often too poor to afford a lawyer. Commending the committee and Mr. Suri, Justice Lalit, who wrote the judgment, said: “Very often advocates who appear in matters entrusted by the Supreme Court Legal Services Committee do not have the advantage of having a dialogue with either the accused or those who are in the know of the details of the case. This at times seriously hampers the efforts of the advocates. All such attempts to facilitate a dialogue between counsel and his client would further the cause of justice and make legal aid meaningful.” In this case, the judgment records that Mr. Suri spoke to the sister of the accused in one case and to the accused himself in the other. However, the Bench did not interfere with the life sentence upheld by the High Courts. The judgment came on the day when Chief Justice of India Dipak Misra launched smart phone apps to help litigants, including convicts, file cases online and even make e-payments to courts. Chief Justice Misra said the services provided include e-filing along with the user manual, e-payment options, National Service and Tracking of Electronic Processes (NTSEP), Supreme Court Legal Services Committee and awareness guide for services offered by the e-courts programme.",
"description": "In a significant verdict, the Supreme Court has directed legal services authorities and committees to extend video-conferencing in every criminal case whenever the accused is in jail. “They shall extend the facility of video-conferencing between counsel and the accused or anybody in the know of the matter, so that the cause of justice is well served,” a Bench of Justices A.M. Sapre and U.U. Lalit said in its order pronounced on August 14. The direction was made on appeals filed by murder convicts, one from Maharashtra and the other from Chhattisgarh, who were sentenced to life imprisonment. The court said both accused were represented by advocate Shikhil Suri in the Supreme Court. Mr. Suri, who was entrusted with the appeals by the Supreme Court Legal Services Committee, had written to the Bench, insisting that he talk to his clients in jail before presenting their cases in the Supreme Court, the last court of appeal. Mr. Suri wrote that the Supreme Court Legal Services Committee had made it mandatory that legal services advocates get in touch with their clients who were often too poor to afford a lawyer. Commending the committee and Mr. Suri, Justice Lalit, who wrote the judgment, said: “Very often advocates who appear in matters entrusted by the Supreme Court Legal Services Committee do not have the advantage of having a dialogue with either the accused or those who are in the know of the details of the case. This at times seriously hampers the efforts of the advocates. All such attempts to facilitate a dialogue between counsel and his client would further the cause of justice and make legal aid meaningful.”",
"time_scraped": "2018-08-17 04:55:11.924897",
"article_id": "24698117",
"article_category": "National",
"image_details": []
}