{
"source_article_link": "https://www.thehindu.com/news/national/kerala-rains-rahul-gandhi-appeals-to-people-to-contribute-to-cms-relief-fund/article24702712.ece",
"title": "Kerala rains: Rahul Gandhi asks people to contribute to CM’s relief fund - The Hindu",
"date_published": "2018-08-16T12:17:58+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Congress president Rahul Gandhi on Thursday expressed concern over the flood situation in Kerala and took to Twitter to make a fervent appeal to people for help by contributing to the Chief Minister’s relief fund. He also tagged the link of the Chief Minister’s relief fund to his tweet asking people to contribute, and said “it is time to step up and help”. “I am deeply concerned for the people of #Kerala tonight, as the flood waters rise. Thousands are stranded. Relief camps full. Many have lost their loved ones. It’s time to step up & help. Please contribute generously to the CM’s relief fund,” he said on Twitter tagging the link. I am deeply concerned for the people of #Kerala tonight, as the flood waters rise. Thousands are stranded. Relief camps full. Many have lost their loved ones. It’s time to step up & help. Please contribute generously to the CM’s relief fund. Use this link: https://t.co/GNUlGQbBZv pic.twitter.com/Gm5QGifSms — Rahul Gandhi (@RahulGandhi) August 15, 2018 The death toll in the current phase of monsoon fury in the southern State has touched 72. Rise in flood waters in Periyar River due to the rains and opening of all shutters of all major dams including Mullaperiyar, Cheruthoni, part of Idukki reservoir, and Idamalayar, have severely affected lives of people in downstream areas. Kerala Chief Minister Pinarayi Vijayan once again called up Prime Minister Narendra Modi and apprised him of the flood situation in the State. The State has also sought the services of additional Army personnel and helicopters and the Prime Minister has assured all help, Mr. Vijayan said. Kochi Metro suspended operations this morning after flood waters entered the Muttom yard near Aluva and train services have been affected in various parts of the State with cancellation of many passenger trains and partial cancellation of some long distance train.",
"description": "The Congress expresses concern over Kerala floods",
"time_scraped": "2018-08-17 04:53:50.806806",
"article_id": "24702712",
"article_category": "National",
"image_details": []
}