{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-poet-and-politician-a-timeline/article24707154.ece",
"title": "Atal Bihari Vajpayee, Poet and Politician: a timeline - The Hindu",
"date_published": "2018-08-16T21:08:29+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/idwcku/article24707736.ece/ALTERNATES/FREE_1080/VAJPAYEE3jpg"
],
"article_body": "Former Prime Minister Atal Bihari Vajpayee, who passed away today at the All India Institute of Medical Sciences, was a skilled orator and politician. We bring to you a timeline based on The Hindu's archives, documenting his political life. According to The Hindu , Vajpayee was an \"out and out a politician, with oratory as his forte. He can cast a spell on his audiences and to their delight, and with his biting sarcasm, demolish the case of his opponents. Compared to others, Mr. Vajpayee is liberal, flexible and open to conviction.\" December 25, 1924: Atal Bihari Vajpayee born in Gwalior, Madhya Pradesh. Vajpayee had a brilliant career both at school and in the university with scholarships won on merit. He was a fluent speaker in English, inheriting the gift of the gab from his father Pandit K. B. Vajpayee. Father and son created history in the Lucknow University where they studied Law together. 1939 : Member of the Rashtriya Swayamsewak Sangh (RSS), and after finishing his Masters in Political Science from Kanpur, he began to work full-time for the RSS in 1941 1942 : During the 1942 Quit India movement, he gave up his studies to court imprisonment and later came back to win another scholarship to pursue his post-graduate studies. He had his political training under the late Dr. Shyama Prasad Mukerji. He was Dr. Mukerji's private secretary, and was with him when he died in a Kashmir jail. Before entering Parliament, Mr. Vajpayee was a journalist by profession and edited Rashtra Dharma and Veer Arjun 1951 : He was one of the founding members of the Jan Sangh, becoming its president in 1968 on the death of Deendayal Upadhyaya. Prime Minister Atal Bihari Vajpayee addressing the nation for the first time after assuming office in New Delhi on May 19, 1996. 1957 : Vajpayee was first elected to the Lok Sabha from Balrampur in Uttar Pradesh and was twice member of the Rajya Sabha. 1958 : Vajpayee was imprisoned during the U.P. food agitation in 1958 and during the talks with Pakistan on Kutch in 1967. June 13, 1964: As his parliamentary career flourished, Vajpayee made a name for himself as an orator and for his poetic flourishes. Vajpayee, as a member of the Jan Sangh, paid a glowing tribute to Jawaharlal Nehru, in the Rajya Sabha. He described Mr. Nehru as a thoroughly honest man and an idealist “who was never afraid to negotiate and never negotiated with fear”. Though he differed in his views from Mr. Nehru, he burst into tears both in the Upper House and in the all-parties meeting in the Central Hall while paying homage to Mr. Nehru in poetic and chaste Hindi. According to The Hindu , Vajpayee was a firm believer in secularism. He was fond of repeating that \"Hinduism was not a religion but a secular way of life,\" a report published in The Hindu on June 13, 1964 read. 1968 : He became president of the party's new incarnation, the Bharatiya Jana Sangh from 1968 to 1973. 1974 : He was arrested under the Maintenance of Internal Security Act (MISA) in Bihar. 1975 : During the Emergency, the Bharatiya Jan Sangh along with several parties merged to form the Janata Party. 1977-79 : In the Morarji Desai led Janata Party government, Vajpayee became the MEA. 1980 : After the failure of the Janata experiment, the Bharatiya Janata Party was launched, and Vajpayee became its president. He remained the president of the party till 1986 1984 : The newly founded BJP, after the dissolution of the Jan Sangh, won only two seats in the Parliamentary Elections. December 6, 1992 : Demolition of the Babri Masjid in Ayodhya. Vajpayee is on record as having said that he had warned L.K. Advani on the possible disastrous consequences of collecting a large crowd at the disputed site. Vajpayee was subsequently censured at an emergency meeting of the party's national executive committee for having gone beyond the RSS brief in expressing regret over the demolition of the Masjid. 1992 : Vajpayee awarded the Padma Vibhushan award. President K.R. Narayanan administers the oath of office to Prime Minister Atal Bihari Vajpayee at a swearing-in-ceremony at the forecourt of Rashtrapati Bhawan in New Delhi on October 13, 1999.\n\n| Photo Credit: The Hindu Archives 1995 : As the BJP threw its weight behind the Ram Janmabhoomi movement, he emerged as the prime ministerial candidate on behalf of the BJP. 1996 : He became Prime Minister, leading a 13-day government as head of the single largest party. 1998-99 : Vajpayee was Prime Minister with the NDA government after a United Front government fell when the Congress withdrew support. He oversaw the Pokhran nuclear test and the subsequent international sanctions that went with it. The term was also marked by his initiatives for peace with Pakistan and the Lahore declaration. His 13-month government, however, could not withstand the rather fragile coalition that he had put together, and with the AIADMK withdrawing support, his government fell. Prime Minister Atal Bihari Vajpayee with AIADMK supremo Jayalalitha, at the co-ordination committee meeting, in New Delhi on March 27, 1999. 1999: During Vajpayee's term, the Army conducted Operation Vijay to wrest territories along the Line of Control after the Pakistan Army undertook a covert operation to send its troops into Kargil that led to a limited conflict that Pakistan lost. 1999-2004 : Appointed Prime Minister leading the NDA alliance with a comfortable majority and a government that lasted a full term till 2004, the first non-Congress government to do so. During his address to the nation following the election, he said: \"We are all guided by the lofty principles of secularism, social justice, social, harmony and women's empowerment. Ours is a Government wedded to a common ideal: to create a kinder, gentler and more tolerant society, free from all discrimination, fear and insecurity.” Pakistan Prime Minister Nawaz Sharif (L) receives his Indian counterpart Atal Bihari Vajpayee at the Wagah Border on February 20, 1999. \n| Photo Credit: The Hindu Archives February 20, 1999 : Inauguration of the Delhi-Lahore bus service. Television cameras captured the historic and stirring images of Prime Minister Vajpayee and his entourage getting into a bus and driving into Pakistan, to be greeted warmly by a Pakistani Prime Minister Nawaz Sharif at the border. On February 21, the Lahore Declaration was signed by the two Prime Ministers. 1999 : During Vajpayee’s term, the Pakistan Army undertook a covert operation to send its troops into Kargil. US President Bill Clinton pushed Nawaz Sharif into withdrawing Pakistani troops from Kargil after a meeting in Washington. The Kargil War, also known as Operation Vijay, which was won by India, was a defining moment of Vajpayee’s tenure. December 13, 2001: Parliament is attacked during his third term as Prime Minister. Subsequently, the NDA government brought in the controversial Prevention of Terrorism Act (POTA). 2004 : Still attended Lok Sabha after his government’s defeat in the polls but gradually withdrew from public life. 2009 : Vajpayee suffered a stroke that weakened his cognitive abilities. 2015: Vajpayee awarded the Bharat Ratna. August 16, 2018 : Atal Bihari Vajpayee passes away, age 93, after battling ill health for years.",
"description": "According to The Hindu's archives, former Prime Minister Atal Bihari Vajpayee was was a firm believer in secularism. He was fond of repeating that Hinduism was not a religion but a secular way of life.",
"time_scraped": "2018-08-17 04:55:43.453196",
"article_id": "24707154",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/idwcku/article24707736.ece/ALTERNATES/FREE_1080/VAJPAYEE3jpg",
"path": "full/9305963a32c19b3042fc8f42d96253bd8a3a4a2a.jpg",
"checksum": "dab2ebdbb69f4cbc2614af0f14848908"
}
]
}