{
"source_article_link": "https://www.thehindu.com/news/national/rahul-to-visit-london-berlin-next-week/article24709119.ece",
"title": "Rahul to visit London, Berlin next week - The Hindu",
"date_published": "2018-08-16T22:49:31+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Continuing with his effort to engage with the Indian diaspora, Congress president Rahul Gandhi will be visiting Germany and Britain next week where he will address two public events apart from meeting political leaders, business leaders, professionals and students. “During his trip he will meet a large number of non-resident Indians, professionals, businessmen and others and address two major meetings of the Indian Overseas Congress in Germany and London. He will also have separate interactions with young global leaders and students,” Sam Pitroda, who heads the Indian Overseas Congress (IOC), announced on Twitter. The Congress president will be in Germany on August 22 and 23 and is scheduled to address NRIs in Berlin on day two. In London, he will be addressing a conference, organised by the IOC, on August 25. “This tour of Rahul Gandhi to Germany and U.K. comes at a time when events in Turkey and the free fall of the Lira are getting global attention,” Mr. Pitroda added. Mr. Pitroda said people abroad were very interested in listening to the Congress chief's views on economy, employment, demonetisation, security, development and overall performance of the government and future obstacles, opportunities and challenges in India.” “[The] visit is seen as an opportunity to discuss India’s role in the world, and concern for democratic values, freedom of speech and its impact on economy, growth, business opportunities and national institutions,” said the head of the Overseas Congress in another tweet.",
"description": "He will meet political and business leaders, professionals and students",
"time_scraped": "2018-08-17 04:57:09.008852",
"article_id": "24709119",
"article_category": "National",
"image_details": []
}