{
"source_article_link": "https://www.thehindu.com/news/national/vajpayee-the-orator-excerpts-from-former-pms-speeches/article24707262.ece",
"title": "Vajpayee the orator: excerpts from former PM’s speeches - The Hindu",
"date_published": "2018-08-16T19:26:15+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/vafzxd/article24707261.ece/ALTERNATES/FREE_1080/VAJPAYEE-KESAVAN"
],
"article_body": "Former prime minister Atal Bihari Vajpayee, who passed away in New Delhi on Thurday, was known for his oratory skills. Here are some excerpts from his speeches on a range of subjects, from nuclear tests and Kashmir to education and freedom of the press *Education, in the truest self of the term, is a process of self-discovery. It is the art of self-sculpture. It trains the individual not so much in specific skills or in specific branch of knowledge, but in the flowering of his or her latent intellectual, artistic and humanist capacities. The test of education is whether it imparts an urge for learning and learnability, not this or that particular set of information. [December 28, 2002 - inaugural speech of the Golden Jubilee Celebrations of the University Grants Commission] *The Pokhran-2 nuclear tests were conducted neither for self-glorification, nor for any display of machismo. But this has been our policy, and I think it is also the policy of the nation, that there should be minimum deterrence, which should also be credible. This is why we took the decision to conduct tests. [In Parliament on the 1998 nuclear tests] *You can change friends but not neighbours. [In Parliament in May 2003] * One cannot wish away the fact that before good neighbours can truly fraternise with each other, they must first mend their fences. [June 23, 2003 - At Peking University] *If I break the party and forge new alliances to come to power, then I will not like to touch that power even with a pincer. [While replying to the no-confidence motion in the Lok Sabha in 1996] *We should strive hard to ensure that every R&D rupee brings greater benefits to the nation. *Mutual suspicions and petty rivalries have continued to haunt us. As a result, the peace dividend has bypassed our region. History can remind us, guide us, teach us or warn us; it should not shackle us. We have to look forward now, with a collective approach in mind. [Talking on South Asia at the 12th SAARC Summit in Islamabad January 2004] *We in India are inheritors to a great civilisation whose life chant has been “Shanti” — that is, Peace — and “Bhaichara” — which means, Brotherhood. India has never been an aggressor nation, a colonizer or a hegemon in her long history. In modern times, we are alive to our responsibility to contribute to peace, friendship and cooperation both in our region and around the world. [January 31 2004 - PM’s speech at inauguration of Global Convention on Peace and Non-violence]. *Poverty is multidimensional. It extends beyond money incomes to education, health care, skills enhancement, political participation at all levels from the local to the global, access to natural resources, clean water and air, and advancement of one’s own culture and social organisation. [September 25, 2003 - address at 58th Session of UN General Assembly] *The freedom of the press is an integral part of Indian democracy. It is protected by the Constitution. It is guarded in a more fundamental way by our democratic culture. This national culture not only respects freedom of thought and expression, but also has nurtured a diversity of viewpoints unmatched anywhere in the world. *Persecution on account of one’s beliefs and insistence that all must accept a particular point of view is unknown to our ethos. [September 13, 2013 - Vajpayee’s speech at the 125th anniversary of The Hindu] *Gun can solve no problem; brotherhood can. Issues can be resolved if we move forward guided by the three principles of Insaaniyat (humanism), Jamhooriyat (democracy) and Kashmiriyat (Kashmir’s age old legacy of amity). [April 23 2003, Vajpayee in Parliament on the issue of Jammu and Kashmir]. The Prime Minister, Atal Behari Vajpayee, who is on a three-day private visit to the tourist resort of Kumoan, rendered his latest poem on persistent demand from mediapersons. After his famous poems, `` Haar nahi manoonga ' (I will not accept defeat) and `` Geet naya gata hoon ' (I sing a new song), it is ``Geet nahi gata hoon'' (I do not sing a song) this time. Read more",
"description": "‘Persecution on account of one’s beliefs and insistence that all must accept a particular point of view is unknown to our ethos’.",
"time_scraped": "2018-08-17 04:53:50.053310",
"article_id": "24707262",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/vafzxd/article24707261.ece/ALTERNATES/FREE_1080/VAJPAYEE-KESAVAN",
"path": "full/4b16efb117fb0a60d751ce91f764f3be46ef948d.jpg",
"checksum": "fc7d9665a03aa3992af93068624871d9"
}
]
}