{
"source_article_link": "https://www.thehindu.com/news/national/obituary-for-former-prime-minister-atal-bihari-vajpayee/article24704921.ece",
"title": "Atal Bihari Vajpayee, a man of ideas - The Hindu",
"date_published": "2018-08-16T17:35:36+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/fvz8xy/article24704920.ece/ALTERNATES/FREE_1080/vbk-vajpayee1"
],
"article_body": "Former Prime Minister Atal Bihari Vajpayee, who held the post for three non-consecutive terms in 1996, 1998-99, and from 1999-2004, passed away on Thursday. He was 93. Mr. Vajpayee’s long career in public life was no doubt crowned by his being elected Prime Minister, but the course of it was peppered with long years as a parliamentarian, and with struggles to establish the Bharatiya Jana Sangh, and later the BJP, in national politics. Born on December 25, 1924 in Gwalior, Mr. Vajpayee was elected 10 times to the Lok Sabha from four different States (the first time in 1957 from Balrampur in Uttar Pradesh), and was twice a Member of the Rajya Sabha in a storied career. He got an early start in public life when he got involved in the Quit India Movement of 1942 and was arrested for it. He was already a member of the Rashtriya Swayamsewak Sangh (RSS) since 1939, and after finishing Masters in Political Science from Kanpur, he began to work full-time for the RSS. One of the founding members of the Jan Sangh in 1951, Mr. Vajpayee became its president in 1968 upon the death of Deendayal Upadhyaya. As his parliamentary career flourished, Mr. Vajpayee made a name for himself as an orator and for his poetic flourishes. His poetry, collated in his book Meri Ekyaavan Kavitayein (My 51 Poems) reflect it. The movement against the Emergency declared in 1975 saw Mr. Vajpayee and the Jan Sangh join forces with the Janata Party, and in the 1977 polls, be elected to the Lok Sabha and appointed as Minister for External Affairs. The peak of that moment contrasted with the trough of the 1984 polls, where the newly founded BJP (after the dissolution of the Jan Sangh) clocked only two seats. Mr. Vajpayee took that electoral rout in a philosophical mien, and as the BJP threw its weight behind the Ram Janmabhoomi movement in 1995, he emerged as the prime ministerial candidate on behalf of the BJP. He led a 13-day government in 1996, as the head of the single largest party, but could not get enough numbers to stay in power. After an interval of two years, with a United Front government having fallen after the Congress withdrew support, he was again sworn in as Prime Minister with the National Democratic Alliance (NDA), in place after the 1998 polls. Within a month of this, Mr. Vajpayee oversaw the Pokhran nuclear test and the subsequent international sanctions that went with it. The term was also marked by his initiatives for peace with Pakistan and the Lahore declaration. His 13-month government, however, could not withstand the rather fragile coalition that he had put together, and with the AIADMK withdrawing support, his government fell. During his term as caretaker Prime Minister, Mr. Vajpayee dealt with the Kargil war — a conflict with neighbouring Pakistan, something that tested the country and his own mettle. The following elections in 1999 saw the NDA ensconced with a comfortable majority and a government that lasted a full term till 2004, the first non-Congress government to do so. Mr. Vajpayee undertook many reform measures with regard to the economy, keeping it on the liberalisation track despite resistance from the RSS. His efforts at a solution for issues affecting Kashmir are still the most accepted template for political dialogue. With a poetic bent, and at the head of a coalition of political parties that were ideologically disparate whom he dealt with deftly, Mr. Vajpayee has been termed the “right man in the wrong party.” As a staunch member of the RSS, however, this referred to his appeal across party lines and the many friendships that he cultivated through his years in Parliament. After he lost power in 2004, he still attended Lok Sabha but gradually withdrew from public life. A stroke in 2009 saw him withdraw completely. Known as much for his meaningful pauses as for his poetic oratory, Mr. Vajpayee’s legacy is now in the domain of history writers. What he says of himself and his long career in India’s public life is probably best encapsulated by some lines from his poem: “ Kaal ke kapaal par likhta mitaata hoon, geet naya gaata hoon (I write and erase lines on the forehead of time, I sing a new song)”.",
"description": "The former Prime Minister’s legacy is now in the domain of history writers.",
"time_scraped": "2018-08-17 04:56:37.664447",
"article_id": "24704921",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/fvz8xy/article24704920.ece/ALTERNATES/FREE_1080/vbk-vajpayee1",
"path": "full/623c8fbe34e77fb5fe812892a6e46e17262fac34.jpg",
"checksum": "df642997233958a4d1e56e7799f307a2"
}
]
}