{
"source_article_link": "https://www.thehindu.com/news/national/8-outfits-to-be-heard-on-nrc-claims-process/article24709130.ece",
"title": "8 outfits to be heard on NRC claims process - The Hindu",
"date_published": "2018-08-16T22:53:35+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/nmfbew/article24709129.ece/ALTERNATES/FREE_1080/TH17KRANRC"
],
"article_body": "The Supreme Court on Thursday refused to take the views of political parties on the Centre’s standard operating procedure (SOP) and modalities for filing and disposal of claims/objections leading to the publication of the final National Register of Citizens (NRC) for Assam. State NRC Co-ordinator Prateek Hajela informed a Bench of Justices Ranjan Gogoi and Rohinton Nariman that the opinions of various political parties on the NRC were sought by a State sub-committee in 2012-13. However, the Bench shot down the idea of involving political parties. Instead, the court directed that the SOP should be examined by stakeholders and petitioners in the current litigation. The court then named eight of them — Assam Public Works, Assam Sanmilita Mahasangha (an indigenous people’s organisation of Assam), National Democratic Front of Bodoland (Progressive), Indigenous Tribal Peoples Federation, All Assam Bhojpuri Parishad, Joint Action Committee for Bangali Refugees, All Assam Minorities Students’ Union (AAMSU) and Jamait Ulama-i-Hind – for the purpose. Modalities on August 28 All the eight have been asked to present their views on the SOP, drafted by the Centre in consultation with the Assam government, Registrar General of India and Mr. Hajela, by August 25. The court said it would finalise the modalities on the next date of hearing, that is, August 28. On its part, the Bench refrained from passing comments about the SOP as of now. The court directed Mr. Hajela to file, in a sealed cover, the percentage of the population in each district left out of the final draft NRC. This information has to be filed in court on or before August 25. The Bench further ordered Mr. Hajela to provide copies of the final draft NRC in panchayat offices and “such other places” so as to make access to the draft NRC freely available to the public. The filing of claims and objections would commence from August 30, the Bench recorded in its order. On July 31, a day after the second and last draft of the NRC was published, the apex court had directed authorities not to initiate any ‘action’ against 40 lakh persons left out. The Bench ordered the government to frame a ‘fair’ SOP to deal with the claims and objections of those who did not find their names in the draft NRC. ‘Opportunity for all’ “We want everybody to get a fair opportunity, considering the complexities and numbers, involved,” Justice Gogoi had observed. The much-anticipated second and final draft of the NRC shows 2.9 crore names out of the total 3.29 crore who applied in Assam. The names of 40.07 lakh applicants were not included in the historic document, considered proof of Assamese identity. The first draft NRC was published in the intervening night of December 31 and January 1 and showed the names of 1.9 crore people.",
"description": "No need to consult political parties on modalities for filing and disposing of objections to draft register, says Supreme Court",
"time_scraped": "2018-08-17 04:53:37.548636",
"article_id": "24709130",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/nmfbew/article24709129.ece/ALTERNATES/FREE_1080/TH17KRANRC",
"path": "full/71bccee0e147c5904f97af234a5fc2c867d0f8ea.jpg",
"checksum": "13c38b2c52c286efb1e8da9a506864e7"
}
]
}