{
"source_article_link": "https://www.thehindu.com/news/national/leaders-head-to-aiims-as-vajpayee-continues-on-life-support-system/article24701644.ece",
"title": "Atal Bihari Vajpayee continues to be on life support system, leaders head to AIIMS - The Hindu",
"date_published": "2018-08-16T10:04:35+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/joq8w8/article24703960.ece/ALTERNATES/FREE_1080/ModiShahjpg"
],
"article_body": "Former Prime Minister Atal Bihari Vajpayee continues to be on life support system since Wednesday and as per hospital sources at the All India Institute of Medical Sciences (AIIMS) his condition “is very critical”. A press release from the AIIMS on Thursday morning said: “Former Prime Minister Shri Atal Bihari Vajpayee’s condition continues to be the same. He is critical and is on life support systems.” On August 16 morning, Prime Minister Narendra Modi visited AIIMS to enquire about the health condition of Mr. Vajpayee, his second visit in less than 24 hours. Mr. Modi had visited the hospital on Wednesday evening to enquire about the BJP leader’s condition. On Thursday morning, Vice-President M. Venkaiah Naidu and BJP leaders, including Home Minister Rajnath Singh, party president Amit Shah and BJP veteran L.K. Advani, also visited the AIIMS to enquire about him. Home Minister Rajnath Singh arrives at AIIMS to enquire about Atal Bihari Vajpayee’s health condition, in New Delhi on Thursday. \n| Photo Credit: R.V. Moorthy Delhi Chief Minister Arvind Kejriwal, and Union Ministers Prakash Javadekar are expected to visit the premier medical institute soon. More leaders are expected at AIIMS, with the institute seeing very heavy security deployment since Thursday morning. Roads leading to the hospital are witnessing massive traffic jams. Prime Minister Narendra Modi visited the AIIMS on Wednesday evening to enquire about the condition of Vajpayee. He reached the hospital at around 7.15 p.m. and spent about 50 minutes there. After Mr. Modi, Railway Minister Piyush Goyal and BJP MP Meenakshi Lekhi also paid a visit. Later in the night, several leaders and Ministers, including Suresh Prabhu, Jitendra Singh, Harsh Vardhan and Shahnawaz Hussain, visited the hospital. Earlier, Union Textiles Minister Smriti Irani had visited the hospital to check on Vajpayee. “Former Prime Minister Shri Atal Bihari Vajpayee has been admitted for the last 9 weeks at AIIMS. Unfortunately his condition has worsened over the last 24 hours. His condition is critical and he is on life support system,” Dr. Aarti Vij of the AIIMS said in a press release on August 15. Mr. Vajpayee was admitted to AIIMS on June 11 with kidney tract infection, chest congestion and his urine output being on the lower side. “His condition is critical. He is on ventilator support and a team of doctors are constantly monitoring his condition in the ICU at CN tower where he is admitted,” said a hospital source. Mr. Vajpayee, a diabetic, has only one functional kidney. He suffered a stroke in 2009, weakening his cognitive abilities. Later, he developed dementia. Mr. Vajpayee was elected as Prime Minister thrice during 1996, 1996-1999 and during 1999-2004 — when he completed the full five-year term as a non-Congress Prime Minister. As his health deteriorated, he slowly withdrew himself from public life and was confined to his residence for years. (With inputs from PTI)",
"description": "A press release from AIIMS on Thursday morning said that Mr. Vajpayee’s condition continues to be the same and that he remains to be critical.",
"time_scraped": "2018-08-17 04:57:41.827058",
"article_id": "24701644",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/joq8w8/article24703960.ece/ALTERNATES/FREE_1080/ModiShahjpg",
"path": "full/5ec7ed1c7f44ff0969c0d5911a8774ef12a976fd.jpg",
"checksum": "e9eb6cde8d4f10b0512ac395a880e78c"
}
]
}