{
"source_article_link": "https://www.thehindu.com/news/national/sudheendhra-kulkarni-on-atal-bihari-vajpayee-he-created-a-peace-template-for-the-subcontinent/article24709749.ece",
"title": "Sudheendhra Kulkarni on Atal Bihari Vajpayee: ‘He created a peace template for the subcontinent’ - The Hindu",
"date_published": "2018-08-17T00:38:48+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/tjpruv/article24709748.ece/ALTERNATES/FREE_1080/TH17LAHORE"
],
"article_body": "A truly great leader is one who swims against the current of public opinion in attempting to solve the big problems of his times. He may or may not succeed. If he does, history of course reserves a higher place of honour for his accomplishment. But even if he doesn’t, his greatness still lies in having created a template of the effort that would, if continued with the same determination and vigour by his successors, bring success someday. Atal Bihari Vajpayee’s most enduring legacy as Prime Minister is that he attempted to liberate India from the prison of the past with regard to two of the most intractable historical problems — Kashmir and Pakistan. That he did not succeed is evident. Indeed, when he demitted office in May 2004 after failing to win a renewed mandate in the elections to the 14th Lok Sabha, any lasting solution to the Kashmir issue, or to normalisation of India-Pakistan relations, seemed a long way off, even though some footprints of progress made during his tenure in office were undeniably visible. But does that mean he was a failure? Think again. Twin, intertwined problems The template, which his successor Dr. Manmohan Singh used to find a solution to the twin, and intertwined, problems of Kashmir and Pakistan, was essentially the same as what Mr. Vajpayee had created. More to the point, has Narendra Modi discovered or devised any new path? Mr. Modi, in his Independence Day address to the nation, conceded that neither goli (bullets) nor gaali (abuses) could bring Kashmir closer to peace and normalcy. What could, he stated, was the path shown by Vajpayee’s three-point formula — kashmiriyat (respect for Kashmir’s unique identity and pluralistic personality), jamhuriyat (genuine respect for the democratic aspirations of Kashmiri people) and insaaniyat (respect for their human rights). I was present when Mr. Vajpayee had offered this formula during his landmark visit to Kashmir in April 2003. He had taken a big risk in addressing a public rally in the Valley, but the response to his appeal was electrifying. After many decades of false starts and missed opportunities, the people of Kashmir felt reassured that New Delhi was genuinely interested in, and also committed to, pursuing a bold new path to peace. Their hope was rooted in another audacious new move by Mr. Vajpayee. Taking almost everyone by surprise, and with the dramatic gesture of his outstretched hand pointing to Islamabad, he had announced, “I am extending my hand of friendship with Pakistan. India is ready for talks with Pakistan on all issues, including the issue of Kashmir.” Mr. Vajpayee knew in the depth of his heart that India could never find a permanent solution to the Kashmir problem without co-evolving that solution with Pakistan. In other words, the Kashmir problem had an internal dimension and an external dimension, and the two were inseparably linked. Which is why, improving relations with Pakistan was the leitmotif of his politics ever since he became India’s External Affairs Minister in Morarji Desai’s government in 1977. On his first visit to Islamabad, he tried to allay the misgivings of the rulers and people of Pakistan by saying, “You might be having doubts about me since I previously belonged to the Bharatiya Jana Sangh, which believed in the idea of ‘Akhand Bharat’. But let me assure you that I have come here as a messenger of peace.” Old-timers remember that India-Pakistan relations hit a high during the brief period of the Janata Party’s rule. Picking up the thread Mr. Vajpayee picked up the thread when he became Prime Minister in 1998. His first major foreign policy initiative was to reach out to Pakistan, and he did so in the form of an imaginative bus yatra from Amritsar to Lahore in February 1999. As one who accompanied him on this bus, I was witness to the enormous amount of hope he generated on both sides of the border. I vividly remember that, after Prime Minister Nawaz Sharif welcomed him on Pakistani soil, Mushahid Hussain, who was then a Minister in Mr. Sharif’s government, whispered to me on the sidelines. “Your Prime Minister has real guts to come to Pakistan like this, and at this time.” (Within a few months, after the Kargil fiasco, there was a military coup in Islamabad.) Two highlights of that visit are etched in my memory. One was Mr. Vajpayee’s visit to Minar-e-Pakistan in Lahore, the monument that commemorates the historic session of the All India Muslim League in March 1940, which adopted the ‘Pakistan Resolution’. Some colleagues, who had reservations over this visit, asked him: “Won’t you be putting your seal of approval on Pakistan by going there?” His reply was highly instructive. “Who am I to put a seal of approval on Pakistan? Hasn’t history already done so?” The visit sent the clearest signal yet that any discussion on ‘Akhand Bharat’ was now meaningless. The second highlight was the speech Mr. Vajpayee gave at the Governor’s House in Lahore. He made a passionate appeal for both Indians and Pakistanis to leave the hostilities of the past behind and, instead, courageously embrace a future of peace and friendship. He concluded his speech by reciting his own popular poem Jang na hone denge… Bharat Pakistan padosi, saath-saath rehna hai, Pyar karein ya ‘war’ karein, donon ko hi sehna hai, Jo hum par guzari, bachchon par na hone denge, Jang na hone denge (India and Pakistan, we are neighbours. We have to live together. Whether we love or fight each other, we both have to face the consequences. What we had to endure, we shall not let our children suffer the same. We shall not let another war break out between India and Pakistan.) The speech received thunderous applause from the audience. But what especially caught my attention was the tears in the eyes of some Pakistanis sitting next to me. The best tribute to Mr. Vajpayee would be to continue his peace mission until it is crowned with success. ( The author was an aide to Prime Minister Atal Bihari Vajpayee in the PMO between 1998-2004.)",
"description": "“The best tribute to Mr. Vajpayee would be to continue his peace mission until it is crowned with success”.",
"time_scraped": "2018-08-17 04:53:34.425970",
"article_id": "24709749",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/tjpruv/article24709748.ece/ALTERNATES/FREE_1080/TH17LAHORE",
"path": "full/bbee2f7a55c83dfb5b0ad7144e7bb94952d8303b.jpg",
"checksum": "20a04bc9d8b3346f0c2195a5525790e9"
}
]
}