{
"source_article_link": "https://www.thehindu.com/news/national/i-will-miss-atal-ji-immensely-says-advani/article24707184.ece",
"title": "I will miss Atal ji immensely, says Advani - The Hindu",
"date_published": "2018-08-16T19:15:15+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/mkxau8/article24707178.ece/ALTERNATES/FREE_1080/INDIAPOLITICS"
],
"article_body": "Veteran BJP leader L.K. Advani on August 16 described former Prime Minister Atal Bihari Vajpayee as one of the country’s tallest statesmen and his closest friend for over 65 years whom he will miss immensely. “I am at a loss of words to express my deep grief and sadness today as we all mourn the passing away of one of India’s tallest statesmen, Shri Atal Bihari Vajpayee. To me, Atal ji was more than a senior colleague- in fact he was my closest friend for over 65 years,” Mr. Advani said in a statement. “I cherish the memories of my long association with him, right from our days as pracharak s of the RSS, to the inception of Bharatiya Jana Singh, the struggle of the dark months during the Emergency leading to the formation of the Janata Party and later the emergence of the Bharatiya Janata Party in 1980. L.K. Advani, then Deputy Prime Minister, presents a life-size portrait of then Prime Minister Atal Bihari Vajpayee on the latter’s 78th birthday in New Delhi on December 25, 2002.\n\n| Photo Credit: Rajeev Bhatt “Atal ji will be remembered as the pioneer of the first ever stable non-Congress coalition government at the Centre and I had the privilege of working as his deputy for six years. As my senior, he always encouraged and guided me in every possible manner. “His captivating leadership qualities, mesmerising oratory, soaring patriotism and above all, his sterling humane qualities like compassion, humility and his remarkable ability to win over adversaries despite ideological differences have all had a profound effect on me in all my years in public life. “I will miss Atal ji immensely…” L.K. Advani, Jaswant Singh and Atal Bihari Vajpayee address reporters after meeting President K.R. Narayanan on November 30, 1997. \n| Photo Credit: AP ",
"description": "“As my senior, he always encouraged and guided me in every possible manner,” says the senior BJP leader who served as Deputy Prime Minister under Mr. Vajpayee.",
"time_scraped": "2018-08-17 04:54:12.122445",
"article_id": "24707184",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/mkxau8/article24707178.ece/ALTERNATES/FREE_1080/INDIAPOLITICS",
"path": "full/30e32a23d99af534e7f5134c0a35a7e964cc33c8.jpg",
"checksum": "4a85285bb66e1c884eac8d0dba34aee9"
}
]
}