{
"source_article_link": "https://www.thehindu.com/news/national/former-prime-minister-atal-bihari-vajpayee-passes-away-at-93/article24704802.ece",
"title": "Atal Bihari Vajpayee, former Prime Minister, passes away at 93 - The Hindu",
"date_published": "2018-08-16T17:34:57+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/bv8aiw/article24704801.ece/ALTERNATES/FREE_1080/INDIAVAJPAYEE"
],
"article_body": "Atal Bihari Vajpayee, the only non-Congress leader to have completed a full term as Prime Minister, breathed his last at the All-India Institute of Medical Sciences on Thursday evening. The 12-time Parliamentarian was 93. “Unfortunately, his condition deteriorated over the last 36 hours and he was put on life support systems. Despite the best of efforts, we have lost him today. We join the nation in deeply mourning this great loss,” an AIIMS bulletin said. Mr. Vajpayee was admitted to the AIIMS on June 11 with a kidney tract infection and chest congestion. The BJP leader, who was diabetic with one functional kidney, suffered a stroke in 2009, weakening his cognitive abilities. He will be given a state funeral in the national capital on Friday. His last rites will take place at Smriti Sthal close to Rajghat at 5 p.m. Mr. Vajpayee’s body will be taken from his Krishna Menon Marg residence to the BJP headquarters on Deendayal Upadhyay Marg at 9 a.m. and the nearly three-km funeral procession to Smriti Sthal will begin at 1 p.m. The Union Cabinet also announced state mourning for seven days and a half-day Central government holiday on Friday. Mr. Vajpayee was Prime Minister thrice in 1996, 1998-1999 and 1999-2004. As his health deteriorated, he slowly withdrew himself from public life and was confined to his residence for several years. In his condolence message, President Ram Nath Kovind stated, “His leadership, foresight, maturity and eloquence put him in a league of his own. Atalji, the Gentle Giant, will be missed by one and all.” Condoling his death, Prime Minister Narendra Modi said, “His passing away marks the end of an era. He lived for the nation and served it assiduously for decades.” In its tribute to Mr. Vajpayee, who famously described himself as a swayamsevak while he was Prime Minister in 2000, the RSS said, “A great personality, a steadfast & universally accepted leader, who instilled Bharatiya culture & values in public life, Atalji has left us today. The void left behind will remain forever.” Born on December 25, 1924, in Gwalior, Mr. Vajpayee was elected 10 times to the Lok Sabha from four different States, the first time in 1957 from Balrampur in Uttar Pradesh, and was twice member of the Rajya Sabha. As one of the founding members of the Jan Sangh in 1951, Mr. Vajpayee became its president in 1968 upon the death of Deendayal Upadhyaya. As his parliamentary career flourished, Mr. Vajpayee made a name for himself as an orator and with his poetic flourishes. His poetry was collated in his book Meri Ekyaavan Kavitayein (My 51 Poems). Life and times of Atal Bihari Vajpayee ",
"description": "The death came after a long spell of illness for the BJP leader.",
"time_scraped": "2018-08-17 04:53:34.461882",
"article_id": "24704802",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/bv8aiw/article24704801.ece/ALTERNATES/FREE_1080/INDIAVAJPAYEE",
"path": "full/f26c9ea0ec8bcadc4fa6fd8ce04f54885e2d2141.jpg",
"checksum": "ea729f4fc6d8730551bc48818f174e1f"
}
]
}