{
"source_article_link": "https://www.thehindu.com/news/national/creamy-layer-cannot-be-applied-to-deny-quota-benefits-in-promotions-to-scst-govt-employees-centre-tells-sc/article24703108.ece",
"title": "Creamy layer cannot apply to SCs/STs: Centre - The Hindu",
"date_published": "2018-08-16T12:56:11+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/g3kipn/article16426490.ece/ALTERNATES/FREE_1080/1115-vbk-sc1"
],
"article_body": "The government on Thursday told the Supreme Court that the “creamy layer” concept cannot be applied to the Scheduled Caste/Scheduled Tribe communities, who have suffered for centuries. Arguing before a five-judge Constitution Bench led by Chief Justice of India Dipak Misra, Attorney-General K.K. Venugopal argued that SCs/STs are a “homogenous group and any action to regroup them based on economic or social advancement would not be appropriate.” Mr. Venugopal said rigorous modalities were prescribed for inclusion of communities in the list of SCs/STs. “For inclusion of communities in the list of the SCs, one of the important determinants is the traditional practice of untouchability,” Mr. Venugopal submitted. The government wants a larger Bench of the Supreme Court to set aside its 2006 judgment in the Nagaraj case. This verdict mandates that the government cannot introduce quota in promotion for SC/ST persons in public employment unless they prove that the particular Dalit community is backward, is inadequately represented and such a reservation in promotion would not affect the overall efficiency of public administration. The opinion of the government should be based on quantifiable data, too, it said. The government has argued that the judgment was a roadblock to its authority to introduce quota in promotions in favour of SC/ST communities as per Article 16 (4A) of the Constitution. Mr. Venugopal argued that the Constitution itself creates a presumption in favour of Scheduled Castes and Scheduled Tribes that they are backward classes of citizens. “It is not disputed that the members of the scheduled castes and scheduled tribes are specified in the notifications issued under Articles 341 and 342 of the Constitution and, therefore, they must be deemed to be scheduled castes and scheduled tribes,” Mr. Venugopal submitted. He submitted that there is an “intense investigation before the notification under Articles 341 and 342 is issued. The inquiry identifies the people who have suffered for centuries and hence, by applying the ‘creamy layer’ concept, they should not be deprived of the benefits which accrue to them.” Mr. Venugopal submitted that the Nagaraj verdict destroyed the very essence of Article 16 (4A) by imposing on the State the need to bring to the table ‘quantifiable data’ to justify its decision to promote SC/ST officers in public employment. “SC/ST communities are per se deprived,” the AG submitted. “It (Nagaraj judgment) did a huge amount of injustice. It did not define what ‘quantifiable data’ the State was required to show to prove that an SC/ST community was not adequately represented in government services and required quota in promotion under Article 16 (4A),” Mr. Venugopal submitted. He submitted that the government wanted a total of 22.5% (15% for SC+7% for ST) posts reserved for promotion for SC/ST in public employment. Only this quantum would satisfy their need for adequate representation, he added.",
"description": "They’ve suffered for centuries, SC told",
"time_scraped": "2018-08-17 04:55:11.825611",
"article_id": "24703108",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/g3kipn/article16426490.ece/ALTERNATES/FREE_1080/1115-vbk-sc1",
"path": "full/71acf53d94fe73c62d81647a7aa69a1d7940ceb6.jpg",
"checksum": "e9add95775f6b8b4fbc45fb0fa62fb26"
}
]
}