{
"source_article_link": "https://www.thehindu.com/news/national/opposition-not-united-by-anti-bjpism-alone-rahul-gandhi/article24710392.ece",
"title": "Opposition not united by anti-BJPism alone: Rahul Gandhi - The Hindu",
"date_published": "2018-08-17T01:30:43+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/x810qg/article24710391.ece/ALTERNATES/FREE_1080/TH17KRARAHULMEET"
],
"article_body": "The Opposition is not united merely to oppose the Bharatiya Janata Party but by a common vision for India, Congress president Rahul Gandhi said on Thursday, sharing a platform with nine other parties. He was speaking at Sanji Virasaat Bachao Sammelan or Save Composite Culture Seminar, an initiative of the Janata Dal-United (JD-U) rebel leader Sharad Yadav. Others on the stage included Communist Party of India-Marxist (CPI-M) general secretary Sitaram Yechury, Communist Party of India (CPI) general secretary Sudhakar Reddy, Nationalist Congress Party’s (NCP) general secretary Tariq Anwar, Rashtriya Lok Dal (RLD) leader Jayant Chaudhary, Samajwadi Party’s (SP) Dharmendra Yadav, RJD’s Jai Prakash Yadav, and Janata Dal-Secular (JD-S) leader Dharmendra Yadav. His comments may be read against the backdrop of Prime Minister Narendra Modi’s allegation that the Opposition had no common ideology other than ousting the BJP government. Mr. Gandhi said that he had deliberated on how Opposition parties with diverse ideologies are standing together. “When I thought about it deeply, I came to the conclusion that there are two visions for India — one is that of the BJP, whose president said recently in a speech said that India is a sone ki chidia or a golden bird. And the second is our view — we see India as a river that can imbibe every stream of ideology in it,” he said. The BJP’s view of India, he claimed, is the same as that of the British. “They want to construct a cage to put the bird in and we are trying stop them from constructing it,” he said. Mr. Gandhi said whether it be demonetisation or hasty implementation of the Goods and Services Tax, it is the smaller businessmen and the poorer classes that are worst affected. He also brought up questions over the Rafale deal. Playing on the BJP’s ‘Congress Mukt Bharat’ slogan, Mr. Gandhi said that the Opposition was not aiming at a “BJP-Mukt Bharat”. “We do not want to finish them, kill them or destroy them. We realise their ideology too exists, and we just want to say that our ideology is stronger than theirs,” he said.",
"description": "We have a common vision for India, says Congress chief.",
"time_scraped": "2018-08-17 04:54:42.652338",
"article_id": "24710392",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/x810qg/article24710391.ece/ALTERNATES/FREE_1080/TH17KRARAHULMEET",
"path": "full/480d36f24b73b94b64c687d24419d0503fc641a0.jpg",
"checksum": "4e79dec25eb324dfd2068345770831d6"
}
]
}