{
"source_article_link": "https://www.thehindu.com/news/national/will-honour-ceasefire-if-pakistan-curbs-infiltration-india/article24710421.ece",
"title": "Will honour ceasefire if Pakistan curbs infiltration: India - The Hindu",
"date_published": "2018-08-17T01:35:57+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/article16973638.ece/ALTERNATES/FREE_1080/POONCHJammu"
],
"article_body": "The Indian Army will “abide by its commitment” to uphold the ceasefire understanding of 2003 if the Pakistan Army “initiates positive steps to control infiltration and abetment of terrorism” in J&K, Pakistan was told on Thursday. This was conveyed during a conversation between the Directors General of Military Operations (DGMOs) over the established hotline, which was held on Pakistan’s request. “The Pakistan DGMO made an assurance that Pakistan Army would take prompt action against move of inimical elements in proximity to the Line of Control and respond to information shared by the Indian side, thereby facilitating conduct of anti-terrorist operations,” the Army said in a statement. The Pakistan DGMO expressed satisfaction on the measures being taken along the LoC by troops to maintain peace and tranquillity. Over the last two months, there has been a sharp reduction in the quantum of ceasefire violations. Indian DGMO Lt. Gen. Anil Chauhan conveyed to his Pakistani counterpart that infiltration has increased in the north areas of Pir Panjal mountain ranges and stressed that Pakistan must initiate steps to prevent it, the statement added.",
"description": "India conveys message during a conversation between the DGMOs.",
"time_scraped": "2018-08-17 04:54:11.816158",
"article_id": "24710421",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/article16973638.ece/ALTERNATES/FREE_1080/POONCHJammu",
"path": "full/cb1951ab0720846f11594ce14997ba95c4793116.jpg",
"checksum": "3ebfbe32a6425db0fd84c1519169af2d"
}
]
}