{
"source_article_link": "https://www.thehindu.com/news/national/kerala-rains-pm-to-undertake-aerial-survey-on-saturday/article24718983.ece",
"title": "Kerala rains: PM to undertake aerial survey on Saturday - The Hindu",
"date_published": "2018-08-17T21:43:11+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/kerala/dr2y3y/article24716318.ece/ALTERNATES/FREE_1080/KERALAFLOODS"
],
"article_body": "Prime Minister Narendra Modi is expected to aerially survey flood-hit Kerala on Saturday. More than 160 people have been killed and over 1.5 lakh moved to relief camps in the State that is witnessing one of the worst floods in decades. Mr. Modi also spoke to Kerala Chief Minister Pinarayi Vijayan on Friday and offered him all assistance. A high level committee headed by the Cabinet Secretary met again on Friday to discuss the flood situation. A senior Home Ministry official said the use of the Naval airstrip at Kochi for use by civilian airlines has been offered to the Kerala government as the civilian airport remained closed. A team of officials from the Ministry of Civil Aviation will be travelling to Cochin on Saturday to test whether smaller turboprop flight operations can take place from the naval airbase, following which a decision will be taken to start civilian flights, according to Secretary, R.N. Choubey. Flight operations from the inundated Cochin International airport have been suspended till August 26. Cabinet Secretary P.K Sinha, who chaired the meeting of the National Crisis Management Committee (NCMC), also held a video conference with the Chief Secretaries of Kerala and Tamil Nadu. “It was decided to mobilise additional resources of all agencies including Army, Navy, Air Force, Coast Guard and National Disaster Response Force (NDRF) to provide the required assistance to Kerala,” a Home Ministry spokesperson said. Plea for motorised boats Mr. Sinha directed these organisations to provide boats, helicopters, life jackets, life buoys, raincoats, gumboots, inflatable tower lights, etc. The Kerala Chief Secretary has requested for motorised boats so as to reach people marooned in flood-affected areas. So far, the Centre has mobilised deployment of 339 motorised boats, 2,800 life jackets, 1,400 life buoys, 27 light towers and 1,000 raincoats. Further, 72 motor boats, 5,000 life jackets, 2,000 life buoys, 13 light towers and 1,000 raincoats are being deployed. Around one lakh food packets have been distributed and arrangements are being made to supply another one lakh packets. “Provision has been made for supply of milk powder as well. Indian Navy has deployed 51 boats along with diving teams, 1,000 life jackets and 1,300 gumboots are being rushed to Kerala today. It flew 16 sorties in 48 hours in rescue operations. It will airdrop 1,600 food packets on Friday,” an MHA spokesperson said. The Coast Guard has deployed 30 boats along with rescue teams, 300 life jackets, seven life rafts and 144 life buoys. The IAF deployed 23 helicopters and 11 transport aircraft. Some of the aircraft are being flown in from Yelahanka and Nagpur. The Army pressed into service 10 columns, 10 Engineering Task Forces (ETFs), 60 boats and 100 life jackets. The NDRF has mobilised 43 rescue teams and 163 boats along with other equipment. Mr. Sinha directed these organisations to mobilise additional boats and equipment including from CAPFs such as CRPF, BSF and SSB. Water from Railways The Railways have provided 1,20,000 water bottles. Another 1,20,000 bottles are ready to be despatched. It is also running a special train carrying 2.9 lakh litres of drinking water that will reach Kayakulam on Saturday. The Kerala government has been advised to explore use of V-SAT communication links in areas where telephone connectivity has been disrupted, the spokesperson said.",
"description": "Additional forces to be deployed; NCMC meets again; Naval airstrip at Kochi offered for civilian use",
"time_scraped": "2018-08-18 06:03:14.048808",
"article_id": "24718983",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/kerala/dr2y3y/article24716318.ece/ALTERNATES/FREE_1080/KERALAFLOODS",
"path": "full/c5cf09e110c0bc6e66a147127e2dc7fe3d9f12d1.jpg",
"checksum": "554508f8c75c502a19f1f590b63118cd"
}
]
}