{
"source_article_link": "https://www.thehindu.com/news/national/manmohan-singh-on-atal-bihari-vajpayee-he-shared-nehrus-vision-of-india/article24710747.ece",
"title": "Manmohan Singh on Atal Bihari Vajpayee: ‘He shared Nehru’s vision of India’ - The Hindu",
"date_published": "2018-08-17T01:57:11+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/23dv3d/article24710745.ece/ALTERNATES/FREE_1080/17THVAJPAYEEMANMOHAN"
],
"article_body": "Former Prime Minister Atal Bihari Vajpayee stood among the tallest leaders of modern India, his successor Prime Minister Dr. Manmohan Singh said in an interview. Dr. Singh said both he and Mr. Vajpayee carried forward each other’s policies on economic liberalisation and ties with the U.S. and Pakistan. Excerpts: What does the passing of former Prime Minister Atal Bihari Vajpayee mean for the nation? Vajpayeeji was truly a great Indian and a great Prime Minister, and his idea of India, I found in many ways was close to Nehru’s vision of India, and that’s the legacy I feel should be preserved. Political differences will be there, but Nehru’s vision of India, both in domestic policies and international affairs, was something Vajpayee ji also subscribed to. But Mr. Vajpayee differed with Mr. Nehru and Nehruvian ideals on many counts, primarily on domestic politics. What do you think was the similar chord? I think in politics, people should not be judged by what they say, but what they do, and in terms of actions, the approaches of these two great men were not very different. What were your own relations with him? I had developed good relations with Mr. Vajpayee when I was Finance Minister. I used to consult him and I believe both he and Advani ji were in sympathy with the liberalisation policies that I was advocating. And on important occasions, like when I presented the Budget for 1992, and fertiliser prices were a big issue, he rescued me in Parliament. Once, when I had a very rough time in Parliament, he called me, and said, ‘Dr. Singh, one ought to have a thick skin. Even if we don’t support you, you must stay strong on your path,’ he said. Is that kind of bonhomie now also a thing of the past? Well, he was truly committed to a consensus approach to politics. That legacy is now in danger, and the challenge before the country is how not to do what will hurt the legacies of Jawaharlal Nehru and A.B. Vajpayee. You spoke about Mr. Vajpayee taking forward your legacy of economic liberalisation, but you also took forward some of Mr. Vajpayee’s initiatives… In two areas — relations with the United States, and ties with Pakistan, I took more or less the same line as Mr. Vajpayee had taken. The Vajpayee government started the process of reaching out to the U.S. after our nuclear explosion in Pokharan, but those discussions broke down. When I became PM, I said to our officials that that is a path we must pursue. On Pakistan, I was in great sympathy with Atal ji’s approach to make peace. Atal ji’s approach in dealing with the internal dissensions in the Kashmir valley, were best summed up by his slogan: Insaniyat, Jumhooriyat, Kashmiriyat , which should be our norm. Mr. Vajpayee also travelled to Pakistan for the SAARC summit… I think that relations in our neighbourhood, and that includes China, are important for India to realise its chosen destiny. It was ahead of Mr. Vajpayee’s visit that President Musharraf promised that Pakistan would not allow its territory to be used by terrorists. Frankly, without that statement, without Mr. Vajpayee’s visit, I would never have been able to proceed with my efforts in normalising relations. Were there also confrontations with him? Well, I spoke to him intensively about what we were doing with the nuclear deal with the US. I called on Mr. Vajpayee, wrote him a letter but by then the BJP had decided to try and defeat our government. While I think they had no serious objections to the deal or normalising relations with the US, they did not want the Congress to take the credit for it perhaps.",
"description": "The former Prime Minister says his predecessor was committed to a consensus approach in politics.",
"time_scraped": "2018-08-17 04:53:34.756734",
"article_id": "24710747",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/23dv3d/article24710745.ece/ALTERNATES/FREE_1080/17THVAJPAYEEMANMOHAN",
"path": "full/aecf54b49f9b58ced1fbd0835921039954048369.jpg",
"checksum": "1ab1b1f8db5aac1908294b7075e85a56"
}
]
}