{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayees-final-tryst-with-karmabhoomi/article24719898.ece",
"title": "Atal Bihari Vajpayee’s final tryst with karmabhoomi - The Hindu",
"date_published": "2018-08-18T00:10:26+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/mnp8a5/article24719896.ece/ALTERNATES/FREE_1080/00018F472"
],
"article_body": "The ashes of former Prime Minister Atal Bihari Vajpayee will be immersed in the major rivers of all the districts of Uttar Pradesh, the Yogi Adityanath government has decided. The Chief Minister took the decision taking into view ‘public sentiments’ so that the “people get a chance to associate with the final journey” of the former PM, a government spokesperson said on Friday. “Uttar Pradesh was former Prime Minister Atal Bihari Vajpayeeji’s karmabhoomi . He had a deep connect with every part of Uttar Pradesh,” Mr. Adityanath said. The ashes would be immersed at over 150 places in rivers across the State. This would include the Yamuna in Agra and Allahabad, the Ganga in Varanasi, Allahabad and Kanpur, Gomti in Lucknow and Ghagra in Gorakhpur. The State has 75 districts. The State government has also indicated that it would build memorials in honour of Mr. Vajpayee, also a five-time MP from the Uttar Pradesh capital, in places closely associated with him. The list includes Mr. Vajpayee’s ancestral village Bateshwar in Agra; Kanpur, where he studied political science at the DAV College; Balrampur, Mr. Vajpayee’s first Lok Sabha seat that he won in 1957 and Lucknow, his ‘karmabhoomi.’ Mr. Vajpayee was a five-time MP from the Uttar Pradesh capital, holding the seat from 1991 to 2009, during the peak of his political life Even after he drifted away from the mainstream politics, his persona continued to dominate the electoral politics in Lucknow. and with his blessings his close aide Lalji Tandon won the seat in 2009. In 2014, too, Mr. Vajpayee’s legacy was a key point in the battle for Lucknow where the BJP’s Rajnath Singh, today Union Home Minister, went head to head with Rita Bahuguna Joshi, then with the Congress. Today, she is a Cabinet Minister in BJP-ruled UP. During the 2014 polls, Mr. Singh regularly evoked Mr. Vajpayee’s legacy in his speeches and sabhas, but the highlight of the campaign was when he flaunted the angvastram (stole) gifted to him by the former PM during his nomination. In response, Ms. Joshi roped in Karuna Shukla, Mr. Vajpayee’s niece, to campaign for her.",
"description": "Ashes to be immersed in 150 places in Uttar Pradesh.",
"time_scraped": "2018-08-18 06:03:13.566648",
"article_id": "24719898",
"article_category": "National",
"image_details": []
}