{
"source_article_link": "https://www.thehindu.com/news/national/tn-refuses-to-reduce-mullaperiyar-level/article24719003.ece",
"title": "Tamil Nadu refuses to reduce Mullaperiyar level - The Hindu",
"date_published": "2018-08-17T21:44:10+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/tamil-nadu/yvx07w/article24704755.ece/ALTERNATES/FREE_1080/MULLAPERIYAR"
],
"article_body": "Tamil Nadu has “dissented” from an advisory issued by a Supreme Court-nominated expert committee to reduce water storage in the Mullaperiyar dam by two to three feet. As of Friday morning, water in the dam had risen to 141.2 feet, just a few inches short of the 142-feet ceiling mandated by an existing SC order, a Water Resources Ministry official present at the meeting said. The meeting in Delhi was attended by senior officials from the Union Water Resources Ministry, Central Water Commission, Chief Secretaries of Kerala and Tamil Nadu and State water board officials. More rain forecast “Tamil Nadu was advised to reduce water by 2-3 feet, as a sort of cushion, in case of sudden heavy rains in the coming days and that it was impossible to rapidly release a large amount of water in an emergency. They refused,” said a person at the meeting. “However, more than a scientific requirement, releasing water by a few feet would give psychological relief to Kerala, given that the situation is volatile and misinformation is rife,” he added. ‘Set a precedent’ Another official at the meeting told The Hindu that Tamil Nadu had dissented because they were afraid it would “set a precedent — of the State being forced to release water in the future too if demanded by Kerala.” Moreover, with the Idukki dam downstream also now having released water, more water from the Mullaperiyar could worsen Kerala’s flood problems, the Tamil Nadu officials reportedly argued. The Hindu couldn’t independently verify this. “Ultimately, Kerala and Tamil Nadu have to abide by the Supreme Court order but Tamil Nadu has said its dissent be recorded,” an official said.",
"description": "The state \"dissents\" from an advisory by the Supreme Court",
"time_scraped": "2018-08-18 06:03:07.841437",
"article_id": "24719003",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/tamil-nadu/yvx07w/article24704755.ece/ALTERNATES/FREE_1080/MULLAPERIYAR",
"path": "full/a55dd6c9ba02ade86a1e553507bd41b9d83b6fa3.jpg",
"checksum": "2a02c95d6f596af2eb4a1d7857c0b14d"
}
]
}