{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-india-bids-goodbye-to-its-gentleman-politician/article24719616.ece",
"title": "Atal Bihari Vajpayee: India bids goodbye to its gentleman politician - The Hindu",
"date_published": "2018-08-17T23:28:59+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/on43zy/article24719615.ece/ALTERNATES/FREE_1080/TH18VAJPAYEE"
],
"article_body": "Cries of ‘Atal Bihari Amar Rahe’ rending the air, the nation bid farewell to former Prime Minister Atal Bihari Vajpayee with full state honours on Friday, with his foster daughter Namita Bhattacharya lighting the pyre at Smriti Sthal in the capital. The funeral was preceded by Prime Minister Narendra Modi joining the cortege on foot as Mr. Vajpayee’s body was brought from the BJP headquarters on Deen Dayal Upadhyaya Marg — where it was kept for public homage — to the cremation site. People lined the route, showering rose petals and chanting ‘long live Vajpayee’ as tens of thousands of mourners took part in the procession. President Ram Nath Kovind, former Prime Minister Manmohan Singh, and Vice-President Venkaiah Naidu were among those who attended the funeral. Senior BJP leader L.K. Advani, BJP president Amit Shah and Congress president Rahul Gandhi were in attendance as Vajpayee’s mortal remains were consigned to flames. Chief Ministers Yogi Adityanath, Nitish Kumar, Shivraj Singh Chouhan and Vijay Rupani, and a host of foreign dignitaries also attended the funeral. In keeping with military honours, the three service chiefs placed wreaths on the body of the former Prime Minister before others offered their floral tributes. The Tricolour wrapped around his coffin was removed and given to his foster granddaughter Niharika, after which the body was handed over to the family for last rites. Many in the crowd broke down as the pyre was lit amid the chanting of Vedic hymns and a 21-gun salute by soldiers. “We cannot believe that we are witnessing the last journey of one of our finest Prime Ministers. He was a politician who understood the need to take everyone along. There is no other leader like him,” said Poonam Devi, who had come from Agra to attend the ceremony at Smriti Sthal. ‘Loved by all’ Ashok Seth said he and his friends had reached the BJP headquarters in the morning itself since they wanted to be with their leader till the very end. “We feel sad that India has lost a beloved gentleman politician who was loved by all. The common man can show his love by participating in his last journey and that is what we are doing here,” he said. Mr. Vajpayee breathed his last at 5.05 p.m. on Thursday after spending nine weeks at the All India Institute of Medical Sciences, where he was undergoing treatment for multiple health complications. He was 93. (With agency inputs)",
"description": "PM Modi follows cortege on foot, along with others",
"time_scraped": "2018-08-18 06:03:09.110950",
"article_id": "24719616",
"article_category": "National",
"image_details": []
}