{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-the-politician-coalition-builder/article24710360.ece",
"title": "Atal Bihari Vajpayee, the politician: Coalition builder - The Hindu",
"date_published": "2018-08-17T01:24:52+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Former Prime Minister Atal Bihari Vajpayee’s long time friend and associate L K Advani, summed up his political legacy when he called him the pioneer, who gave India the first stable, non-Congress coalition government. After failing to find the numbers for his 13-day old government in 1996, Mr. Vajpayee resigned on the floor of the House but not before leaving a mark with his standout speech. “Governments come and go and parties are born and disappear. Above it all, the country must stay shining, its democracy immortal,” the outgoing Prime Minister said in what has become the defining moment of his long parliamentary career. After the collapse of coalition experiments like the United Front governments, Mr Vajpayee stitched up a formidable alliance of 13 parties in 1998, including the BSP, AIADMK, the TDP and the TMC. But the government lasted a little over a year. The number 13 stuck to Vajpayee — his first government lasted 13 days, his first coalition government had 13 parties and lasted 13 months. In 1999 as the BJP came back to power, 20 parties came together to make Mr. Vajpayee the Prime Minister for a third time. “Vajpayee was instrumental in strengthening the BJP. From a party that had just two members in Lok Sabha, Vajpayee rode it to power. He was a successful MP, leader of opposition, Minister of External Affairs and eventually the Prime Minister,” TDP leader Chandrababu Naidu said in his tribute. Often described as the “right man in the wrong party”, Mr. Vajpayee managed the rare feat of wearing his RSS identity just as easily as his image of being a moderate in the Sangh Parivar. Starting out as a Jana Sangh member in the Lok Sabha in 1957, when Prime Minister Jawahar Lal Nehru was a giant in Indian politics, Mr. Vajpayee made his mark as an orator in Parliament. It speaks to his strong commitment to parliamentary democracy that while he was not afraid to take on the Prime Minister in Parliament, he compared him to Lord Ram in his speech after Nehru died in 1964. Among leaders who were jailed during the Emergency, the former Prime Minister’s affable manner endeared him to the Opposition. And building political consensus became a hallmark of his politics. In her tribute, UPA Chairperson Sonia Gandhi said, “Shri Vajpayee was a towering figure in our national life. Throughout his life, he stood for democratic values and demonstrated this commitment in all his acts, whether as a parliamentarian, a cabinet minister, or Prime Minister of India.” “He was a spell-binding orator, a leader of great vision, a patriot to the core for whom the national interest was paramount. But above all, he was a man with a very large heart and a real spirit of magnanimity,” she added.",
"description": "Former Prime Minister Atal Bihari Vajpayee’s long time friend and associate L K Advani, summed up his political legacy when he called him the pioneer, who gave India the first stable, non-Congress coalition government. After failing to find the numbers for his 13-day old government in 1996, Mr. Vajpayee resigned on the floor of the House but not before leaving a mark with his standout speech. “Governments come and go and parties are born and disappear. Above it all, the country must stay shining, its democracy immortal,” the outgoing Prime Minister said in what has become the defining moment of his long parliamentary career. After the collapse of coalition experiments like the United Front governments, Mr Vajpayee stitched up a formidable alliance of 13 parties in 1998, including the BSP, AIADMK, the TDP and the TMC. But the government lasted a little over a year. The number 13 stuck to Vajpayee — his first government lasted 13 days, his first coalition government had 13 parties and lasted 13 months. In 1999 as the BJP came back to power, 20 parties came together to make Mr. Vajpayee the Prime Minister for a third time.",
"time_scraped": "2018-08-17 04:55:42.956664",
"article_id": "24710360",
"article_category": "National",
"image_details": []
}