{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-was-a-democrat-to-the-core-says-pranab/article24710517.ece",
"title": "Atal Bihari Vajpayee was a democrat to the core, says Pranab - The Hindu",
"date_published": "2018-08-17T01:41:43+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Former President Pranab Mukherjee described Atal Bihari Vajpayee as a titan, while Congress president Rahul Gandhi said, “India has lost a great son who was loved and respected by millions.” In keeping with the stature of the former Prime Minister, even political rivals were effusive in their praise. In a letter to Mr. Vajpayee’s foster daughter Namita, Mr. Mukherjee wrote, “A democrat to the core, Atal ji dominated the Opposition space like a titan and led the Government with aplomb. An inheritor and practitioner of the best traditions and qualities of leadership, in his demise the nation has lost a great son. An era that will always be fondly remembered has passed away.” The Congress chief, who was among the first few political leaders to have visited him at the All India Institute of Medical Sciences, said, “Today India lost a great son. Former PM, Atal Bihari Vajpayee ji, was loved and respected by millions. My condolences to his family & all his admirers. We will miss him.” Leaders remembered the former Prime Minister’s ability to build consensus as a hallmark of his politics. Former Finance Minister P. Chidambaram said it was Mr. Vajpayee who didn’t allow the BJP to go extreme right. “He led his party to its first victory in national elections and established the credentials of the BJP to run the Central government… As long as he was at the helm, he resolutely anchored the BJP close to the middle and did not allow the party to swing to the extreme right of the political spectrum,” he said. He noted that among many things, Mr. Vajpayee’s long lasting legacy will be his genuine efforts to resolve the decades-long hostility between Pakistan and India Leader of the Opposition in Rajya Sabha Ghulam Nabi Azad said, “He never hesitated in giving full credit to his Opposition party leaders whenever due.”",
"description": "‘Dominated Oppn. space like a titan’",
"time_scraped": "2018-08-17 04:57:40.638191",
"article_id": "24710517",
"article_category": "National",
"image_details": []
}