{
"source_article_link": "https://www.thehindu.com/news/national/bhutan-king-ministers-from-south-asian-neighbours-at-vajpayee-funeral/article24713669.ece",
"title": "Bhutan King, ministers from South Asian neighbours to attend Vajpayee funeral - The Hindu",
"date_published": "2018-08-17T10:12:50+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/gkibkj/article24713668.ece/ALTERNATES/FREE_1080/INDIAOBITVAJPAYEE"
],
"article_body": "Bhutan’s King Jigme Khesar Namgyal Wangchuk is scheduled to attend the funeral of former Prime Minister Atal Bihari Vajpayee on Friday afternoon here along with a host of global envoys and dignitaries. Pakistan’s Acting Law and Information Minister and the foreign ministers of Nepal and Bangladesh are also scheduled to be at the cremation of the departed leader who received rich tributes from global capitals. “Mr Vajpayee was a renowned statesman who contributed to bringing a change in India-Pakistan relations and remained a key supporter of SAARC and regional cooperation for development. The Government and people of Pakistan extend their heartfelt condolences to his family and to the Government and people of India,” the official message from Pakistan’s Ministry of Foreign Affairs said. The incoming Prime Minister Imran Khan who is scheduled to take oath of office on 18 August said Mr Vajpayee left a void in South Asia. “There is a void in the politics of South Asia after his death. There can be political differences but the desire of peace remains present across the border. We stand with India in this difficult time,” Mr. Imran Khan told the Pakistani media. Personal tributes also came from former President of Afghanistan Hamid Karzai who was the first Afghan leader to work with India after the fall of the Taliban rule in Kabul in 2001. “He had a very straightforward and strong policy with Afghanistan. He was the first to offer us civilian planes, airbuses at the time we were starting out. So he began the journey very steadfastly with us, and was instrumental in setting off India-Afghanistan ties after 2001 on a very strong footing,” said Mr. Karzai speaking to The Hindu Prime Minister of Bangladesh Sheikh Hasina described Mr. Vajpayee as one of the “most famous sons of India” and said, “Shri Atal Bihari Vajpayee was our great friend and highly respected in Bangladesh. As a token of recognition for his invaluable contribution to our Liberation War in 1971, Bangladesh Liberation War Honour. Today is certainly a day of great sadness for all of us in Bangladesh. Nepal’s Prime Minister K. P. Sharma Oli has extended condolences over the demise of Mr. Vajpayee and said that in his death, Nepal has lost a “true friend and well wisher”. A statement from Nepal’s Ministry of Foreign Affairs stated, “In the message, Prime Minister Oli has stated that late Vajpayee was a visionary statesman with impeccable integrity and dedication, who will be remembered for his sagacity and exemplary selfless service to the people of India.” Nepal’s foreign minister Pradeep Gyawali and Bangladesh’s foreign minister AH Mohammed Ali are for the last rites of Mr. Vajpayee.",
"description": "“There is a void in the politics of South Asia after his death. There can be political differences but the desire of peace remains present across the border. We stand with India in this difficult time,” Mr. Imran Khan told the Pakistani media.",
"time_scraped": "2018-08-17 12:01:46.978542",
"article_id": "24713669",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/gkibkj/article24713668.ece/ALTERNATES/FREE_1080/INDIAOBITVAJPAYEE",
"path": "full/13ac490a3f6ac5866f1049332878b0cabaf3c8c9.jpg",
"checksum": "a7d30daab4ec45d9d5fe75c1bd4f12d1"
}
]
}