{
"source_article_link": "https://www.thehindu.com/news/national/a-misty-eyed-opposition-at-vajpayees-funeral/article24719180.ece",
"title": "A misty-eyed Opposition at Vajpayee’s funeral - The Hindu",
"date_published": "2018-08-17T22:06:18+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/wvdglf/article24719179.ece/ALTERNATES/FREE_1080/17TH-THGRP-VAJ"
],
"article_body": "In death, as in life, veteran BJP leader Atal Bihari Vajpayee played the role of a unifier as some of the top Opposition leaders, including Manmohan Singh, who became Prime Minister after him, and Congress president Rahul Gandhi, were among the first few leaders who arrived at his funeral. Samajwadi Party (SP) stalwart Mulayam Singh was not only at the cremation but also visited the Bharatiya Janata Party (BJP) office to bid farewell to his long-time political opponent. Such tributes by ideological opponents, however, have also put into sharp focus a changing political culture, where a different political ideology generates adversarial relations. “Mr. Vajpayee was infinitely more accommodating and large-hearted. He was not petty, vindictive or full of rage as the present dispensation. He was a product of the Nehruvian era,” senior Congress leader Jairam Ramesh said. Mr. Ramesh, who recently authored a book on former Prime Minister Indira Gandhi, rejected any suggestion that the “present dispensation” under Prime Minister Narendra Modi was like the Congress under Mrs. Gandhi, when “brute parliamentary majority decided policy”. “No. Indira Gandhi or Atal Bihari Vajpaye had many front or back channels. There was mutual respect,” he said, adding that it was not found in the current political discourse. This seemed to be in evidence on Thursday. When the Congress chief’s microphone went silent while addressing the Sanjhi Viraasat (common heritage) convention in Delhi, Mr. Gandhi joked that BJP president Amit Shah had tried to “silence” him. Senior leaders point out that even when the Vajpayee-led National Democratic Alliance (NDA) was in power, the Congress was a fierce opponent. The party had brought out a “chargesheet” against his government on defence scams such as the “coffin scam”, the Tehelka tapes and the allotment of government land to Sangh affiliates. But politics did not result in any kind of personal animosity. “His warm personality and his gift of friendship won him admirers and friends across the political spectrum and from every walk of life,” former Congress president Sonia Gandhi said in her tribute to the former Prime Minister. ‘Credit where due’ Leader of the Opposition in the Rajya Sabha Ghulam Nabi Azad said, “He never hesitated to give full credit to Opposition leaders whenever due.” “It is not [to speak of] the fact that Vajpayee ji had many friends — the fact that he had no enemies was his distinguishing hallmark,” former Finance Minister P. Chidambaram said.",
"description": "Leaders remember how Vajpayee maintained good relations with them",
"time_scraped": "2018-08-18 06:03:13.308749",
"article_id": "24719180",
"article_category": "National",
"image_details": []
}