{
"source_article_link": "https://www.thehindu.com/news/national/ease-of-living-interactive/article24717269.ece",
"title": "Ease of Living Index interactive: where does your city rank? - The Hindu",
"date_published": "2018-08-17T17:27:27+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/migration_catalog/bak5fh/article24717417.ece/ALTERNATES/FREE_1080/Pune%20city"
],
"article_body": "The Ease of Living Index released by the Housing and Urban Affairs Ministry is based on a comprehensive report which assesses the quality of life in cities on the four broad parameters of governance, social, economic and infrastructure. The interactive below helps you find out where your city stands on those parameters as compared to the national average. The study took into consideration 78 indicators in 15 categories. All cities were evaluated out of 100. The 'physical' pillar (infrastructure) was given the highest weightage of 45, while institutional (governance) and social were weighted 25 each. Economy was weighted 5. Here are a few highlights from the data analysis: Among the 111 cities considered, Navi Mumbai, Tirupati and Karim Nagar had the best institutional sub-index. In terms of social indicators, Tirupati and Tiruchirapalli scored the highest. Chandigarh, Ajmer and Kota did best on the economic sub-index. Greater Mumbai, Pune and Thane topped in terms of infrastructure and other physical parameters. In mega-cities (Population over 4 million) Chennai came second after Mumbai, while New Delhi was the worst mega-city. Andhra Pradesh had 75% (three out of four cities considered for the survey) of its cities among the top 25 ranks. Maharashtra had 66% of its cities in the top 25 (eight out of 12) while four out of seven (57%) cities in Madhya Pradesh were among the top crop. (Note: Sometimes, visualisations do not work in 'amp' mode. Please remove 'amp' from the URL.) ",
"description": "The Ease of Living Index released by the Housing and Urban Affairs Ministry is based on a comprehensive report which assesses the quality of life in cities on the four broad parameters of governance, social, economic and infrastructure.",
"time_scraped": "2018-08-17 21:04:38.670662",
"article_id": "24717269",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/migration_catalog/bak5fh/article24717417.ece/ALTERNATES/FREE_1080/Pune%20city",
"path": "full/1aef7c10b76562a8e2e445568806de0fc5f00456.jpg",
"checksum": "ed8099f59e8628e3f859699165289c91"
}
]
}