{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-the-prime-minister-keeper-of-coalition-builder-of-consensus/article24710203.ece",
"title": "Atal Bihari Vajpayee, the Prime Minister: Consensus maker - The Hindu",
"date_published": "2018-08-17T01:12:58+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Former Prime Minister Atal Bihari Vajpayee walked into history books a long time ago as the first non-Congressman at the top post to complete a full term. Some say that the feat could only have been achieved by him, a man uniquely suited to make sure the delicate coalition, which the mandate of 1999 had thrown up, lasted its whole term. Mr. Vajpayee himself said once in Parliament that, as Prime Minister, he may have been at the helm for a short time, but had achievements that would be remembered forever. The BJP may now occupy the pole position in Indian politics by invoking the emotions of Hindutva, but when it came to forming the government in 1998 and in 1999 (the third time that Mr. Vajpayee was sworn in, and the term that would last the full five years), the party under its consensus-building leader kept its three core issues of the Ram Temple, the abrogation of Article 370 and the demand for a Uniform Civil Code aside. Mr. Vajpayee, a self-proclaimed staunch pracharak of the Rashtriya Swayamsevak Sangh (RSS), did it to hold the fragile coalition together, and to also avail his party the opportunity of securing other important goals for itself. The first among these, in the short-lived 13-month government between 1998-99, was the Pokhran test that made India a nuclear state, an exercise that shocked the world, but which also gave the BJP the patina of a ‘doer’. The strong nationalist sentiment it invoked, as well as Mr. Vajpayee’s handling of the war in Kargil with Pakistan, enabled the party to, without much of a role in the freedom movement, occupy a nationalist plank. It also afforded Mr. Vajpayee the headroom he needed to think out-of-the-box on relations with Pakistan in his third term, and in Jammu & Kashmir, where his declaration that issues relating to the State be resolved within the contours of insaaniyat or humanism, still the most accepted template there, gave him rare popularity. The tenuous coalition he led was not the only thing he overcame. In initiating and taking forward far-reaching economic reforms in infrastructure and telecom, and some unpopular decisions with disinvestment, he took on elements of the RSS that opposed such actions. This deft handling of the pulls and pressures of an ideological anchoring with the compulsions of a coalition, made him a prime minister who had friends across the board. In a memorable speech in Parliament, he declared he stood by the ancient wisdom that exhorted critics should be kept close and sycophants far away. His attempts to build consensus over his government’s decisions reflected this view. As Prime Minister, he did not allow his political compulsions to consume him. He turned them tactile, malleable, sometimes even to an advantage, to emerge as a statesman Prime Minister, comparable to the greatest in the country. Nistula Hebbar",
"description": "Former Prime Minister Atal Bihari Vajpayee walked into history books a long time ago as the first non-Congressman at the top post to complete a full term. Some say that the feat could only have been achieved by him, a man uniquely suited to make sure the delicate coalition, which the mandate of 1999 had thrown up, lasted its whole term. Mr. Vajpayee himself said once in Parliament that, as Prime Minister, he may have been at the helm for a short time, but had achievements that would be remembered forever. The BJP may now occupy the pole position in Indian politics by invoking the emotions of Hindutva, but when it came to forming the government in 1998 and in 1999 (the third time that Mr. Vajpayee was sworn in, and the term that would last the full five years), the party under its consensus-building leader kept its three core issues of the Ram Temple, the abrogation of Article 370 and the demand for a Uniform Civil Code aside. Mr. Vajpayee, a self-proclaimed staunch pracharak of the Rashtriya Swayamsevak Sangh (RSS), did it to hold the fragile coalition together, and to also avail his party the opportunity of securing other important goals for itself. The first among these, in the short-lived 13-month government between 1998-99, was the Pokhran test that made India a nuclear state, an exercise that shocked the world, but which also gave the BJP the patina of a ‘doer’. The strong nationalist sentiment it invoked, as well as Mr. Vajpayee’s handling of the war in Kargil with Pakistan, enabled the party to, without much of a role in the freedom movement, occupy a nationalist plank. It also afforded Mr. Vajpayee the headroom he needed to think out-of-the-box on relations with Pakistan in his third term, and in Jammu & Kashmir, where his declaration that issues relating to the State be resolved within the contours of insaaniyat or humanism, still the most accepted template there, gave him rare popularity.",
"time_scraped": "2018-08-17 04:53:35.056849",
"article_id": "24710203",
"article_category": "National",
"image_details": []
}