{
"source_article_link": "https://www.thehindu.com/news/national/sc-asks-delhi-lieutenant-governor-to-take-effort-to-clear-garbage/article24717497.ece",
"title": "SC asks Delhi Lieutenant Governor to take effort to clear garbage - The Hindu",
"date_published": "2018-08-17T17:53:48+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/lpnapt/article24717496.ece/ALTERNATES/FREE_1080/DELHIGARBAGE"
],
"article_body": "The Supreme Court on Friday asked the Lieutenant Governor (LG) of Delhi to make a collaborative effort with the help of civil society and resident welfare associations to clear Delhi of its garbage. A three-judge Bench led by Justice Madan B. Lokur turned to the LG after, in a previous hearing, voicing its exasperation at how garbage is dumped outside the homes of underprivileged families. Justice Lokur had even challenged authorities to dump rubbish outside the Raj Niwas, the official residence of the LG. The Bench, in a short order, asked the LG to look into all the aspects of solid waste management and “not rush into taking a decision”. Instead, the effort should be for an in-depth consideration of the problem which has dogged Delhi for decades. The court emphasised that the deliberations, including the cleaning up of landfill sites at Ghazipur, Okhla and Bhalswa, should be “collaborative” with equal say to civil society and residents. “The condition of Delhi is critical… the effect of this garbage on health and environment is not just confined to Delhi but to the neighbouring States. “You (LG) need the help of the people of Delhi for this,” Justice Lokur remarked. Additional Solicitor General (ASG) Pinky Anand, appearing for the office of LG, told the bench that she would discuss the matter with the LG and come back to the court within a week. The bench asked senior advocate Colin Gonsalves, who is amicus curiae, to suggest five names of persons from civil society and experts who could participate in the committee as members. A recent affidavit filed by the Lieutenant Governor’s office said Delhi is struggling to contain its daily waste generation. The LG produced statistics to show the Supreme Court that lack of land to establish new landfill sites have choked the Capital, which produces 10,200 Tonnes Per Day (TPD) of municipal solid waste.",
"description": "The court emphasised that deliberations, including the cleaning up of landfill sites at Ghazipur, Okhla and Bhalswa, should be “collaborative”.",
"time_scraped": "2018-08-17 18:01:33.431324",
"article_id": "24717497",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/lpnapt/article24717496.ece/ALTERNATES/FREE_1080/DELHIGARBAGE",
"path": "full/b386210386d0e219fc8118204b65a301369df752.jpg",
"checksum": "9dc6fe278ee29f167ccb82460c40a0c9"
}
]
}