{
"source_article_link": "https://www.thehindu.com/news/national/rahul-gandhi-concealed-facts-says-i-t-department/article24710406.ece",
"title": "Rahul Gandhi concealed facts, says I-T department - The Hindu",
"date_published": "2018-08-17T01:32:22+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "The Income Tax department told the Delhi High Court on Thursday that Congress leader Rahul Gandhi’s tax assessment for the year 2011-12 was reopened as material facts were concealed. Additional Solicitor General (ASG) Tushar Mehta, appearing for the I-T department, made the submission before a Bench of Justices S. Ravindra Bhat and A.K. Chawla. The Bench reserved its order on the pleas of Mr. Gandhi, his mother Sonia Gandhi and Congress leader Oscar Fernandes, all of whom have challenged reopening of their tax assessments for the same year (2011-12). Oral instruction The Bench orally asked the Income Tax Department not to take any coercive step against them till pronouncement of its verdict on September 10. During the hearing, the ASG argued that the Congress leaders had alleged ‘mala fide’ on the part of the tax department but had not made any averments in this regard in their petition. Mr. Mehta also defended the department’s decision to send a notice to the Congress leaders at 11.28 p.m. on March 31, 2018 saying the officers were doing their duty. “I [assessing officer] will be guilty of dereliction of duty if I do not send the notice before the stipulated time,” Mr. Mehta argued. Senior Congress leader and senior advocate P. Chidambaram, appearing for the party leaders, argued that the notice issued by the tax department informing the reopening of assessment was “perverse” and sent with “non-application of mind.”",
"description": "Delhi High Court stops it from ‘any coercive step’.",
"time_scraped": "2018-08-17 04:53:34.937097",
"article_id": "24710406",
"article_category": "National",
"image_details": []
}