{
"source_article_link": "https://www.thehindu.com/news/national/a-democrat-and-liberal-says-jaitley/article24719198.ece",
"title": "Vajpayee was a democrat and liberal, says Jaitley - The Hindu",
"date_published": "2018-08-17T22:07:42+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/ysa748/article24719197.ece/ALTERNATES/FREE_1080/TH18KRAJAITLEY"
],
"article_body": "Union Minister Arun Jaitley has described former Prime Minister Atal Bihari Vajpayee as a product of parliamentary democracy who accepted criticism, and as the “quintessential gentleman.” “Atalji’s demise is referred to by many as the end of an era. I, however, consider it as a continuation of the era of which he was one who laid the foundation,” he said in a blog on Mr. Vajpayee under whom he served as a Minister in the first NDA government. “In the world’s largest democracy, only the Congress dominated in the first few decades. Atalji created an alternative, which in the last two decades became larger and bigger than the Congress. Along with [L.K.] Advaniji, he created a second line of leaders both at the Centre and in the States,” he wrote. “He was always at ease dealing with both friends and opponents and had never allowed himself to get into any petty controversy.” He said the Pokhran nuclear test in 1998 was a defining moment of his government and he went out of the way to work for peace with Pakistan. “But when the need arose, he inflicted a severe blow on it [Pakistan] in Kargil. Both Pokhran and Kargil were his high points.” On the economic front, Mr. Jaitley called Mr. Vajpayee a liberaliser, pointing to the National Highways, rural roads, better infrastructure, a new telecom policy that was pragmatic and a new electricity law. Above all, Mr. Jaitley added, “Atalji was a democrat. His political style was liberal. He bore no malice. He communicated even with those who disagreed [with him].”",
"description": "‘A product of parliamentary democracy’",
"time_scraped": "2018-08-18 06:03:10.813230",
"article_id": "24719198",
"article_category": "National",
"image_details": []
}