{
"source_article_link": "https://www.thehindu.com/news/national/kerala-floods-resolve-the-calamity-with-humaneness-focus-requisite-efficiency-says-sc/article24716937.ece",
"title": "Kerala floods: Resolve the calamity with ‘humaneness, focus, requisite efficiency’, says SC - The Hindu",
"date_published": "2018-08-17T16:31:35+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/f3ub5j/article24716936.ece/ALTERNATES/FREE_1080/SUPREMECOURT"
],
"article_body": "Chief Justice of India Dipak Misra reached out to the people of Kerala whose lives have been swept away by the floods while urging the Centre and the Kerala government to resolve the calamity with “humaneness, focus and requisite efficiency”. “This is a crisis and we want everyone to wake up to the situation,” Chief Justice Misra observed orally on Friday. Empathising with the suffering of the people of Kerala, Chief Justice Misra said “you have never faced such a calamity.” The Bench, also comprising Justice D.Y. Chandrachud, however refrained from interfering with the ongoing work of the Centre and the Kerala government to contain the natural disaster and save lives. The Supreme Court commended the Kerala government for its “immense efforts” to rescue people trapped in floods. Water levels in Mullaperiyar dam The apex court said judges were no experts to frame a disaster management plan or measure the dangers of water levels in Mullaperiyar dam. The Bench is hearing a petition filed by Russel Joy, a resident of Idukki district where the dam is located. Mr. Joy, represented by advocate Manoj George, highlighted that the water storage level in the dam was dangerously high and a source of constant fear for people in an “already submerged Kerala”. The petitioner contended that the court should hand over the charge of the dam to the National Executive Committee under the Disaster Management Act of 2005 to avert another tragedy. Chief Justice Misra said the court leaves it entirely in the hands of the Centre, Kerala and Tamil Nadu governments to resolve the issues concerning the floods and release of water from Mullaperiyar dam. “We are leaving it to the Executive. What can we do now? The idea is to resolve the calamity and rescue and rehabilitate people caught in the floods,” Chief Justice Misra observed. ‘Trust the experts on ground’ The Centre, represented by Additional Solicitor General P.S. Narasimha, meanwhile read out a text message he received on his mobile phone about the meeting held on August 17 among a panel set up under Section 9 of the Disaster Management Act of 2005 with the National Crisis Management Committee and competent authorities from Tamil Nadu and Kerala, who joined in via video conferencing. Mr. Narasimha said the meeting resolved to reduce the water level in the dam in a phased manner. Mr. Narasimha asked the court to place its trust on the experts on the ground. “You (Supreme Court) just have to trust them. They are monitoring the situation 24X7 on a minute-by-minute basis,” Mr. Narasimha submitted. He said a supervisory committee of experts is watching the water levels of the Mullaperiyar dam “day in and day out” in consultation with both Tamil Nadu and Kerala governments. The flood situation, rescue and rehabilitation work is being monitored at the highest level under the National Crisis Management Committee headed by the Union Cabinet Secretary, Mr. Narasimha submitted. “Let us deal with the situation in every possible way,” Chief Justice Misra said. The court, in its order, suggested that the disaster management sub-committee, National Crisis Management Committee and supervisory panel monitoring the Mullaperiyar dam should meet to explore ways to reduce water level to 139 feet. The court ordered that every measure should be taken to give advance warning to people living in downstream areas before water is released from the dam. The Supreme Court directed the Kerala Chief Secretary to file an affidavit about the steps taken for disaster management, rescue and rehabilitation. The Supreme Court underscored that the Kerala government should follow the instructions issued by the National Crisis Management Committee on rescue and rehabilitation measures while Tamil Nadu should \"scrupulously\" comply with any instructions to bring down the water level of the Mullaperiyar dam. The court scheduled the next hearing on August 24.",
"description": "The apex court said judges were no experts to frame a disaster management plan or measure the dangers of water levels in Mullaperiyar dam",
"time_scraped": "2018-08-17 18:01:31.713013",
"article_id": "24716937",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/f3ub5j/article24716936.ece/ALTERNATES/FREE_1080/SUPREMECOURT",
"path": "full/a74e970bf8425ba81e5196faa177d3c5e0726c64.jpg",
"checksum": "b33323fe4a4f2872a011de9592bcd01e"
}
]
}