{
"source_article_link": "https://www.thehindu.com/news/national/vajpayees-stature-dignity-attracted-me-to-public-life-says-ram-nath-kovind/article24717299.ece",
"title": "Vajpayee’s stature, dignity attracted me to public life, says Ram Nath Kovind - The Hindu",
"date_published": "2018-08-17T17:23:28+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/n1s0w6/article24717298.ece/ALTERNATES/FREE_1080/KOVIND"
],
"article_body": "President Ram Nath Kovind on Friday described Atal Bihari Vajpayee’s demise a personal loss for him and said it was the former prime minister’s stature and dignity that attracted him to public life by giving up his legal profession. Conveying his condolences on the passing away of Vajpayee, the President in his letter to the former prime minister’s adopted daughter Namita Kaul Bhattacharya said that working with him was an unforgettable experience. “Atalji’s death is of course a personal loss for you and others at home. It is also a personal loss for me. It was his stature and dignity that attracted me to public life, as I gave up the legal profession to become his colleague,” he said in the letter. “Years later, when I called on him after being elected the President of India, he was bed-ridden but responded as only he could with a movement of his eyes. Silently I felt he blessed me,” Mr. Kovind said. The President said millions of homes across the country have felt the loss on Vajpayee’s demise. “He was our much-loved former prime minister, a national leader of rare distinction and a statesman of modern India. In his long and distinguished public career, he touched innumerable lives in innumerable ways — as a freedom fighter and an intellectual, as a writer and a poet, as a parliamentarian and an administrator and finally as prime minister. He was truly the Renaissance Man of Indian politics,” Mr. Kovind said. The loss of this large-hearted, larger-than-life leader will be felt not only in India but across the world, the president said. As the Prime Minister of India, Atalji was an example of grace under pressure, and of decisive leadership in challenging circumstances, he said, adding the Pokhran (nuclear) tests of 1998, the Kargil crisis of 1999, the economic changes his government brought about, and the growth and development track on which it put our country’s GDP — his was a term rich in achievements and in legacy. The Bharat Ratna conferred on him in 2015 was a fitting manifestation of India’s affection and gratitude, the president said and asserted that the loss of this large-hearted, larger-than-life leader will be sensed not only in India but across the world. “Please once more accept my deepest condolences and convey these to the countless friends and admirers of Atalji. May the Almighty give you and other members of the family the strength and courage to bear this irreparable loss,” he said in the letter to Bhattacharya.",
"description": "The President said millions of homes across the country have felt the loss on Vajpayee’s demise.",
"time_scraped": "2018-08-17 18:01:33.060501",
"article_id": "24717299",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/n1s0w6/article24717298.ece/ALTERNATES/FREE_1080/KOVIND",
"path": "full/8ea4185557020bee4093c9ffd3173a82db391a49.jpg",
"checksum": "1d13e0589b401343b007b4bf13742b57"
}
]
}