{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-the-orator/article24710175.ece",
"title": "Atal Bihari Vajpayee, the orator: Speech that sounded like poetry - The Hindu",
"date_published": "2018-08-17T01:09:33+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/5gbzr4/article24710174.ece/ALTERNATES/FREE_1080/TH17KRAORATOR"
],
"article_body": "The long political career of Atal Bihari Vajpayee is marked by one unique facet: his mesmerising oratory in Hindi that touched friends and foes alike. While he stayed Prime Minister for six years — from 1998 to 2004 — his long parliamentary stint was marked by sharp oratory laced with humour. The older Prime Minister Vajpayee was more guarded and spoke with pauses, unlike the younger fiery orator Vajpayee. Arguably the best Hindi orator Parliament has ever seen, he held people in rapt attention from the 1950s to the 1990s. Mr. Vajpayee first entered Parliament in 1957 from Balrampur in Uttar Pradesh, in what was to be the first of his 10 Lok Sabha terms. Yet he made a mark, despite his party, the Jana Sangh, being insignificant at that time. Hearing him speak, India’s first Prime Minister Jawaharlal Nehru is believed to have told a visiting foreign dignitary of the young MP’s immense promise, saying that he could be Prime Minister one day. When Nehru died in May 1964, Mr. Vajpayee’s obituary speech in Parliament read like poetry. He said, in characteristic Vajpayee style, that Mother India was sad as “her most beloved prince had gone to sleep”. A dream has remained half-fulfilled, a song has fallen silent, Mr. Vajpayee said, adding: “The dream was of a world free of fear and hunger; the song a great epic resonant with the spirit of the Gita and the fragrance of a rose.” Yet, the man who had admirers across the political divide — and who said there should be “ matbhed ” (difference of opinion) but not “ manbhed ” (personal differences) in politics — was also known for his sharp ideological speeches. In 1977, as External Affairs Minister, Mr. Vajpayee addressed the UN General Assembly in Hindi. In the 1990s, as a rising BJP sought a face acceptable to allies, Mr. Vajpayee returned as the party’s prime leader, delivering one unforgettable speech in Parliament after another. Particularly appealing was his speech when his government could not garner a majority in 1996 and fell in 13 days. Before dramatically announcing that he was going to the President to resign, Mr. Vajpayee defended his decision to try to form a government and said the Opposition was a disparate lot trying to put in place a lame duck government. He said the BJP had the highest number of Dalit MPs, arguing that the BJP’s support base was deep. His speeches – which the House heard in rapt attention – were not without humour. Once Ram Vilas Paswan took a jibe at a rising BJP by saying he too was “Ram”; Mr. Vajpayee said: “ Aap Ram to hain, par vilasi Ram hain ” (You are Ram, but a Ram given to pleasure). When Somnath Chatterjee was taking charge as the Lok Sabha Speaker in 2004, he said while the veteran leader came from Bolpur, his present post was not one where he would be able to talk ( bol ) a lot.",
"description": "The long political career of Atal Bihari Vajpayee is marked by one unique facet: his mesmerising oratory in Hindi that touched friends and foes alike. While he stayed Prime Minister for six years — from 1998 to 2004 — his long parliamentary stint was marked by sharp oratory laced with humour. The older Prime Minister Vajpayee was more guarded and spoke with pauses, unlike the younger fiery orator Vajpayee. Arguably the best Hindi orator Parliament has ever seen, he held people in rapt attention from the 1950s to the 1990s. Mr. Vajpayee first entered Parliament in 1957 from Balrampur in Uttar Pradesh, in what was to be the first of his 10 Lok Sabha terms. Yet he made a mark, despite his party, the Jana Sangh, being insignificant at that time. Hearing him speak, India’s first Prime Minister Jawaharlal Nehru is believed to have told a visiting foreign dignitary of the young MP’s immense promise, saying that he could be Prime Minister one day.",
"time_scraped": "2018-08-17 04:53:35.376760",
"article_id": "24710175",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/5gbzr4/article24710174.ece/ALTERNATES/FREE_1080/TH17KRAORATOR",
"path": "full/f9676970ed1a8efd6fbe6578d9a7c16d97e03369.jpg",
"checksum": "f21c72e8658838bcbf66202376cced43"
}
]
}