{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-the-foreign-minister-the-many-milestones-in-his-foreign-policy/article24710255.ece",
"title": "Atal Bihari Vajpayee, the Foreign Minister: The many milestones in his foreign policy - The Hindu",
"date_published": "2018-08-17T01:18:09+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/myi9i1/article24710254.ece/ALTERNATES/FREE_1080/VAJPAYEE"
],
"article_body": "Nuclear tests in May 1998, a peace-making bus ride to Lahore in February 1999, the Kargil war a couple of months later, a transformative visit to China in June 2003 and a peace deal with Pervez Musharraf in January 2004 stand out in Prime Minister Atal Bihari Vajpayee’s foreign and security policy calendar. After the nuclear tests, the United States and China came together to mount unprecedented pressure on India and it took all the guile that Mr. Vajpayee and his advisers possessed to break this nexus and begin a tango with the U.S. that continues to this day. The ensuing dialogue even led to an American request for India to send its troops to Iraq, a request that was declined after much consideration in July 2003. With Pakistan, Mr. Vajpayee made two roller-coaster efforts at peace – one with Nawaz Sharif and the second with Pervez Musharraf. He also responded to infiltration in Kargil and ordered a massive mobilisation of Indian troops after the 2001 attack on Parliament House before agreeing to a peace deal with General Musharraf in Islamabad. After Pakistan downed two Indian MiG aircraft during the Kargil conflict, there was enormous pressure on Mr. Vajpayee to respond in kind, which he resisted, a decision that won him much acclaim abroad. Eventually, the U.S. intervened and Pakistan had to vacate Indian positions in Kargil. The failed Agra summit in 2001 didn’t dampen his efforts for peace. In January 2004, Gen. Musharraf committed to India that he would not allow Pakistani territory to be used by terrorists. With China, he put in place the Special Representatives’ mechanism in June 2003 on the border question and bought enough goodwill from the Chinese to make them change their maps from showing Sikkim as an “independent kingdom” to a constituent unit of India. The overall improvement in ties with China has led to major expansion of trade between the two countries – from about $6 billion in 2003 to $84 billion in 2017. A point of interest is that Manmohan Singh, who succeeded him as Prime Minister, continued India’s engagement with China, Pakistan and the United States. The trajectory of ties with all three was strikingly similar under Dr. Singh. Mr. Vajpayee was widely travelled and enjoyed his contacts with Indians living overseas. As The Hindu ’s diplomatic correspondent, this writer accompanied him on many trips abroad and faced trying moments in reporting his Hindi speeches, which were almost always peppered with elements of ambiguity. There was always a press conference at the end of his visits abroad – either on board his special aircraft or on the ground. Mr. Vajpayee was easy with the press despite the many crises he faced. Without doubt, his PMO was one where the press enjoyed the most access.",
"description": "Nuclear tests in May 1998, a peace-making bus ride to Lahore in February 1999, the Kargil war a couple of months later, a transformative visit to China in June 2003 and a peace deal with Pervez Musharraf in January 2004 stand out in Prime Minister Atal Bihari Vajpayee’s foreign and security policy calendar. After the nuclear tests, the United States and China came together to mount unprecedented pressure on India and it took all the guile that Mr. Vajpayee and his advisers possessed to break this nexus and begin a tango with the U.S. that continues to this day. The ensuing dialogue even led to an American request for India to send its troops to Iraq, a request that was declined after much consideration in July 2003. With Pakistan, Mr. Vajpayee made two roller-coaster efforts at peace – one with Nawaz Sharif and the second with Pervez Musharraf. He also responded to infiltration in Kargil and ordered a massive mobilisation of Indian troops after the 2001 attack on Parliament House before agreeing to a peace deal with General Musharraf in Islamabad. After Pakistan downed two Indian MiG aircraft during the Kargil conflict, there was enormous pressure on Mr. Vajpayee to respond in kind, which he resisted, a decision that won him much acclaim abroad. Eventually, the U.S. intervened and Pakistan had to vacate Indian positions in Kargil. The failed Agra summit in 2001 didn’t dampen his efforts for peace. In January 2004, Gen. Musharraf committed to India that he would not allow Pakistani territory to be used by terrorists.",
"time_scraped": "2018-08-17 04:53:34.959282",
"article_id": "24710255",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/myi9i1/article24710254.ece/ALTERNATES/FREE_1080/VAJPAYEE",
"path": "full/f5b39b289e9b8b85b6f7853fd3456d9688e2f021.jpg",
"checksum": "6bb2e4099c45ac8f880fb4f3769250e7"
}
]
}