{
"source_article_link": "https://www.thehindu.com/news/national/atal-bihari-vajpayee-funeral-south-asia-united-in-grief-in-attendance-at-smriti-sthal/article24719836.ece",
"title": "Atal Bihari Vajpayee funeral: South Asia united in grief, in attendance at Smriti Sthal - The Hindu",
"date_published": "2018-08-18T00:03:40+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/vedyze/article24719835.ece/ALTERNATES/FREE_1080/TH18KRAFUNERALNEW"
],
"article_body": "The King of Bhutan, Jigme Khesar Namgyel Wangchuck, and special envoys from the South Asian neighbours led the diplomatic delegation at the funeral of former Prime Minister Atal Bihari Vajpayee in New Delhi on Friday. Foreign Minister of Nepal Pradeep Gyawali, Pakistani Minister of Justice Syed Ali Zafar, Foreign Minister of Bangladesh Abul Hassan Mahmud Ali, and former President of Afghanistan Hamid Karzai were among those who attended the last rites at Smriti Sthal. President Vladmir Putin of Russia extended his condolences on the demise of the leader and remembered Vajpayee for his ‘personal contribution’ to India-Russia bilateral ties. “He will be remembered as a politician who made a great personal contribution to the development of friendly relations between our countries and the development of Russian-Indian highly privileged strategic partnership,” the Russian leader said in a letter to Prime Minister Narendra Modi. Atal Bihari Vajpayee (1924-2018): A storied career with poetic flourishes Mr. Karzai sat through the funeral alongside Sri Lankan Foreign Minister Lakshman Kiriella and met a cross section of dignitaries in attendance. Speaking to The Hindu , Mr. Karzai said, “Mr. Vajpayee had a very straightforward and strong policy with Afghanistan. He was the first to offer us civilian planes, Airbuses at the time we were starting out.” Mr. Karzai was the first Afghan President to work with Prime Minister Vajpayee after the fall of the Taliban in 2001. External Affairs Minister Sushma Swaraj welcomed the visiting dignitaries before the funeral began at 4 p.m. as messages poured in from the global capitals. President of Sri Lanka Maithripala Sirisena said in his message that Vajpayee was a “true friend of Sri Lanka”. The Bangladesh Foreign Minister Abul Hassan Mahmud Ali conveyed personal condolences from Prime Minister Sheikh Hasina to Ms. Swaraj. Ms. Hasina described Mr. Vajpayee as one of the “most famous sons of India”, said, “Shri Atal Bihari Vajpayee was our great friend and highly respected in Bangladesh.” Nepal’s Prime Minister K.P. Sharma Oli extended condolences, and said that in Vajpayee’s death, Nepal had lost a “true friend and well-wisher.” Nepal’s Foreign Minister handed over Mr. Oli’s letter of condolence to Indian officials.",
"description": "King of Bhutan and special envoys from the South Asian neighbours lead the diplomatic delegation at the funeral.",
"time_scraped": "2018-08-18 06:03:13.869056",
"article_id": "24719836",
"article_category": "National",
"image_details": []
}