{
"source_article_link": "https://www.thehindu.com/news/national/irdai-asks-insurers-to-settle-claims-in-flood-ravaged-kerala-expeditiously/article24720384.ece",
"title": "IRDAI asks insurers to settle claims in flood-ravaged Kerala expeditiously - The Hindu",
"date_published": "2018-08-18T01:03:54+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "The Insurance Regulatory and Development Authority of India (IRDAI) has directed all insurance companies to initiate immediate steps for quick registration and disposal of claims in Kerala. “The recent floods have caused immense loss to life and property in Kerala. There is an urgent need for us to take immediate steps to mitigate the hardships of the affected insured population by ensuring immediate registration and settlement of eligible claims,” a directive issued by member (non-life) P.J. Joseph said. Detailing the measures needed, the IRDAI asked general and health insurers to nominate a senior officer to act as the nodal officer for the State for coordinating and expediting the settlement of all eligible claims reported. It also directed the companies to ensure that all claims are surveyed immediately and claim payments/on account payments are disbursed early. The IRDAI directed that adequate number of surveyors be engaged in the affected districts and extensive awareness campaigns launched about the measures. All non-life insurers, including standalone health insurers, have been asked to submit information relating to insurance claims in Kerala on a daily basis. ‘Chennai floods’ In another communication, on guidelines on settlement of life insurance claims, the IRDAI said that “with regard to claims involving loss of life, where difficulty is experienced in obtaining a death certificate due to non-recovery of body, etc., the process followed in the case of Chennai floods in 2015 may be considered.” The regulator wanted the insurance companies to consider a “suitably simplified process/procedure, including relaxations in the usual requirements wherever feasible... to expedite claims settlement.” It asked the life insurers to submit a progress report on the claims settled on a weekly basis every Monday for data up to the last working day of the previous week. In doing so, they need to furnish details related to the Pradhan Mantri Jeevan Jyoti Bima Yojana (PMJJBY) claims data separately.",
"description": "The insurance regulator has directed general and health insurers to nominate a senior officer to act as the nodal officer for the State for coordinating and expediting the settlement of all eligible claims reported",
"time_scraped": "2018-08-18 06:03:13.514988",
"article_id": "24720384",
"article_category": "National",
"image_details": []
}