{
"source_article_link": "https://www.thehindu.com/news/national/supreme-court-for-lower-storage-at-mullaperiyar/article24720653.ece",
"title": "Supreme Court for lower storage at Mullaperiyar - The Hindu",
"date_published": "2018-08-18T01:23:25+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/tamil-nadu/yvx07w/article24704755.ece/ALTERNATES/FREE_1080/MULLAPERIYAR"
],
"article_body": "The Supreme Court on Friday suggested that the disaster management sub-committee, the National Crisis Management Committee (NCMC) and the supervisory panel monitoring the Mullaperiyar dam in flood-hit Kerala hold meetings to explore ways to reduce the water level in the reservoir to 139 feet. It said every step should be taken to give advance warning to the people in the downstream areas before water is released. The court said Kerala should follow the instructions iss-ued by the NCMC on resc- ue and rehabilitation, whi-le Tamil Nadu should “scrupulously” comply wi-th any instruction to bring down the level of the dam. The next hearing is scheduled for August 24. A Bench comprising Chief Justice of India Dipak Misra and Justice D.Y. Chandrachud was hearing a petition filed by Russel Joy, a resident of Idukki district where the dam is located. Mr. Joy, represented by advocate Manoj George, highlighted that the water level in the dam was dangerously high and a source of constant fear for people in an “already submerged Kerala.” The petitioner urged the court to hand over the dam to the National Executive Committee under the Disaster Management Act, 2005, to avert another tragedy. On Thursday, the court had directed that these committees meet on Friday with the authorities of Kerala and Tamil Nadu to see if the water level could be brought down to at least 139 feet. On Friday, Additional Solicitor General P.S. Narasimha, appearing for the Centre, read out a text message he had received about the meeting held earlier in the day among the committees and competent authorities from Tamil Nadu and Kerala, who joined in via video conferencing. The meeting resolved to reduce the water level in the dam in a phased manner, he said. ‘Trust the experts’ Mr. Narasimha asked the court to place its trust on the experts on the ground. “You (Supreme Court) just have to trust them. They are monitoring the situation 24X7 on a minute-by-minute basis,” he submitted. He said a supervisory committee of experts was watching the water levels of the Mullaperiyar dam “day in and day out” in consultation with both Tamil Nadu and Kerala governments. At one point, Tamil Nadu counsel and senior advocate Shekhar Naphade said the floods were an “act of God”. He said the release of water would cause even more havoc. The apex court said judges were no experts to frame a disaster management plan or measure the dangers of water levels in Mullaperiyar dam. Chief Justice Misra said the court left it entirely in the hands of the Centre, Kerala and Tamil Nadu governments to resolve the issues concerning the floods and release of water from the 123-year-old dam. “We are leaving it to the executive. What can we do now? The idea is to resolve the calamity and rescue and rehabilitate people caught in the floods,” Chief Justice Misra observed. The flood situation, rescue and rehabilitation work is being monitored at the highest level under the NCMC headed by the Union Cabinet Secretary, Mr. Narasimha submitted. “Let us deal with the situation in every possible way,” Chief Justice Misra said. Lauds Kerala govt. The Bench, however, refrained from interfering with the ongoing work of the Centre and the Kerala government to contain the natural disaster and save lives. It commended the Kerala government for its “immense efforts” to rescue people trapped in floods. The court further directed the Kerala Chief Secretary to file an affidavit about the steps taken for disaster management, rescue and rehabilitation. Chief Justice Misra reached out to the people of Kerala whose lives have been swept away by the floods while urging the Centre and the Kerala government to resolve the calamity with “humaneness, focus and requisite efficiency”. “This is a crisis and we want everyone to wake up to the situation,” Chief Justice Misra observed orally. Empathising with the suffering of the people of Kerala, Chief Justice Misra said, “You have never faced such a calamity”.",
"description": "T.N., Kerala to follow NCMC instructions.",
"time_scraped": "2018-08-18 06:03:09.099217",
"article_id": "24720653",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/tamil-nadu/yvx07w/article24704755.ece/ALTERNATES/FREE_1080/MULLAPERIYAR",
"path": "full/a55dd6c9ba02ade86a1e553507bd41b9d83b6fa3.jpg",
"checksum": "2a02c95d6f596af2eb4a1d7857c0b14d"
}
]
}