{
"source_article_link": "https://www.thehindu.com/news/national/civic-bodies-can-raise-more-funds-smart-cities-mission-director-kunal-kumar/article24720557.ece",
"title": "Civic bodies can raise more funds: Smart Cities Mission Director Kunal Kumar - The Hindu",
"date_published": "2018-08-18T01:16:28+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/hcvcui/article24720556.ece/ALTERNATES/FREE_1080/TH18CITY"
],
"article_body": "“When we talk about Smart Cities, there are three main components: an improved quality of life, a robust economy leading to job creation, and sustainability built into every aspect. But we cannot improve what we cannot measure,” said Smart Cities Mission Director Kunal Kumar, explaining that a city-level GDP calculation would help give shape to the economic indicators needed. “National GDP is a well-established process, but we have so far not had city-level GDP in India.” City-level GDP data, he said, could help municipal bodies make better decisions on needed infrastructure and investment, and also leverage their economic strength to raise funds to finance their needs. Mr. Kumar pointed out that the Pune municipal corporation — which he headed till recently — had been able to raise ₹200 crore in municipal bonds at a respectable 7.59% rate, but could have aimed higher given that its annual budget is well over ₹4,000 crore. “That ambition to raise funds from the market will come once they start benchmarking their economies,” he said. One of the aims of the Smart Cities Mission has been to increase the share of municipal financing of infrastructure projects. The EIU has recommended a top-down approach based on sectoral income data for the calculation of city-level GDP as it would balance detail and resource-effectiveness in the long term. However, it acknowledges that the data requirements may be too challenging and a top-down approach using household expenditure data may be more feasible in the short term. The Centre now has to take a call on which approach to use, and which Ministry will carry out the process.",
"description": "City-level GDP data will help them make better decisions, says official.",
"time_scraped": "2018-08-18 06:03:10.547243",
"article_id": "24720557",
"article_category": "National",
"image_details": []
}