{
"source_article_link": "https://www.thehindu.com/news/national/kerala-rains-too-little-say-cpim-cong-on-pms-relief/article24726992.ece",
"title": "Kerala rains: Too little, say CPI(M), Cong. on PM’s relief - The Hindu",
"date_published": "2018-08-18T21:41:17+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/duhxfu/article24726991.ece/ALTERNATES/FREE_1080/18THRDFLOODPROTEST-01"
],
"article_body": "Both the CPI(M) and the Congress said on Saturday that the ₹500 crore relief announced by Prime Minister Narendra Modi was too little in the face of absolute devastation in Kerala due to unprecedented floods. “Kerala has suffered a loss of nearly ₹20,000 crore. The State had sought an immediate assistance of ₹2,000 cr. from the Centre. What Modi has given is grossly insufficient for urgent rescue, relief and rehabilitation work,” CPI(M) general secretary Sitaram Yechury said. Mr. Modi on Saturday announced an immediate financial assistance of ₹500 crore to Kerala after reviewing the flood situation in the state. This is in addition to ₹100 crore announced by Home Minister Rajnath Singh on August 12. Mr. Modi also announced an ex-gratia of ₹2 lakh per person to the next of kin of the deceased and ₹50,000 to those seriously injured from the Prime Minister’s National Relief Fund, a statement from the Prime Minister’s Office said. ‘National disaster’ The Congress has been demanding that the floods in Kerala be declared a national calamity. “Dear PM please declare Kerala floods a National Disaster without any delay. The lives, livelihood and future of millions of our people is at stake,” party president Rahul Gandhi tweeted. The issue also came up during a meeting of Mr. Gandhi with party leaders. “We believe Modi ji should stop discriminating in matters of flood relief between BJP and non-BJP governments,” Congress general secretary Randeep Surjewala said. “It was also decided that the Congress president and all Congress MPs and MLAs and MLCs across India will donate one month’s salary, which will be sent through the AICC for relief measures,” Mr. Surjewala added.",
"description": "Modi announced interim assistance of ₹500 crore",
"time_scraped": "2018-08-19 00:48:42.556388",
"article_id": "24726992",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/duhxfu/article24726991.ece/ALTERNATES/FREE_1080/18THRDFLOODPROTEST-01",
"path": "full/5cbf4168771b2a52734d7f0dc8058c06def86c1e.jpg",
"checksum": "c48a72bd06982dc4b77baa51e078c0db"
}
]
}