{
"source_article_link": "https://www.thehindu.com/news/national/pakistan-minister-syed-ali-zafars-message-would-have-left-vajpayee-happy/article24720134.ece",
"title": "Pakistan Minister Syed Ali Zafar’s message would have left Vajpayee happy - The Hindu",
"date_published": "2018-08-18T00:30:48+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/9vfqt3/article24720131.ece/ALTERNATES/FREE_1080/ALIZAFAR"
],
"article_body": "The decision to send a Pakistani delegation to attend former Prime Minister Atal Bihari Vajpayee’s funeral was taken by “all stakeholders” including Prime Minister-designate Imran Khan, said visiting acting Law and Information Minister Syed Ali Zafar. “This was an occasion where all felt that Pakistan must be present and share your grief,” Mr. Zafar, who is part of the caretaker government demitting office, said in an interview to The Hindu . Positive move “A very positive move and hopes of a thaw came during Mr. Imran Khan’s speech after the election and then the call by the Indian Prime Minister Narendra Modi [to congratulate Mr. Khan] changed the mood positively.” Mr. Zafar met External Affairs Minister Sushma Swaraj, one of the very few meetings she has had with Pakistani officials since her visit to Islamabad in December 2015, after which the Pathankot airbase attack derailed ties. The External Affairs Ministry spokesperson said the two leaders had remembered a “visionary (Vajpayee) who dreamed [of a] terror-free and prosperous subcontinent,” a reference to India’s demand that Pakistan end support to terror groups. Recites poem Speaking to journalists after the meeting, Mr. Zafar, who recited Mr. Vajpayee’s poem from his visit to Lahore in 1999, “ Jung nahin hone denge (We won’t allow a war)”, also said that he hoped there would be other “less sad” meetings when “[India-Pakistan] issues, including Jammu and Kashmir, will be resolved through dialogue.” Asked if tensions between the two countries had been discussed in his meeting with Ms. Swaraj, Mr. Zafar replied, “This was not the occasion to discuss issues of a political nature.” “Our meeting was positive, and I sensed a feeling from both sides that there could be progress, and I hope that in the coming days we could see more such meetings and progress,” Mr. Zafar, who flew back to Islamabad on Friday night, added.",
"description": "Visiting acting Law and Information Minister says there is a thaw in India-Pakistan relations.",
"time_scraped": "2018-08-18 06:03:06.971598",
"article_id": "24720134",
"article_category": "National",
"image_details": []
}