{
"source_article_link": "https://www.thehindu.com/news/national/hanan-hanai-pays-it-forward/article24727122.ece",
"title": "Kerala rains: Hanan pays it forward - The Hindu",
"date_published": "2018-08-18T21:56:45+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/hlcztf/article24543866.ece/ALTERNATES/FREE_1080/28kihun03--cybeG824EILIS3jpgjpg"
],
"article_body": "Hanan, the 19-year-old girl from Kerala who was recently both appreciated and trolled on the social media for posting photographs of her life’s challenges, has donated ₹1.5 lakh for flood relief in the State. Hanan, who received ₹1.5 lakhs from well-wishers after a photograph of her selling fish to support her family and fund her education went viral, said: “The people of the State had turned up to help me when I told my story. These were donations from ordinary people, from ₹50 to ₹1,000 or more that came into my account, making it ₹1.5 lakh. In this time of crisis, I want to give it back to them who had sent their love through money.” . Hanan transferred the amount to the Chief Minister’s Disaster Relief Fund on Saturday. “We had been trying to transfer the funds for the past two days, but could not do it due to network issues. Today we went to the bank and got it done”. When asked about how she would restart her small business, Hanan said she would wait till the crisis was over. “Across the State, people have to rebuild their lives after this disaster. I would too.”",
"description": "19-year-old student donates 1.5 lakh she had received as aid",
"time_scraped": "2018-08-19 00:48:27.628559",
"article_id": "24727122",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/hlcztf/article24543866.ece/ALTERNATES/FREE_1080/28kihun03--cybeG824EILIS3jpgjpg",
"path": "full/d7fadd3c82efe2329a95753de56932191a7318f4.jpg",
"checksum": "11aa57decd31912598682721f4ad7859"
}
]
}