{
"source_article_link": "https://www.thehindu.com/news/national/modi-recalls-annans-role-in-pushing-development-goals/article24726521.ece",
"title": "Modi recalls Annan’s role in pushing development goals - The Hindu",
"date_published": "2018-08-18T20:05:44+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [
"https://www.thehindu.com/news/national/9993r9/article24727060.ece/ALTERNATES/FREE_1080/Annan%20Kalamjpg"
],
"article_body": "Nobel Peace Laureate and former United Nations Secretary General Kofi Annan was “a conscience keeper of international peace and security”, said Prime Minister Narendra Modi, as many Indian leaders expressed condolences over Mr. Annan’s death on Saturday. “Mr. Kofi Annan’s significant contribution to the Millennium Development Goals will always be remembered,” Mr. Modi added in a tweet referring to Mr. Annan, who set up a foundation to work on the two issues of climate change and poverty reduction, which he called the “twin pillars of sustainable development”. Indian diplomats remembered Mr. Annan’s tenure at the helm of the United Nations (1997-2006) as a time when India’s efforts for Security Council expansion were taken forward, and for his support to Indian peacekeepers when he was Under Secretary General for Peacekeeping prior to that. “He was always appreciative of the humane approach of Indian peacekeepers in Africa,” remembers India’s Permanent Representative to the United Nations Syed Akbaruddin. “He was also an ardent advocate of reform of the Security Council and a greater role for developing countries such as India,” Mr. Akbaruddin told The Hindu .",
"description": "Annan pushed for UNSC reforms, say diplomats",
"time_scraped": "2018-08-19 00:48:43.469357",
"article_id": "24726521",
"article_category": "National",
"image_details": [
{
"url": "https://www.thehindu.com/news/national/9993r9/article24727060.ece/ALTERNATES/FREE_1080/Annan%20Kalamjpg",
"path": "full/9daf4fd9d17fba3e103dd619e2971cbed6ff7a49.jpg",
"checksum": "3b7a0db2efd6da1b5f1cb8ae8a8e0ad3"
}
]
}