{
"source_article_link": "https://www.firstpost.com/india/mandsaur-agitation-poppy-husk-smuggling-lack-of-technical-knowledge-plague-opium-farmers-in-madhya-pradesh-4498135.html",
"title": "Mandsaur agitation: Poppy husk smuggling, lack of technical knowledge plague opium farmers in Madhya Pradesh",
"date_published": "2018-06-06T13:14:12+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/WhatsApp-Image-2018-06-06-at-10.52.09-AM.jpeg",
"https://images.firstpost.com/wp-content/uploads/2018/06/WhatsApp-Image-2018-06-06-at-10.52.09-AM-1.jpeg",
"https://images.firstpost.com/wp-content/uploads/2018/06/mandsaur1-e1528267020648.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/06/mandsaur2-300x300.jpg"
],
"article_body": "\" (the plight of Mandsaur does not begin or end with the incident that took place last year, and this reality can make or break a government),\"said Bhagat Singh Borana, a of the Bharatiya Kisan Union, whichisfighting for farmers' rights in all 51 districts of Madhya Pradesh. Borana was referring to the clashes on 6 June, 2017 , during whichsix farmers were killed after the police opened fire on the protestersseekingfair crop prices. The incident had sparked violent demonstrations, which later spread to the neighbouring districts. The protestswerequelled after the central government deployed more than 1,100troopers from the anti-riot force and 600 Rapid Action Force personnel. Last month, the Bharatiya Kisan Union tried to bring to the government's noticethe obstacles opium farmers in Madhya Pradesh face in improving their yield and obtaining licences to cultivate the crop during the suitable season. They also mentioned how cases of , orpoppy husk,smuggling has risen sincethe government stopped procuring the crop residue from farmers in 2015. In a letter handed to Chief Minister of Madhya Pradesh Shivraj Singh Chouhan on 30 May, the unionpointed out that opium costs around Rs 800 to Rs 2,275 per kilogram, but theprice is declared as Rs 3 lakh in the cases registered when the administration seizes smuggled opium. As a result, the organisation — which has5,000 representatives in Mandsaur alone — has appealed to the state government to raise the cost of the crop toRs 10,000 per kilogram and also compensate farmers with this amount for the last five years of production. The Bharatiya Kisan Union’s letter to Chief Minister of Madhya Pradesh Shivraj Singh Chouhan lists problems of opium farmers in Mandsaur. Image Courtesy: Pallavi Rebbapragada Poppy husk smuggling The farmers' union, in their note to the chief minister, have highlighted the rise in smuggling of poppy husk,which is the husk left behind after the opium is extracted from the pods. They mentioned how young men are sent to prison for smuggling the crop residue. Mandsaur Superintendent of Police Manoj Kumar Singh explained thatuntil 2015, there was a licensing policy for poppy husk.Since the government stopped procuring poppy husk from farmers, its smuggling has risen, and youngsters are convicted under the Narcotic Drugs and Psychotropic Substances Act, 1985,for smuggling both opium and its derivatives, which include poppy husk. \"A kilogram of poppy husk was sold for nearly 1,000,\" Singh told . \"Today, it is smuggled in large quantities, and if the smuggled quantity is more than 50 kilograms, the punishment is quite rigorous.\"The senior police officer added that in eight districts, there are nearly 50 registered cases of opium and its derivatives under the Narcotic Drugs and Psychotropic Substances Act, 1985. “Last year, 300-400 people were in jail,” he said. Mukesh Patidar, a member of the Bharatiya Kisan Union who works in Mandsaur's Billod village, said 70 percent of those arrested are between 18 to 30 years old. He gave a recent example of theNahargarh Police in Sitamau Tehsil arrestingfour men and seizing 110 kilograms of poppy husk. The farmer also said that last year, in Khunti village in Malhargarh tehsil, a young man was caught smugglingeight quintals and 40 kilograms of the crop. In March, the chief minister had assured farmers of Neemuch and Mandsaur that the Madhya Pradesh government would procure poppy husk from the cultivators and burn it, and that the farmers would not incur any loss in the process. In Madhya Pradesh, the Narcotics Control Bureau has given permission to cultivate the crop in Mandsaur, Ratlam, Ujjain, Rajapur, Neemuch, Jhabua and Agar Malwa. GN Pande, a Krishi Vigyan Kendra scientist and opium researcher in Mandsaur, told that poppy husk also has alkaloids and can be used for commercial purposes if the government invests ininfrastructure and conducts research on storage. Research centres in Mandsaur, Udaipur, Faizabad and Lucknow carry out varietal trials in opium poppy. Land allocation delays Rajesh Patidar and his family at their opium farm in Badhuniya, Mandsaur district. Image Courtesy: Pallavi Rebbapragada In their letter to the chief minister, the farmers' union also urged the government to allocate cultivable land for opium production earlier in the year as delaying itpushes the harvest into the summer, which leads to a thin yield. The Central Bureau of Narcotics issues licences to eligible cultivators in October, and the general conditions togrant these licences are finalised between September and October. As a result,the licensing process and settlement of the accounts of previous seasons goes on even inOctober, and the measurement and testing of licensed fields continues tillthe third week of December. “This delays the yield and pushes it to March end, when summer sets in, and this results in a thin plant,” rued Rajesh Patidar, a farmer from a family in Mandsaur's Badhuniya village, explaining thatthis delay results in an opium extract of just about one gram per plant. The farmer also said that the government has a target of 60 kilograms per hectare but offers only Rs 800 to Rs 1,000 per kilogram, which is not enough to cover the labour cost. He revealed that this year, he had received Rs 1o,500 from the government for his produce, while he had had to pay labourersnearly Rs 28,ooo only to monitor the crucial ripening days of the crop. Lack of technical know-how Opium farmers use an assortment of pesticides due to lack of know-how. Image Courtesy: Pallavi Rebbapragada Sandeep Patidar has a similar story. An opium farmer who holds licenses for two half-bigha plots, he confessed that he does not know which pesticides to use for the crop.Holding out an assortment of pesticides he tries at random, he said he ends up killing his plant becausehe doubleshis usageif the yield is good.The opium farmer believes thatlack of awareness about the application of new and evolving techniquesis oneof the main reasons for the averageor below average yields of most licensedcultivators. Furthermore, farmerssuch as Mahendra Patidar from Mandsaur's Suwarsa Tehsil said opium farmers bear the cost of licensing and taking precautionary measures to prevent smuggling and other wrongdoing around the crop. In the 90-day growth cycle of the poppy plant, opium is produced only in the 10 to 12 days when the pod is ripening and is slowly extracted in the form of a congealed milky latex. As elaborated on the Central Bureau of Narcotics website, \"the latex that oozes out of the capsule is collected by the cultivator on a daily basis, and the weight of such opium is recorded in a register called the preliminary weighment register maintained by the village \". According to Mahendra Patidar, the process goes on for 20 to 25 days and requires precision and skilled labour. He highlighted how farmers are unaware about which grade their produce falls into. They find out about thequality of their own yield only after theDistrict Opium Officer examines and oven tests the produce and classifies itunderdifferent grades as per the consistency of the opium. Elaborate and strict rules around licensing and smuggling will not resolve the distress the farmers are in, a fact the union hopes to convey to the government with their letter.",
"description": "\" (the plight of Mandsaur does not begin or end with the incident that took place last year, and this reality can make or break a government),\"said Bhagat Singh Borana, a of the Bharatiya Kisan Union, whichisfighting for farmers' rights in all 51 districts of Madhya Pradesh. Borana was referring to the clashes on 6 June, 2017",
"time_scraped": "2018-08-17 14:40:30.991145",
"article_id": "4498135",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/WhatsApp-Image-2018-06-06-at-10.52.09-AM.jpeg",
"path": "full/c2f273fbd5f970f39b5bd437dc7160606a34241e.jpg",
"checksum": "76b4e2329cc5fed4494796efaf5a86b8"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/WhatsApp-Image-2018-06-06-at-10.52.09-AM-1.jpeg",
"path": "full/99fd68dc5f72cbcb6c5c05de7c582c92d1f7738c.jpg",
"checksum": "a6e9a8194a9ca4653fc84c1fbeeade9c"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/mandsaur1-e1528267020648.jpg",
"path": "full/cdaaae7da172d7eb23543bbf0aa872de11d4bdea.jpg",
"checksum": "4b3fd77d9ec9e6cb81224ba2c40d8d73"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/mandsaur2-300x300.jpg",
"path": "full/53153efb9170635595e80516151bb0b43eccc092.jpg",
"checksum": "a7f80534d3179126d587d2d1909f127f"
}
]
}