{
"source_article_link": "https://www.firstpost.com/world/shangri-la-dialogue-narendra-modis-balancing-act-between-india-and-china-on-security-other-key-takeaways-4499201.html",
"title": "Shangri-La Dialogue: Narendra Modi's balancing act between India and China on security, other key takeaways",
"date_published": "2018-06-06T19:06:10+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/Modi-in-China4_PTI.jpg"
],
"article_body": "On Friday, Narendra Modi delivered the keynote address at the Shangri-La Dialogue (SLD) in Singapore, the first time an Indian prime ministerspoke at the SLD since its inaugural edition in 2002. The SLD has, over the years, evolved into a key strategic gathering of the Asia-Pacific region. In his address, Modi advocated free sea and air lanes, connectivity and upholding international rules and norms.He also expressed India’s eagerness to make ‘Indo-Pacific’ as the defining factor for new security architecture in Asia, while describing the new geography of Indo-Pacific as a “natural region” ranging “from the shores of Africa to that of the Americas\". The prime minister also insisted that a “stable, secure and prosperous Indo-Pacific Region” is an “important pillar” of India’s strategic partnership with the US.The US is equally passionate about the Indo-Pacific. The emphasis shown by the Donald Trump administration on the ‘Indo-Pacific’ can be termed as its most momentous strategic initiative towards India, as this Firstpost piece points out. Modi calls for 'equal access' to shared maritime area Modi called for countries to have \"equal access\" to shared maritime and air spaces, and for regional disputes to be settled under international law. File image of Prime Minister Narendra Modi and Chinese president Xi Jinping. PTI In a speech at the start of a security summit in Singapore, Modi described his vision of nations across the Asia-Pacific region forging closer security and economic ties. Although the prime minister did not single Beijing out for direct criticism, he referred to China's military buildup in the South China Sea and its sweeping territorial claims across the strategic waterway. \"We should all have equal access, as a right under international law, to the use of common spaces on the sea and in the air,\" Modi told the Shangri-La Dialogue. \"That would require freedom of navigation, unimpeded commerce, and peaceful settlement of disputes in accordance with international law. When we all agree to live by that code, our sea lanes will be pathways to prosperity and corridors of peace,\" he said. India and its regional role are taking centre stage at this year's summit as nations look to counter China's inexorable military rise, and as Washington puts new emphasis on its military ties to New Delhi and the increasing importance of the Indian Ocean in US strategic thinking. The Pentagon is renaming its oldest and largest military command to reflect India's growing significance. From now on, the storied US Pacific Command, or PACOM, will be known as the Indo-Pacific Command. Modi referred to the need to respect the sovereignty and territorial integrity of all countries, \"irrespective of size and strength\", in another apparent reference to China's actions in the region. Still, his remarks were inclusive overall, coming after he met with Chinese president Xi Jinping in an April summit where both leaders promised to reduce border tensions after a standoff in the Himalayas last year. Troops from both sides had come eyeball-to-eyeball in the disputed DokaLa plateau in June 2017 when Chinese soldiers started building a road and India sent troops to halt the process. A crisis was averted two months later when both nuclear-armed nations pulled back. Manoj Joshi, a distinguished fellow at the Delhi-based Observer Research Foundation, told that ultimately what matters most is how much India is ready to stake in the Indo-Pacific concept, politically and militarily. \"India has a reputation of talking big, but delivering little,\" Joshi said \"No matter what he says, the issue is not about international law or trade disputes, but about raw power– China's growing power and the effort of the regional states to contain it under the leadership of the US.\" China welcomes Modi's remarks China, meanwhile, welcomed Modi's \"positive remarks\" on India-China relations at the Shangri-La Dialogue and expressed willingness to work with India to follow the consensus between the leadership of the two countries to maintain the momentum in the bilateral ties. The prime minister had said that both India and China have displayed \"maturity and wisdom\" in managing issues and ensuring a peaceful border, adding cooperation between the world's two populous countries was expanding. Welcoming Modi's remarks at a media briefing, Chinese Foreign Ministry spokesperson, Hua Chunying said, \"We have noted the positive remarks made by Modi on China-India relations. We highly appreciate such kind of positive remarks.\" Recalling the informal summit between Modi and Jinping at Wuhan in April this year, Hua said, \"They had in-depth exchange of views on the international landscape and bilateral relations and reached many consensuses.\" \"The two sides agreed to adopt a mature and wise way to properly handle differences,\" she said. \"China is willing to work with the Indian side to follow the guidance of this consensus to maintain the positive momentum of the development of bilateral relations, to promote mutually beneficial cooperation, properly handle differences, maintain peace tranquillity along the border areas and thus move forward the China-India relations,\"Hua said. Modi andJinping had met in April in an unprecedented two-day 'heart-to-heart' summit in the central Chinese city of Wuhan to \"solidify\" the India-China relationship after the Dokalam standoff last year. Troops of India and China were locked in the 73-day standoff in Dokalam after the Indian side stopped the construction of a road by the Chinese army in the disputed area. Mattis accuses China of 'intimidation and coercion' China's military buildup in the South China Sea and its deployment of high-end weapons systems in the disputed waterway is designed to intimidate and coerce neighbours, US defence secretary Jim Mattis said, speaking at the high-profile security summit in Singapore. The Pentagon chief also said the US military continues to support diplomats pushing for the \"complete, verifiable and irreversible\" denuclearisation of the Korean peninsula. Mattis said Beijing had deployed a range of military hardware– including anti-ship missiles, surface-to-air missiles and electronic jammers -- across the South China Sea, where it has built islets and other maritime features into hardened military facilities. Beijing has also landed heavy bombers on Woody Island in the Paracel Islands. \"Despite China's claims to the contrary, the placement of these weapon systems is tied directly to military use for the purposes of intimidation and coercion,\" Mattis told the Shangri-La Dialogue. China slams US' 'irresponsible comments' A Chinese general on Saturday lashed out at \"irresponsible comments\" on Beijing's military build-up in the South China Sea after the US defence chief accused China of intimidation and coercion in the disputed waters. \"Any irresponsible comments from other countries cannot be accepted,\" Lieutenant General He Lei said at the Shangri-La Dialogue. It came just hours after Mattis told the security summit that China's military build-up and deployment of weapon systems in the contested sea was aimed at intimidating its neighbours. Beijing has deployed a range of military hardware including anti-ship missiles, surface-to-air missiles and electronic jammers across the South China Sea, where it has built islets and other maritime features into hardened military facilities. China has also landed heavy bombers on Woody Island in the Paracel Islands. The Chinese general, however, said Beijing's actions were aimed at \"national defence\". \"They are for the purpose of avoiding being invaded by others... As long as it is on your own territory you can deploy the army and you can deploy weapons,\" he said. China claims most of the resource-rich sea, through which $5 trillion in shipping trade passes annually, with competing claims from Brunei, Malaysia, the Philippines, Taiwan and Vietnam.",
"description": "On Friday, Narendra Modi delivered the keynote address at the Shangri-La Dialogue (SLD) in Singapore, the first time an Indian prime ministerspoke at the SLD since its inaugural edition in 2002. The SLD has, over the years, evolved into a key strategic gathering of the Asia-Pacific region. In his address, Modi advocated free sea and air lanes, connectivity and upholding international rules and norms.He also expressed India’s eagerness",
"time_scraped": "2018-08-17 14:40:19.547089",
"article_id": "4499201",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/Modi-in-China4_PTI.jpg",
"path": "full/a12478151ed8c8026910494af06d13c4fdf4fee8.jpg",
"checksum": "5956535229ae3b7edd103d7ac1db6877"
}
]
}