{
"source_article_link": "https://www.firstpost.com/india/sco-summit-india-refuses-to-endorse-chinas-belt-and-road-initiative-as-part-of-qingdao-declaration-4504619.html",
"title": "SCO summit: India refuses to endorse China's Belt and Road Initiative as part of Qingdao Declaration",
"date_published": "2018-06-10T19:47:06+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/SCO_Modi.png"
],
"article_body": "Qingdao: India was the only country in the eight-nation Shanghai Cooperation Organisation grouping which opposed China's ambitious Belt and Road Initiative with Prime Minister Narendra Modi asserting that any mega connectivity project must respect sovereignty and territorial integrity of the countries. Prime Minister Narendra Modi, left, shakes hands with Pakistan president Mamnoon Hussain, right, next to Chinese president Xi Jinping, center, after a joint press conference for the Shanghai Cooperation Organization (SCO) Summit in Qingdao in eastern China's Shandong Province on Sunday. AP A declaration signed by leaders of the Shanghai Cooperation Organisation (SCO) countries, including Modi, at the end of a two-day summit of the bloc said Russia, Pakistan, Kazakhstan, Uzbekistan, Kyrgyzstan and Tajikistan have been \"reaffirming\" their support for China's Belt and Road Initiative (BRI). In his address at the summit, Modi, in a clear reference to the BRI, said any mega connectivity project must respect sovereignty and territorial integrity of the countries and assured that India will support projects which ensure inclusivity. \"Connectivity with the neighbouring countries is India's priority. We welcome the connectivity projects which are sustainable and efficient and which respect territorial integrity and sovereignty of the countries,\" he said. India has been severely critical of the BRI, the pet project of Chinese president Xi Jinping, as the $50 billion China Pakistan Economic Corridor (CPEC), which is part of the BRI, passes through Pakistan-occupied Kashmir (PoK). India says it cannot accept a project that ignores its core concerns on sovereignty and territorial integrity. Modi, in presence of Xi and Russian president Vladimir Putin, said India's commitment to connectivity projects was reflected in its involvement in the International North South Corridor project, development of the Chabahar port and Ashgabat agreement. China had unveiled the BRI in 2013 with an aim to link Southeast Asia, Central Asia, the Gulf region, Africa and Europe with a network of land and sea routes.President Xi has already announced that China would invest around $126 billion for the project. However, there has been suspicion among several countries that the main aim of the project is to expand China's influence globally. According to Chinese officials, around 80 countries and international organisations have already inked pacts with Beijing for the ambitious project. \"The Member States express appreciation for the joint efforts taken towards its implementation, including efforts to coordinate the development of the Eurasian Economic Union and the BRI and call for using the potential of the regional countries, international organisations and multilateral associations to create a broad, open, mutually beneficial and equal partnership in the SCO space,\" said the declaration on the BRI. It said the SCO member countries pointed out the potential of coordinating international, regional and national development projects and strategies for stimulating cooperation in the interests of economic development based on the principles of respect, equality and mutual benefit. In his address, Pakistani president Mamnoon Hussain whole-heartedly supported the BRI, saying it was boosting Pakistan's economy. The International North–South Transport Corridor (INSTC) is a 7,200-km-long multi-mode transport project for moving freight among India, Iran, Afghanistan, Armenia, Azerbaijan, Russia, Central Asia and Europe. Ashgabat agreement is a transport agreement among several Gulf and Central Asian countries which is aimed at creating a transit corridor to spur trade and investment. India has been supporting the project.",
"description": "Qingdao: India was the only country in the eight-nation Shanghai Cooperation Organisation grouping which opposed China's ambitious Belt and Road Initiative with Prime Minister Narendra Modi asserting that any mega connectivity project must respect sovereignty and territorial integrity of the countries. Prime Minister Narendra Modi, left, shakes hands with Pakistan president Mamnoon Hussain, right, next to Chinese president Xi Jinping, center, after a joint press conference for the Shanghai Cooperation Organization (SCO) Summit in Qingdao in eastern China's Shandong Province on Sunday. AP A declaration signed by leaders of the Shanghai Cooperation Organisation (SCO) countries, including Modi, at the end of a two-day summit of the bloc said Russia, Pakistan, Kazakhstan, Uzbekistan, Kyrgyzstan and Tajikistan have been \"reaffirming\" their support for China's Belt and Road Initiative (BRI). In his address at the summit, Modi, in a clear reference to the BRI, said any mega connectivity project must respect sovereignty and territorial integrity of the countries and assured that India will support projects which ensure inclusivity.",
"time_scraped": "2018-08-17 14:40:41.682539",
"article_id": "4504619",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/SCO_Modi.png",
"path": "full/263e678979f5753caa0223f3e815862a09c80e58.jpg",
"checksum": "232033b125ab435f9ec892b007232e6e"
}
]
}