{
"source_article_link": "https://www.firstpost.com/india/scos-qingdao-declaration-india-refuses-to-endorse-xi-jinpings-obor-as-part-of-statement-full-text-4504521.html",
"title": "SCO's Qingdao Declaration: India refuses to endorse Xi Jinping's OBOR as part of statement; full text",
"date_published": "2018-06-11T09:34:13+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/SCO_Modi.png"
],
"article_body": "The leaders of the Member States of the Shanghai Cooperation Organisation (hereinafter referred to as the SCO or the Organisation), following the meeting of the Council of Heads of State in Qingdao on 10 June 2018, hereby declare the following. The dynamically developing world is currently going through a period of major changes and reconfiguration; the geopolitical landscape is becoming diversified and multipolar, and ties between countries are becoming closer. Prime Minister Narendra Modi with Pakistan President Mamnoon Hussain along withChinese President Xi Jinping at the SCO Summit in Qingdao in eastern China's Shandong Province on Sunday. AP At the same time, the factors of instability and uncertainty are increasing, the situation in the world economy remains unstable despite the positive changes, economic globalisation is confronted with the expansion of unilateral protectionist policies and other challenges in international trade, and the risks associated with the aggravation of conflicts in a number of regions, terrorism, drug trafficking and organised crime, epidemics of infectious diseases and climate change are also on the rise. Counteraction to these global challenges requires urgent development of collective and effective approaches of the world community. Following the Shanghai Spirit, which embodies mutual trust, equality, mutual benefit, equal rights, mutual consultations, respect for the diversity of cultures, and aspiration for joint development, amid fundamental changes in global affairs, the SCO consistently enhances political, security, economic, cultural and humanitarian cooperation and acts as one of the most influential participants in the modern system of international relations. Relying on neighbouurly relations, friendship and cooperation, mutual respect for the cultural and civilisational diversity and social values of its Member States, on trustful dialogue and constructive partnership, the SCO sets an example of close and fruitful cooperation in building a more equitable and balanced world order based on an equal, cooperative, indivisible, comprehensive and sustainable security, ensuring the interests of each and every state in accordance with the norms and principles of international law. The Member States reaffirm their commitment to the goals and objectives stipulated in the SCO Charter and the SCO Development Strategy Towards 2025 by consistently developing the political, security, trade and economic, financial, investment, transport, energy, agricultural and humanitarian cooperation, promoting the construction of international relations of a new type based on mutual respect, justice, equality, mutually beneficial cooperation, and the formation of a common vision of building a community for the shared future of humankind. I The Member States will continue to deepen multifaceted cooperation for peace, stability, development and prosperity in the SCO space. In this regard, they, supporting the efforts of the countries of the Central Asian region to intensify cooperation in the political, economic, cultural, humanitarian and other spheres, welcome the results of the first consultative meeting of the heads of state of Central Asia (Astana, 15 March 15 2018). The Member States note the new quality and dynamics that have emerged in various fields of cooperation since the Republic of India and the Islamic Republic of Pakistan’s accession to the SCO. They intend, based on strict observance of international treaties and SCO documents, to jointly promote the further expansion of the Organisation's potential in all areas of its activities. The Member States reaffirm their readiness to increase cooperation with observer states and partners in the SCO dialogue on a mutually beneficial and equitable basis, to enhance the contacts and interaction of the SCO with the UN and its specialised bodies, and with other international and regional organisations. II The Member States are committed to strict compliance with the goals and principles of the UN Charter, primarily the equality and sovereignty of states, non-interference in their internal affairs, mutual respect of territorial integrity, the inviolability of borders, non-aggression, a peaceful settlement of disputes, the non-use of force or threat of force, and other universally recognised norms of international law aimed at the maintenance of peace and security, the development of cooperation among states, the strengthening of independence, the right of nations to determine their future and to choose their political, socioeconomic and cultural path. The Member States reaffirm their resolve to strictly comply with the provisions of the Treaty on Good-Neighbourly Relations, Friendship and Cooperation between the Member States of the Shanghai Cooperation Organisation (Bishkek, 16 August 2007) aimed at the further development of neighbourly and friendly relations in areas of mutual interest, including to turn mutual borders into borders of lasting peace and friendship. The Member States reaffirm their resolve to support the efforts of the UN as a universal multilateral organisation to maintain international peace and security, stimulate global development, and promote and protect human rights. They are committed to strengthening the key role of the UN Security Council as the main body responsible under the UN Charter for maintaining international peace and security. The Member States have taken note of the intention of the Republic of Kyrgyzstan and the Republic of Tajikistan to seek the position of non-permanent members of the UN Security Council. The Member States will continue to work together in the area of disarmament and arms control, peaceful use of nuclear energy, and political and diplomatic settlement of challenges to nonproliferation regimes. The Member States that are signatory to the Non-Proliferation Treaty are committed to strict compliance with NPT provisions, a comprehensive and balanced encouragement of NPT goals and principles, the promotion of the global non-proliferation regime and nuclear disarmament with due regard for the entirety of international stability factors, as well as stimulating equal and mutually beneficial cooperation in the peaceful use of nuclear energy. The Member States believe that an early enforcement of the Protocol on Security Assurances to the Treaty on a Nuclear-Weapon-Free Zone in Central Asia by all signatory states will be a major contribution to regional security and the global non-proliferation regime. The Member States reaffirm that unilateral unrestricted build-up of missile defence systems by individual countries or groups of countries will damage international security and destabilise the global situation. They consider it unacceptable to strengthen one’s security to the detriment of other’s security. The Member States point out the importance of keeping space free of weapons and support the practical measures to prevent an arms race in space. They welcome the resolution of the UN General Assembly Disarmament and International Security Committee on further practical measures for the prevention of an arms race in outer space and the creation of a group of governmental experts to prepare and submit proposals for an international legally binding instrument on the prevention of an arms race in outer space, which would prohibit the placement of weapons in outer space. The Member States support the efforts and initiatives designed to stimulate strict compliance with the Chemical Weapons Convention, enhance the prestige of the Organisation for the Prohibition of Chemical Weapons and strengthen the regime stipulated in the Convention on the Prohibition of the Development, Production and Stockpiling of Bacteriological (Biological) and Toxin Weapons and on Their Destruction. The Member States strongly condemn all forms of terrorism and consider it necessary to make efforts to promote the creation of a unified global counterterrorism front with the central coordinating role of the UN on the basis of international law, without politicisation or double standards. They confirm the key role of the state and its competent agencies in counteracting terrorism, separatism and extremism on its territory, as well as in relevant cooperation within the SCO and in international formats. The Member States stand for reaching consensus on the issue of adopting the UN Comprehensive Convention on International Terrorism based on the UN Charter and other documents. They emphasise the importance of comprehensive measures to reach a peaceful settlement of international and regional conflicts, enhance efforts against terrorism and its ideology, the detection and elimination of factors and conditions that facilitate terrorism and extremism, acknowledging that there can be no justification of any act of terrorism or extremism. They praise the initiative of the Republic of Kazakhstan to launch the Code of Conduct in International Anti-Terrorist Operations in the UN format. The Member States note that the interference in the domestic affairs of other states under the pretence of combatting terrorism and extremism is unacceptable, as well as the use of terrorist, extremist and radical groups for one’s own purposes. The Member States call for effectively fulfilling the requirements of specialised UN Security Council resolutions as regards efforts to counter any forms of financing terrorism and providing material and technical support to it; the measures include finding individuals and legal entities involved in economic relations with terrorists. In relation to the developments in the Middle East, the Member States note the growing threat from foreign terrorists who return to their countries or find shelter in third countries to continue their terrorist and extremist activity within the SCO. The Member States will work to improve the information exchange mechanisms regarding these people and their movements, and speed up procedures to extradite foreign terrorists in accordance with the national legislation of the SCO Member States and boost international cooperation both on the political level and between the security services. The Member States praise the initiative of the Republic of Uzbekistan on the adoption of a special General Assembly resolution Education and Religious Tolerance, which it proposed at the 72nd Session of the UN General Assembly in September 2017 in New York. The Member States confirm the special role of the SCO Regional Anti-Terrorist Structure in the joint fight against “the three evils” – terrorism, extremism and separatism – in order to ensure regional security, and will boost the potential of cooperation between competent agencies in this area. Considering the growing scale and mutual interconnectedness of threats to security, they noted the importance of the further improvement of the RATS SCO, including considering the organisation of a monitoring system of possible threats in the global information space, and counteracting them. The implementation of the cooperation programme to fight terrorism, separatism and extremism for 2019-2021 will be prioritised. It is considered important to speed up the coming into effect of the SCO Convention on Countering Extremism, signed on 9 June 2017 in Astana. The Member States praise the results of the international conference on countering terrorism and extremism (Dushanbe, 3-4 May 2018), which became an important venue for multilateral cooperation in these areas. The Member States will continue to conduct regular joint anti-terrorist exercises, including the Peace Mission antiterrorism military exercise. They will continue to expand their cooperation in defence and security, on security issues for major events, and the training of personnel to enhance the capabilities of their respective armed forces and competent services. The Member States reaffirm their concern about the risk of weapons of mass destruction ending up at the disposal of terrorist groups; they advocate the strengthening of the international legal framework to counter this threat and support the initiative to draft an international convention against chemical and biological terrorist attacks at the Conference on Disarmament. The Member States will strengthen their cooperation in combating the spread and propagation of terrorist ideology through the internet, including publicly justifying terrorism, recruiting members to terrorist groups, inciting and financing terrorist attacks, and online tutorials on methods of committing terrorist acts. They very much appreciate the Xiamen-2017 anti-cyber terrorism exercise held in China in 2017, aimed at curbing the use of the internet for terrorist, separatist and extremist purposes. The Member States have noted the importance of combining the efforts of the international community in countering attempts to involve young people in the activities of terrorist, separatist and extremist groups. In this regard, they have adopted the Joint Appeal to Youth, in which they put forth the intention to organise comprehensive educational work as well as the spiritual and moral education of the younger generation in the SCO. The Member States express concern about the growing threat from increased production, trade and abuse of drugs, and the use of proceeds from drug trafficking as a source of financing terrorism. They emphasise the need to develop a joint and balanced approach to countering illegal trafficking in drugs and their precursors, including through the internet. In this regard, the Member States welcome the adoption of the SCO Anti-Drug Strategy for 2018-2023 and the Programme of Action for its implementation, as well as the Concept for the Prevention of the Abuse of Narcotic Drugs and Psychotropic Substances at the summit. The Member States reaffirm their commitment to the existing international system to combat illegal drug trafficking on the basis of the norms and principles of international law, the relevant UN conventions and SCO documents. In this context, they gave a positive assessment of the joint SCO and UN Office on Drugs and Crime event, the UN and the SCO in the Fight Against Narcotic Drugs: New Threats and Joint Actions, on 12 March 2018 in Vienna. The Member States have reaffirmed their readiness to continue improving the mechanism of cooperation within the SCO to combat illegal drug trafficking at the level of the heads of the competent authorities, senior officials and expert working groups, to conduct joint operations on a regular basis to curb illegal trafficking of narcotic drugs, psychotropic substances and their precursors, to take effective measures to prevent the spread of synthetic drugs, and new psychoactive substances. They approved the outcome of the Meeting of the Heads of the SCO Counter-Narcotics Agencies (Tianjin, 17 May 2018). The Member States intend to continue exchanging information on individuals involved in terrorist activities and joint investigation of terrorist crimes of a transnational nature through effective border control under the Agreement on Cooperation and Interaction of the Member States of the Shanghai Cooperation Organisation on Border Issues (Ufa, 10 July 2015) to prevent the activity and cross-border movement of foreign terrorists and terrorist groups. The Member States call on the international community to put more effort into creating a peaceful, secure, open and structured information space based on cooperation. They emphasise the central role of the UN in developing universal international rules and principles as well as norms for countries’ responsible behaviour in the information space and advocate the establishment of a working mechanism within the framework of the UN based on a just geographical distribution in order to develop standards, rules or principles for countries’ responsible behaviour in the information space and to formalise them by adopting the corresponding UN General Assembly resolution. The Member States are convinced that all states should participate equally in internet development and governance. A governing organisation established to manage key internet resources must be international, more representative and democratic. The Member States will continue to promote practical cooperation in countering threats and challenges in the information space based on the Agreement among the Governments of the SCO Member States on Cooperation in the Field of Ensuring International Information Security (Yekaterinburg, 16 June 2009), such as international cooperation in IT abuse, including for terrorist and criminal purposes, and call for developing an international legal document on countering IT use for criminal purposes under the auspices of the UN. The Member States note that corruption, as a threat to national and regional security, in all its forms and manifestations leads to less effective public administration, adversely affects investment appeal and hampers socioeconomic progress. They express their intention to develop comprehensive international cooperation in anti-corruption activities, including through the sharing of experience and information. The Member States affirm their intention to develop practical cooperation in the legal and judicial areas by developing and approving approaches to exchanging expertise, methods to carry out forensic investigations and improving the skills of forensic experts. They advocate the establishment of a contractual legal framework on legal assistance to individuals and legal entities in civil cases, including trade and criminal cases in the framework of the SCO by adopting a corresponding SCO convention that will also envisage the participation of observer states if they comply with all the obligations under the convention. The Member States consider it important to give impetus to contact and cooperation between legislative agencies and political parties, as well as to exchange expertise in the area of state governance and development. The Member States praised the SCO missions to observe presidential and parliamentary elections and referendums. III The Member States advocate political and diplomatic settlement of the conflict situations in various regions of the world within the fundamental norms and principles of international law, in the interests of global security and stability. The Member States support the efforts of the government and people of the Islamic republic of Afghanistan to provide security, ensure economic development, to counteract terrorism, extremism, and drug crimes. The Member States believe that establishing peace and stability in Afghanistan and an economic restoration will promote the security and sustainable development of the region as a whole. The member states emphasise that there is no alternative to settling the situation in Afghanistan beyond political dialogue and an inclusive peace process by the Afghan people themselves and under their guidance, and call for boosting cooperation under a central coordinating role of the UN for ensuring stability and development of the country. The Member States noted the results of the SCO-Afghanistan Contact Group meetings that took place on 11 October 2017 in Moscow and on 28 May 2018 in Beijing, and spoke in favour of activating the mechanisms for dialogue and cooperation on an Afghanistan settlement, including consultations in the Moscow format. The Member States welcomed the outcome of the International High-Level Conference on Afghanistan, Peace Process, Security Cooperation and Regional Connectivity that took place in Tashkent on 27 March 2018, as an important and positive contribution to the process of restoring peace and stability in the country. The Member States confirm that the implementation of an inclusive political process, under the direction of the Syrian people and by the Syrian people themselves, which must be conducted in accordance with the provisions of UNSC Resolution 2254 and proceed from the need for Syrian sovereignty, independence and territorial integrity, is the only alternative to settling the Syrian crisis. The Member States support the peace talks in Geneva under the auspices of the UN, note the efficiency of the Astana process, and call for all the parties to the conflict to take practical steps to implement the Memorandum on establishing the de-escalation areas to create favourable conditions for a political settlement of the situation in Syria. In this connection, the Member States welcomed the results of the Syrian National Dialogue Congress that took place on 30 January 2018 in Sochi as an important contribution to the promotion of the political process in Syria. The Member States oppose the use of chemical weapons anywhere, by anyone, under any circumstances and for any goals, and support holding, under the provisions of the Chemical Weapons Convention, a comprehensive, unbiased and objective investigation into chemical attacks and drawing conclusions based on reliable and trustworthy evidence that can stand up to scrutiny. The Member States deem it important to consistently implement the Joint Comprehensive Plan of Action on the Iranian nuclear programme, and call for participants to strictly observe their obligations with a view to ensuring its full and efficient implementation and promoting peace and stability in the region and globally. The Member States advocate the settlement of the situation on the Korean Peninsula solely through a political and diplomatic approach based on dialogue and consultations. They support the peace initiatives of the international community, including those of Russia and China, aimed at the normalisation of the situation, including the denuclearisation of the Korean Peninsula, and securing long-term peace in Northeast Asia. In this context, the Member States note the resumption of the intra-Korean dialogue, as well as the contact between the Democratic People's Republic of Korea and the United States, and urge all involved parties to support the negotiating process. The Member States confirm the need for a political settlement of the Ukraine crisis based on the prompt and full implementation of the Minsk Agreements of 12 February 2015. IV The Member States stand for the improvement of the architecture of global economic governance and the development of trade, economic and investment cooperation. They proceed from the belief that the World Trade Organisation is the key platform for discussing the agenda for international trade and adopting the rules of a multilateral trade system. In order to maintain the reputation and efficiency of the WTO rules, the Member States stand for the joint forming of an open world economy, the consecutive strengthening of an open, inclusive, transparent, nondiscriminative and multilateral trade system based on rules, as well for the prevention of fragmentation of international trade relations and rejection of any forms of trade protectionism. The Member States stand for creating favourable conditions for trade and investment in order to gradually introduce free movement of goods, capitals, services and technologies, as stipulated by the SCO Charter. In this relation, a Joint Statement of SCO Member States for Streamlining Trade Procedures has been adopted. The Member States believe that the development of the services industry and trade, the support of microbusiness, as well as small and medium-sized business and stimulation of e-trade within the SCO are very important for the development of the economy, and the growth of employment and prosperity of the population. The Member States stand for the further development of a legal and contractual basis in these areas. The Member States confirm their adherence to the central role of the UN in promoting the implementation of the Global Agenda for Sustainable Development. They urge the developed countries, in accordance with the obligations assumed earlier, to provide financial and technical assistance to the developing countries and help them boost their potential. The Member States emphasise the importance of deepening regional economic cooperation in order to ensure their sustainable social and economic development, including through the use of the potential of the United Nations Economic and Social Commission for Asia and the Pacific in the key areas of its activity, including transport, energy, trade and IT. They stress the need to implement the relevant SCO documents aimed at developing regional economic cooperation. In this connection, the Member States note the results of the SCO Business Forum held on 6 June 2018 in Beijing with the participation of the SCO business communities, observers and dialogue partners, and supported the planned hosting of the International Import Expo in November 2018 in Shanghai. The Member States note the importance of cooperation between the scientific, research and analytical centres of the SCO Member States on economic issues. The Member States are in favour of further strengthening practical cooperation in banking and finance, including for the purpose of studying the prospects of expanding the use of national currencies in trade and investment. They noted the relevance of boosting exchanges in financial control and management, interaction in the balanced macroeconomic governance and control over financial agencies in order to provide easy access and fair conditions for financial structures and service networks. In order to finance the implementation of joint SCO projects, the Member States are boosting interaction within multilateral banking and financial organisations operating in the region, including the SCO Interbank Consortium, the Asian Infrastructure Investment Bank, the New Development Bank, the Silk Road Fund, the China-Eurasia Economic Development Fund and others. The Member States will continue to look for common approaches to creating the SCO Development Bank and the SCO Development Fund. The Member States note the importance of promoting multilateral cooperation in transportation and increasing the transit and communications potential of the region, including by building new and upgrading existing sections of international transport routes, by developing road and rail systems, including fast highways, by creating multimodal logistics centres, by introducing cutting-edge and innovation technology, by simplifying and enhancing the standards of automation in border, customs, sanitary and other systems used to control the movement of goods across the Member States’ borders, and also by implementing joint infrastructure projects. In this context, the Member States note the importance of implementing the Intergovernmental Agreement on International Road Transportation Facilitation (Dushanbe, 12 September 2014) and of the continued efforts to draft a programme for road development in the SCO Member States. The Member States support the initiative to hold the first meeting of the heads of the SCO Member States’ rail administrations in Uzbekistan aimed at promoting transport accessibility and connectivity. The Member States welcome the High-Level Special Event of the SCO and UNESCAP, titled Towards Regional Transport Connectivity (Bangkok, 23 November 2017). The Member States welcome the creation of the SCO Heads of Region Forum to promote interregional cooperation and take note of the proposal to hold the forum’s first meeting in Chelyabinsk, the Russian Federation, in 2018. The Member States point out the potential of coordinating international, regional and national development projects and strategies for stimulating cooperation in the interests of economic development based on the principles of respect, equality and mutual benefit, for encouraging investment and transport ties, promoting energy cooperation, strengthening the agricultural industry, introducing innovation and ensuring employment in the SCO space. Reaffirming their support for the Belt and Road Initiative (BRI) of the People’s Republic of China, the Republic of Kazakhstan, the Kyrgyz Republic, the Islamic Republic of Pakistan, the Russian Federation, the Republic of Tajikistan and the Republic of Uzbekistan, the Member States express appreciation for the joint efforts taken towards its implementation, including efforts to coordinate the development of the Eurasian Economic Union and the BRI and call for using the potential of the regional countries, international organisations and multilateral associations to create a broad, open, mutually beneficial and equal partnership in the SCO space. The Member States emphasise the importance of promoting and deepening mutually beneficial cooperation and the exchange of knowledge, information and best practices in the area of information and communication technology, including digital technology, to the benefit of economic and social development of the SCO Member States. Keeping in mind the importance of preserving an environmental balance in the SCO space and restoring biodiversity in the interests of future generations, and creating favourable conditions for people’s lives and sustainable development, the Member States have adopted the Concept for SCO Member States’ Cooperation in Environmental Protection. The Member States highly assess the initiative of the Republic of Tajikistan, which has been declared by UN General Assembly Resolution 71/222 of 21 December 2016 as International Decade for Action on Water for Sustainable Development (2018-2028). They welcome the holding of a High-level International Conference on the Water Action Decade under UN auspices (Dushanbe, 20-22 June 2018). They call for supporting the draft resolution of the 73rd Session of the UN General Assembly on a midterm review of the implementation of the Decade, which is aimed at facilitating the attainment of sustainable development goals and tasks in the sphere of water management. The Member States express a willingness to stimulate exchanges and cooperation to prevent and combat cross-border epidemic outbreaks of animal diseases, provide access to quality agricultural products and use quarantine for purposes of food security. They emphasise the need to take practical measures towards this end, including the drafting of a programme of cooperation in this area. The Member States call for strengthening cooperation in innovation activities. They point out the importance of coordinating the SCO Member States’ approaches in innovation politics, including the creation of an innovative ecosystem, technology platforms, innovation clusters and high-tech companies, and by implementing joint innovation projects. The Member States stress the crucial significance of the further development of cooperation in customs, agriculture and telecommunications, as well as in micro-, small and medium-sized business. The Member States will work consistently to tap the potential of the SCO Business Council and SCO Interbank Consortium (SCO IBC) in order to implement joint projects in finance, high-technology, transport and communication infrastructure, energy and investment. In this context, the Member States welcome the efforts of the SCO IBC to attract new members. V The Member States will continue their productive bilateral and multilateral cooperation in culture, education, science, technology, healthcare, tourism, crafts, environmental protection, youth exchanges, the media and sport for the sake of mutual enrichment and closer relations between people. Based on the Agreement Between the Governments of the SCO Member States on Cooperation in Culture, which was signed in Bishkek on 16 August 2007, the Member States will continue to facilitate the development of cultural ties within the SCO, as well as better mutual understanding between people with more respect for the cultural traditions and customs of the Member States; preserve and encourage cultural diversity; hold international festivals and competitions; expand ties between musicians, theatres, artists, film-makers, archives, museums and libraries; and also develop cooperation in studying and preserving the nature and cultural heritage of the entire region, including along the historical Great Silk Road. In keeping with the above, the Member States praise the decision to hold the 3rd World Nomads’ Games in the Kyrgyz Republic in September 2018. The Member States also noted the importance of holding the events under The SCO: Our Common Home project at the SCO Secretariat, as well as open days, conferences and roundtable discussions that involve youth. The Member States welcome the signing of the Memorandum of Understanding and Cooperation Between the SCO Secretariat and UNESCO, which reflects the aspiration of these international organisations to develop constructive cooperation in the humanitarian area, including with the aim of raising awareness of culture and cultural achievements, as well as the historical heritage of the SCO Member States. The Member States hail the work of the International Congress of Women from the SCO and BRICS countries that was held in Novosibirsk on 2-4 July 2017, and the Women and the SCO forum held in Beijing on 15-17 May 2018, pointing to good prospects for this area of cooperation. The Member States will encourage media cooperation and in connection with this note the SCO Media Forum held in Beijing on 1 June 2018. The Member States, while acknowledging the importance of sport as an effective factor in promoting dialogue between people of different countries, believe that sport should be separated from politics. They believe that the upcoming 2018 FIFA World Cup in Russia, the international Wushu competition in Chongqing on 18-19 May 2018, regular SCO marathons, and International Yoga Day held annually will contribute to stronger friendship, peace, mutual understanding and harmony. The Member States continue to implement the Agreement Between the Governments of the SCO Member States on Cooperation in Education in order to expand education exchanges and jointly prepare highly skilled personnel. Based on the principle of mutual respect, the SCO Member States will further develop practical cooperation in teacher and student exchages, joint scientific work, academic visits, foreign language-learning courses, professional education and youth exchanges. The Member States point to the need to cooperate in various areas, such as building the potential for fast response in emergency healthcare; ensuring the sanitary and epidemiological safety of the population; fighting against the distribution of counterfeit medical products; countering the spread of infectious diseases; preventing and monitoring chronic diseases; conventional medicine and pharmaceutics; medical education and research; implementing joint programmes for promoting global development; medical service and medical staff exchanges; ensuring safety and high quality food in order to jointly protect public health; providing incentives for the development of healthcare; and promoting innovative cooperation. *** The Member States highly appreciate the results of China’s SCO Presidency in 2017-2018, which have contributed to promoting mutual trust and mutual understanding, constructive and fruitful cooperation, neighbourly relations and friendship between people in the SCO Member States. The Member States will continue to develop constructive dialogue, expand, as partners, their multifaceted cooperation in order to effectively resolve regional and global issues in the interests of enhancing political and economic stability and building a fair and equitable world order. Prime Minister, Republic of India Narendra Modi President, Republic of Kazakhstan Nursultan Nazarbayev President, People’s Republic of China Xi Jinping President, Kyrgyz Republic Sooronbay Jeenbekov President, Islamic Republic of Pakistan Mamnoon Hussain President, Russian Federation Vladimir Putin President, Republic of Tajikistan Emomali Rahmon President, Republic of Uzbekistan Shavkat Mirziyoyev Qingdao, 10 June 2018. Shanghai Cooperation Organisation website",
"description": "The leaders of the Member States of the Shanghai Cooperation Organisation (hereinafter referred to as the SCO or the Organisation), following the meeting of the Council of Heads of State in Qingdao on 10 June 2018, hereby declare the following. The dynamically developing world is currently going through a period of major changes and reconfiguration; the geopolitical landscape is becoming diversified and multipolar, and ties between countries are becoming closer. Prime Minister Narendra Modi with Pakistan President Mamnoon Hussain along withChinese President Xi Jinping at the SCO Summit in Qingdao in eastern China's Shandong Province on Sunday. AP At the same time, the factors of instability and uncertainty are increasing, the situation in the world economy remains unstable despite the positive changes, economic globalisation is confronted with the expansion of unilateral protectionist policies and other challenges in international trade, and the risks associated with the aggravation of conflicts in a number of regions, terrorism, drug trafficking and organised crime, epidemics of infectious diseases and climate change are also on the rise. Counteraction to these global challenges requires urgent development of collective and effective approaches of the world community. Following the Shanghai Spirit, which embodies mutual trust, equality, mutual benefit, equal rights, mutual consultations, respect for the diversity of cultures, and aspiration for joint development, amid fundamental changes in global affairs, the SCO consistently enhances political, security, economic, cultural and humanitarian cooperation and acts as one of the most influential participants in the modern system of international relations.",
"time_scraped": "2018-08-17 14:40:16.567255",
"article_id": "4504521",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/SCO_Modi.png",
"path": "full/263e678979f5753caa0223f3e815862a09c80e58.jpg",
"checksum": "232033b125ab435f9ec892b007232e6e"
}
]
}