{
"source_article_link": "https://www.firstpost.com/india/chinas-proposed-trilateral-meet-with-india-pakistan-fraught-with-dangers-for-new-delhi-could-leave-it-outnumbered-4539021.html",
"title": "China's proposed trilateral meet with India, Pakistan spells danger for New Delhi, could leave it outnumbered",
"date_published": "2018-06-19T10:29:56+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/Narendra-Modi-Xi-Jinping-new_380_AP.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/06/India-Pakistan-flags_380_Reuters.jpg"
],
"article_body": "Beijing's proposal on Monday for a trilateral summit meeting of India, Pakistan and China is fraught with danger for India. On crucial matters, this sort of trilateral arrangement will surely become two versus one — or at least two close friends strategising behind the scenes. For, both China and Pakistan have repeatedly stated that they consider the other as their most trusted friend, and that theirs is the deepest sort of strategic relationship. Since the suggestion includes a reference to solving border issues, the future of Jammu and Kashmir will surely be foremost on the agenda of both China and Pakistan. While making the suggestion, the Chinese ambassador pointedly spoke of avoiding another Doka La type confrontation—a reference that could be read as a tacit threat, or at least coercion. China has repeatedly called CPEC the 'flagship project' of President Xi Jinping's signature One Belt and One Road initiative. China has vouchsafed investments totalling near $80 billion in Pakistan under the aegis of CPEC. File image of Prime Minister Narendra Modi and Chinese President Xi Jinping. AP Indeed, if one were to take an insightful and long view of the relationship between the three countries, it would be clear that moves, events and trends in Kashmir, and by both China and Pakistan, since 2008 have inexorably led up to this proposal.Tragically, India's security and intelligence analysts and policymakers neglected what was afoot. Damaging United Nations report This suggestion for a trilateral comes close on the heels of a report on Kashmir by the UN High Commissioner for Human Rights. The government is right to hold that the report contains unverified facts. But whether verified or not, these assertions now have the stamp of authority. They are part of a UN report There is every possibility that some countries will take note of it. A few will latch onto it enthusiastically. Some may even refer to it at the UN General Assembly session this September. Turkey and Iran have already publicly raised concerns about the situation in Kashmir. Turkish President Recep Tayyip Erdogan spoke of the issue on the eve of an official visit to New Delhi last year. \"We should not allow more casualties to occur, and by strengthening multilateral dialogue, we can be involved, and through multilateral dialogue, I think we have to seek out ways to settle this question once and for all,\" Erdogan had said in an interview to WION TV. If China should choose to push the issue, it could quite easily press a large number of countries to take it up. China's huge investment commitments, estimated at $750 billion, give it tremendous leverage in almost every region of the world. Let us keep in mind that Jordan is among the several countries in which China has undertaken several debt-laden projects. The High Commissioner for Human Rights who issued this report is from Jordan. Multi-faceted developments Representational image. Reuters Various elements of the situation regarding Kashmir must be analysed in tandem. Militancy within the Valley, public demonstrations, shelling on the Line of Control, and infiltration by foreign militants all form the backdrop for the events unfolding in the world of diplomacy and geopolitics. Domestic politics in light of impending general elections are another vital factor. The most basic fact is that the ground situation is worsening steadily. There were extensive stone-pelting demonstrations across the Valley even after the Eid prayers on Saturday. Severalteenagers have gone underground in south Kashmir during the month of Ramzaan, which ended on 16 June. Several hundred militants now roam the place as part of one or other of half-a-dozen radically Islamist groups. In addition, a large number of foreign militants, who belong to various groups, are billeted in various parts of Kashmir, including the north of the Valley. To complicate the situationfurther, the annual Amarnath Yatra is set to begin on 28 June, and will last till 26 August. This will severely strain the security forces, since they will have to secure the pilgrims even while tracking and combating the militants. An attack on the Yatra could prove politically costly for the government, more so at a time when general elections are less than a year away. Policymakers must urgently look at the unfolding situation in strategic terms rather than just as a question of how much force to apply. Several strands of the currently unfolding developments point to an unprecedented challenge ahead.",
"description": "Beijing's proposal on Monday for a trilateral summit meeting of India, Pakistan and China is fraught with danger for India. On crucial matters, this sort of trilateral arrangement will surely become two versus one — or at least two close friends strategising behind the scenes. For, both China and Pakistan have repeatedly stated that they consider the other as their most trusted friend, and that theirs is the deepest sort of strategic relationship. Since the suggestion includes a reference to solving border issues, the future of Jammu and Kashmir will surely be foremost on the agenda of both China and Pakistan. While making the suggestion, the Chinese ambassador pointedly spoke of avoiding another Doka La type confrontation—a reference that could be read as a tacit threat, or at least coercion.",
"time_scraped": "2018-08-17 14:40:16.828273",
"article_id": "4539021",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/Narendra-Modi-Xi-Jinping-new_380_AP.jpg",
"path": "full/6c4fd23b90858a3189ad47cf70ce8980a2aa5e22.jpg",
"checksum": "36122aca392fdcaa6dbac1ca9291ff6d"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/India-Pakistan-flags_380_Reuters.jpg",
"path": "full/5d76b253fbed0692ae9ab0281287e0bcc24a5955.jpg",
"checksum": "d0a8b1beb4e58819d390e59ac6cc3e73"
}
]
}