{
"source_article_link": "https://www.firstpost.com/world/seychelles-president-danny-faure-in-india-fate-of-assumption-island-deal-strategic-and-diplomatic-ties-hang-in-balance-4569411.html",
"title": "Seychelles president Danny Faure in India: Fate of Assumption Island deal, strategic ties at stake",
"date_published": "2018-06-22T13:21:41+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/04/Narendra-Modi-in-London-Seychelles_Twitter-MEAIndia.jpg"
],
"article_body": "Seychelles' reported decision to cancel the agreement with India to jointly develop a naval base on the Assumption Island adds to a long list of New Delhi's setbacks in the Indian Ocean region (IOR) amidst Beijing's growing economic and strategic footprints. But India is not showing any complacency. Determined to safeguard India's strategic interests in the IOR, the Narendra Modi government is proactively reaching out to visiting Seychelles president Danny Faure, who will be hosted for five days across four Indian cities – New Delhi, Ahmedabad, Panaji and Dehradun. Located northeast of Madagascar and southwest of the Maldives, Seychelles is an archipelago in the IOR. Diplomatic ties between New Delhi and Victoria have existed since Seychelles gained independence in 1976. Since then, India has continued to enjoy a multi-faced relationship with Seychelles. With India's consistent support, Seychelles has been able to build its own defence forces. Recently, two patrol boats, one interceptor and one Dornier Do-228 aircraft were provided to Seychelles' Coast Guard by India to carry out its surveillance and anti-piracy missions. Indian naval ships regularly visit Seychelles as part of their anti-piracy deployment. Moreover, Prime Minister Modi visited Seychelles in March 2015 to launch the first of a planned constellation of 32 coastal surveillance radars, which provide the Indian Navy with enhanced maritime domain awareness. Prime Minister Narendra Modi with Seychelles president Danny Faure. Twitter @MEAIndia Let's discuss the importance of the Assumption Island deal, which was originally signed during Modi's 2015 Seychelles visit. India's primary objective for setting up a joint naval facility in Assumption is to ensure the safe passage of shipping vessels and containers in the southern IOR. Another important objective is to allow Indian Navy to monitor the Mozambique Channel and thwart any piracy attempts since much international trade transits through this region. Most importantly, the facility can potentially counter China's increasing presence and securitisation of the IOR. The 2015 agreement was also supposed to help Seychelles patrol its 500,000-square-miles exclusive economic zone for illegal fishing, drug trafficking and piracy, and its ratification would have made India's relationship with Seychelles truly strategic. The deal, however, could not be ratified by the Seychelles parliament during the term of the then president, James Michel. Following Faure's coming to power in late 2016, discussion with India on the agreement was reopened. Concerted efforts were made by both sides to iron out differences, and the re-negotiated agreement was eventually signed by India's then foreign secretary, S Jaishankar, in January this year during his Seychelles visit. But the controversy did not end there as the Seychelles Opposition accused the Faure government of undermining the country's interests as the text of the detailed project report was leaked online. Faure was forced to clarify in the parliament that no compromise had been done on the Assumption Island, which \"belongs to Seychelles and Seychellois\". The deal has now become a casualty of Seychelles' domestic political struggles, where the Opposition does not want to compromise on the issue. Ironically, an Indian-origin politician, Wavel John Charles Ramkalawan, is Seychelles' Leader of the Opposition. Although Seychelles has a presidential form of government, the parliament has significant powers of oversight, effectively making Ramkalawan the leader of the parliament as the Opposition enjoys majority there. Despite India's consistent efforts to court Ramkalawan, he continues to remain opposed to the deal. Indian presence in Seychelles is also viewed with suspicion by some groups who fear that an influx of Indian workers would lead to indirect Indian dominance in the national economy, while ultra nationalist voices consider India building a military base an insult to their national pride. In a bid to dispel negative feelings, India had announced in March a series of high-profile civil projects for Seychelles amounting to more than $8 million. For the construction of a state-of-the-art Magistrate's Court with all modern amenities, a sum of $3.45 million was earmarked. Seychelles has a judiciary building – the Palais de Justice – that opened in 2013 at Ile du Port, a man-made island on the outskirts of the capital Victoria. However, the building, which was financed by China in partnership with Seychelles' government, does not have enough space to house the Magistrate's Court. India also provided a grant of $3.5 million to the Seychelles Public Transport Corporation to purchase 71 buses from TATA Motors. Two other agencies to benefit from India's grant are Seychelles' Health Care Agency and the Anti-Narcotics Bureau. This, however, has not been able to brighten the deal's prospects. Last month, the ruling party's mouthpiece admitted that India's plans for setting up a military base in the Assumption Island had suffered a setback as Ramkalawan reneged his promise on the project after having initially agreed to it. The editorial is reported to have observed: \"What is obvious, however, is that because of the Opposition's sabotage efforts, many projects are being affected... The first that comes to mind is the Coast Guard facility on Assumption Island. After indicating in India that he supported the project, Opposition leader Wavel Ramkalawan has made a U-turn and said that to him that the Seychelles-India agreement is 'dead'.\" Faure is no stranger to India and Modi. He previously visited India in March, as well as during his tenure as his country's vice-president. Recently, he met Modi on the sidelines of the Commonwealth Summit in London. However, defining the India-Seychelles partnership through the prism of the Assumption Island deal would be an oversimplification of the strength of bilateral ties which are not dependent on specific leaders or issues. However, China's overbearing presence may make matters difficult for India. China has been aggressively attempting to erode India's geographical and soft power advantages in the IOR. There are concerns over the real intent of China's massive investment in infrastructure projects in India's broader maritime neighbourhood, where there is no visible commercial benefit. China's creeping penetration in the IOR and its intense attempts to court small IOR littoral states such as Sri Lanka and the Maldives are striking. In particular, India's ongoing tensions with the Maldives are a manifestation of India's strategic aims coming under threat. The recent developments have put the close India-Maldives security relations under increasing stress. The problems have been around even since President Abdulla Yameen came to power a few years ago but took the turn for worse in February when the Maldives declared a state of emergency. The Modi government expressed dismay over the sentencing of former president Maumoon Abdul Gayoom and Chief Justice Abdulla Saeed to long terms in prison without giving them a fair trial. The situation became so bad in April that the Yameen regime asked India to take back two Dhruva helicopters gifted to Male in 2013. The Modi government has repeatedly emphasised that without enhancing India's maritime presence in the IOR, New Delhi cannot hope to exercise a sufficient degree of influence just as Chinese power grows exponentially. Though India's web of economic and military linkages is much stronger with Seychelles, which remains outside the China-led Belt and Road Initiative (BRI), Beijing has been pushing for Seychelles to become part of its maritime Silk Road project. It is no secret that India's rejection of the BRI initiative is partly centred on the nation's sovereignty and territorial integrity and partly based on unsustainable debt burdens. Despite India's full entry into the Shanghai Cooperation Organisation (SCO), whose other seven members have wholly embraced the BRI, Modi at the Qingdao summit did not change India's principled stand on the project. Therefore, Seychelles' remaining outside the BRI framework has been an Indian gain so far, and the Assumption Island deal can further help India have a stronghold in the region, besides monitoring Chinese maritime activities. Whether or not the Assumption deal moves forward will eventually depend on India's diplomatic handling of the issue when Faure visits India. Modi would certainly like to understand more about what Faure has in mind about the future of the project. However, New Delhi must approach the issue adroitly so that Faure's visit does not get entangled in domestic power politics. Whether India's renewed strategic push will receive sustained political support and attention from the tiny island nation remains uncertain. If Faure's coalition secures a parliamentary majority in near future, the agreement is likely to be implemented. But India will never interfere in Seychelles' internal political affairs. India should continue to provide economic and military assistance to Seychelles in order to preserve its vital interests in the IORwhile playing its traditional role of the regional security provider. At the same time, the Modi government should seriously explore the possibility of sending a bi-partisan parliamentary delegation on a 'goodwill mission' to Seychelles, as this will not only boost the democratic bond between the two countries but also help in gauging the perspectives across the political spectrum. As France has a strong strategic commitment toward Seychelles, India will also like to explore the possibility of India-France-Seychelles trilateral cooperation. In March, India and France have come together for strategic partnership in the western part of the IOR. The \"Joint Strategic Vision of India-France Cooperation in the Indian Ocean Region\", signed during President Emmanuel Macron's India visit, states that India and France share common concerns on freedom of navigation in the region and would support greater coordination in regional and international fora in the region. This can prove to be the real game changer.",
"description": "Seychelles' reported decision to cancel the agreement with India to jointly develop a naval base on the Assumption Island adds to a long list of New Delhi's setbacks in the Indian Ocean region (IOR) amidst Beijing's growing economic and strategic footprints. But India is not showing any complacency. Determined to safeguard India's strategic interests in the IOR, the Narendra Modi government is proactively reaching out to visiting Seychelles president Danny Faure, who will be hosted for five days across four Indian cities – New Delhi, Ahmedabad, Panaji and Dehradun. Located northeast of Madagascar and southwest of the Maldives, Seychelles is an archipelago in the IOR. Diplomatic ties between New Delhi and Victoria have existed since Seychelles gained independence in 1976. Since then, India has continued to enjoy a multi-faced relationship with Seychelles. With India's consistent support, Seychelles has been able to build its own defence forces. Recently, two patrol boats, one interceptor and one Dornier Do-228 aircraft were provided to Seychelles' Coast Guard by India to carry out its surveillance and anti-piracy missions. Indian naval ships regularly visit Seychelles as part of their anti-piracy deployment. Moreover, Prime Minister Modi visited Seychelles in March 2015 to launch the first of a planned constellation of 32 coastal surveillance radars, which provide the Indian Navy with enhanced maritime domain awareness.",
"time_scraped": "2018-08-17 14:40:11.829812",
"article_id": "4569411",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/04/Narendra-Modi-in-London-Seychelles_Twitter-MEAIndia.jpg",
"path": "full/751ffbaee9943820f4092e0f0a2ed9814a20ab2b.jpg",
"checksum": "d6a7d14894568c0cc12892162b09f501"
}
]
}