{
"source_article_link": "https://www.firstpost.com/india/after-maharashtra-farmers-body-plans-long-march-in-delhi-wants-special-session-of-parliament-to-discuss-agrarian-crisis-4601691.html",
"title": "After Maharashtra, farmers' body plans long march in Delhi; wants special session of Parliament to discuss agrarian crisis",
"date_published": "2018-06-26T17:49:14+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/03/Farmers-protests-Sanjay-Sawant-380.jpg"
],
"article_body": "New Delhi : After the \"successful long march\" of farmers in Maharashtra, the All India Kisan Sabha (AIKS) is now planning to hold a similar rally in the national capital to demand a special session of Parliament to discuss agrarian crisis. The farmers at the Mumbai protest. Firstpost In a meeting of the central office-bearers of the AIKS in Delhi on Tuesday, the farmers' organisation said such a move was necessary to make the government aware of the plights of the cultivators. \"A meeting of the central office-bearers of the AIKS held today in Delhi decided to support the idea of a long march of the dispossessed to Delhi to demand a special session of Parliament called entirely to discuss the serious agrarian crisis in the country,\" AIKS general secretary Hannan Mollah said. The farmer organisation said that the date of the long march would be finalised after wider consultation with other organisations and individuals. It could be held anytime after 5 September, when the AIKS will hold a farmers' rally. The AIKS has also appealed to the broadest sections of progressive, democratic and secular organisations and individuals in the country, who are sensitive to the intense pain and hardships being faced by farmers, to support this idea of a long march. Talking about the plight of the farmers, the AIKS alleged that the last four years thoroughly exposed the NDA government as being the \"most anti-farmer, anti-worker, pro-corporate in independent India\". Accusing the government of creating \"unprecedented\" agrarian crisis, the organisation said that the situation reflected in suicides of lakhs of debt-ridden farmers, deaths of children and women due to starvation and the massive increase in rural unemployment and landlessness within the farming community.",
"description": "New Delhi : After the \"successful long march\" of farmers in Maharashtra, the All India Kisan Sabha (AIKS) is now planning to hold a similar rally in the national capital to demand a special session of Parliament to discuss agrarian crisis. The farmers at the Mumbai protest. Firstpost In a meeting of the central office-bearers of the AIKS in Delhi on Tuesday, the farmers' organisation said such a move was necessary to make the government aware of the plights of the cultivators. \"A meeting of the central office-bearers of the AIKS held today in Delhi decided to support the idea of a long march of the dispossessed to Delhi to demand a special session of Parliament called entirely to discuss the serious agrarian crisis in the country,\" AIKS general secretary Hannan Mollah said. The farmer organisation said that the date of the long march would be finalised after wider consultation with other organisations and individuals. It could be held anytime after 5 September, when the AIKS will hold a farmers' rally.",
"time_scraped": "2018-08-17 14:40:30.968692",
"article_id": "4601691",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/03/Farmers-protests-Sanjay-Sawant-380.jpg",
"path": "full/0645a4b6d63dc659c3a80a5b8e3fcbabd8a8dc74.jpg",
"checksum": "96632ee84b1387d8c132f2132a370ab0"
}
]
}