{
"source_article_link": "https://www.firstpost.com/india/chennai-salem-highway-row-aggressive-land-acquisition-by-tn-govt-snowballs-into-major-controversy-as-protests-escalate-4606751.html",
"title": "Chennai-Salem highway row: Aggressive land acquisition by TN govt snowballs into major controversy as protests escalate",
"date_published": "2018-06-27T12:01:45+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/Tuticorin-police-protestors_PTI6.jpg"
],
"article_body": "Members of Dravida Munnetra Kazhagam (DMK) and Communist leaders in Tamil Nadu on Mondayannounced their protest against the state government acquiring lands for the proposed eight-lane Chennai-Salem Greenfield super expressway, giving the locals' and farmers' movement some much-needed momentum. Despite mounting oppositionto the project – that witnessed an uptick following the recent arrest of protesting farmers and activists – the state governmentappears to be in a hurry to complete the 277.3-kilometre eight-lane expressway connecting Chennai and Salem and started preliminary surveys, which prompted wild reactions from farmers. Black flags were hoisted by farmers in Salem and Farmers Association members in the state have raised in revolt against the ambitious expressway project, which has been seen as the pet project of Chief Minister Edappadi K Palaniswami, a native of Salem. Representational image. PTI In Tiruvannamalai district alone, where 123.9 kilometres of the proposed highway would pass through, about 95 percent of the land procuredis precious agricultural land. Naturally, the farming community here is the most worried and agitated, as their traditional farming practices are at stake. \"The proposed project will destroy and fragment reserve forest, agricultural lands, and wells and bore wells. If the project is implemented, a number of villages will be wiped out and access to many of them will be cut off,\" said S Balaraman, deputy president of Tamil Nadu Vivasayigal Sangam, Tiruvannamalai. Tiruvannamalai is one of the five districts that the proposed superhighway is to pass through. The other districts are Kancheepuram, Krishnagiri, Dharmapuri, and Salem. The longest stretch of the proposed highway, which will pass through Tiruvannamalai, is expected to have a damaging impact on the pristine Eastern Ghats forest environment, say ecologists. However, the state has adopted strong-arm tactics to quell any sort of opposition to the project. Policemenhave been camping in every village where the state revenue officials were conducting their survey work. It seems that the government is ready for another Thoothukudi-like standoff with the protesters. The government started the survey work a week back despite the protests and opposition, and so far, a total of 56 kilometres in Dharmapuri district and 30 kilometres in Salem district have been completed. Boundary markers have also been installed despite stiff resistance faced by the officials in many villages. High drama unfolded on Monday when the police swung into action and arrested environmental activist Piyush Manush and Tamil actor Mansoor Ali Khan for \"instigating\" farmers and speaking out against the project. Khan had famously said that he would go to prison only after killing at least eight people behind the project. \"If a person speaks in a provocative manner, the right place for him is behind bars,\" said D Jayakumar, state fisheries minister and spokesperson of the government. Environmentalists, including Manush, who played a pivotal role in safeguarding the water bodies in Salem, have maintained that preserving the groundwater table in Tamil Nadu, which has gone to abysmal depths, is the need of the hour. Manush said: \"We cannot sacrifice even one tree more; destroying forests and prime agricultural lands in the name development would only spell doom for the whole of Tamil Nadu. The project doesn't make any hydrological sense as the government is all set to destroy forests, watersheds and farmlands in the name of development.\" Salem district collector Rohini R Bhajibhakare, however, said that the state government hasselected the best possible package for the land and other properties to be acquired, and added that only 10 percent of farmers were ambivalent about parting with their land holdings. While the state government is using intimidation tactics to silence the critics on one hand, by arrests and police deployment, on the other hand, it has raised compensation considerably in the form of a bait to lure the protesting farmers. As per the compensation package, while the minimum amount of Rs 21.5 lakh must be paid per hectare of land procured, the maximum amount has reportedly gone up to a whopping Rs 9.04 crore. \"Yes, the compensation increases day-by-day to lure in protesting farmers,\" farmer leaders said. Farmers' 'wrath' unlikely to die down The protests, it appears, are unlikely to die down any time soon. Last Monday, the police officers accompanying revenue officials arrested seven farmers at Achankuttapatti village in Salem, as \"they came in the way of officials from discharging their duty\". In another instance, the farmers' wrath drove officials from the place when they tried to conduct a survey on lands with proper titles. Students also joined in the farmers' protests on that day, and they lay on the cultivable lands to prevent officials from carrying out the survey, which made the officials evict them forcefully from their own lands. As a result, on the first day of survey work, only a five-kilometre stretch was covered in a cluster of villages near Salem. According to sources, the revenue teams are only taking a preliminary survey and those having objections are directed to meet the Land Acquisition Officer. The collector as an arbitrator is empowered to enhance the compensation even at a later date. The government has failed to take into account the environmental cost of the whole project, but it is bent upon only luring farmers through higher compensations. Earlier, the compensation for a felled coconut tree was put at Rs 40,000 but now, it has been raised to Rs 50,000. And while it was only Rs 350 per square feet for concrete houses earlier, a 500-square-feet concrete house would now get a compensation of Rs 25.50 lakh. \"There is a huge variance in compensation between what the chief minister had announced in the Tamil Nadu Assembly and in what is being peddled today. While urban lands are supposed to get two times the market price, cultivable lands get 2.5 times to four times. All this happened after farmers raised their banner of revolt\" environmentalists said, in one voice. The farmers and environmentalists, even while condemning the survey work carried out by the revenue department, said that they would not part with their lands. Meanwhile, MK Stalin, Leader of the Opposition in Tamil Nadu Assembly and DMK working president has urged the state government to listen to the views of the people patiently and not to hasten the process of land acquisition. Warning the state government to stop the survey work, Stalin said that the DMK would launch an agitation against the project. The condemnation of the project by environmentalists is not without valid reason either. \"About 50 hectares of forest land is required for this Greenfield project. The expressway would cut through reserve forest in at least three districts and for that, the project has to be cleared under the Forest Conservation Act. Conservation of every inch of forest land has to be approved,\" a senior forest officer said. The farmers have been vociferous in their opposition and want none of the raised compensation. \"This project has placed the livelihood of thousands of Tamil Nadu farmers in quandary. Even if the government is ready to give crores as compensation, we don't want it. We need our lands,\" said Thangamani, a farmer in Kancheepuram district. However, Mariappan, president of the Chamber of Commerce and Industry (Salem Chapter) claims: \"The district is all set to get a defence hub and the expressway will be of immense help.\" While Ponniah, Kancheepuram district collector, said that petitions they received against the land acquisition were more in the nature of claiming a fair and reasonable compensation. However, despite the jaundiced official view, the initial opposition has now grown into a full-blown movement against this ecologically damaging project. And with the arrest of protesting farmers, activists and politicians, the state is bound to witness more tense days ahead. Groundswell of support from all sections of the society – including major Opposition parties like DMK, CPM, CPI, PMK and MDMK – has given credence to the people's movement. It would not be an easy task for the government to quell the Greenfield highway protests – like it had in Thoothukudi, using brute force. The NewsCart",
"description": "Members of Dravida Munnetra Kazhagam (DMK) and Communist leaders in Tamil Nadu on Mondayannounced their protest against the state government acquiring lands for the proposed eight-lane Chennai-Salem Greenfield super expressway, giving the locals' and farmers' movement some much-needed momentum. Despite mounting oppositionto the project – that witnessed an uptick following the recent arrest",
"time_scraped": "2018-08-17 14:40:16.716146",
"article_id": "4606751",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/Tuticorin-police-protestors_PTI6.jpg",
"path": "full/9c81536e6444ce6b106ccde24c976c657009573e.jpg",
"checksum": "f21174adf042aadecf3ed87823524b89"
}
]
}