{
"source_article_link": "https://www.firstpost.com/india/farmers-body-in-madhya-pradesh-to-campaign-against-112-mlas-will-ask-villagers-to-vote-tactically-4744891.html",
"title": "Farmers' body in Madhya Pradesh to campaign against 112 MLAs, will ask villagers to vote 'tactically'",
"date_published": "2018-07-15T16:25:50+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/03/farmers-sachingokhale.png"
],
"article_body": "Bhopal : A farmers' organisation in Madhya Pradesh has said it will campaign against 112 legislators, who belong to various parties, for their \"failure\" to take up the issues of cultivators. \"Farmers would be asked to evaluate the works done by MLAs for their welfare, and cast votes \"tactically\" in the state Assembly elections due later this year,\" Aam Kisan Union leader Kedar Sirohi told \"We have identified 112 MLAs, who were elected from rural areas but never asked a question on the issues of farmers in the Assembly,\" he said. Representational image. Firstpost/Sachin Gokhale Their strategy is to focus on MLAs whose victory margin was less than 5,000 votes in the last state polls. \"Out of the 112 legislators identified by the organisation, 86 are of the BJP, 24 of the Congress and two are Independents,\" he said. \"Our (union) leaders will not go to every village of the identified constituencies, but they will visit only 20 villages having sizable farmers' population in each Assembly segment. We will interact with farmers and talk about their issues to convince them to vote tactically,\" he added. Madhya Pradesh Chief Minister Shivraj Singh Chouhan in June had said that his government deposited over Rs 35,000 crore into the accounts of farmers as part of various state-run schemes in the course of 2017. Sirohi said their organisation was not against any government or political outfit. \"Farmers from rural areas elect representatives to raise their problems in the Assembly. But, instead of raising the farmers' problems, legislators speak and talk at the behest of their party leadership,\" he alleged. Sirohi claimed Farmers in MP have collectively lost Rs 22,000 crore due to the 'Bhavantar Bhugtan Yojana' and there has been a loss of Rs 33,000 crore due to damage of crops in natural calamities. \"But, farmers across the state have been paid only Rs 5,300 crore under the crop insurance scheme,\" he said. The Bhavantar Bhugtan Yojana is a direct benefit transfer scheme under which farmers are paid the difference between the modal price (average market price for a particular commodity over a stipulated period) and the minimum support price (MSP) of crops. Sirohi pointed out Madhya Pradesh ranks third in terms of farmer suicides in the country, adding that such cases have gone up by 43 percent in the last five years. Notably, Home Minister Bhupendra Singh, during a reply in the MP Assembly 2017, had quoted the State Crime Record Bureau's data which said that 15,129 farmers and people associated with farming committed suicide from 2004 to 2016. Sirohi said they were not going to boycott the polls. \"We will spread the awareness among farmers to tactically vote in favour of those who would ensure the agri-loan waiver and sustainable income for cultivators.\" He said they were hopeful that other farmers' outfits would also support their plan. The BJP, however, criticised the organisation's move saying the government was working for farmers' welfare. \"If farmers' organisations want to do politics, they should come out openly. The MP government is committed to the cause of farmers and it won the Krishi Karman Award for six times in a row for increasing the crop productivity,\" state BJP spokesman Deepak Vijayvargiya said. He said that government was providing agricultural loan on zero percent interest, facilitating subsidised power supply, and that the irrigation capacity in state had gone up by 600 percent in past decade. The Aam Kisan Union had earlier given a call for protest from 1 June to 10 June 2017 to mark the first anniversary of the police firing in which six farmers were killed in Mandsaur on 6 June, 2017.",
"description": "Bhopal : A farmers' organisation in Madhya Pradesh has said it will campaign against 112 legislators, who belong to various parties, for their \"failure\" to take up the issues of cultivators. \"Farmers would be asked to evaluate the works done by MLAs for their welfare, and cast votes \"tactically\" in the state Assembly elections due later this year,\" Aam Kisan Union leader Kedar Sirohi told \"We have identified 112 MLAs, who were elected from rural areas but never asked a question on the issues of farmers in the Assembly,\" he said. Representational image. Firstpost/Sachin Gokhale",
"time_scraped": "2018-08-17 14:40:08.251456",
"article_id": "4744891",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/03/farmers-sachingokhale.png",
"path": "full/52e45d6feab74c104a5cf5da3a155bbbc3d687a0.jpg",
"checksum": "a9adab52b41826cc2e19d89c3c511e9e"
}
]
}