{
"source_article_link": "https://www.firstpost.com/india/of-no-fixed-abode-govt-should-accept-us-or-shoot-us-says-family-of-migrant-who-committed-suicide-in-2012-over-nrc-4970971.html",
"title": "Of no fixed abode: Govt should accept us or shoot us, says family of 'migrant' who committed suicide in 2012 over NRC",
"date_published": "2018-08-15T16:53:02+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Assam2.jpg"
],
"article_body": "Editor's Note: 30 profiles in 30 *** Silchar: In 2012, Arjun Namasudra of Cachar district had killed himself after he was served with a D-voter notice by the Foreigners Tribunal in Assam. Six years later, his family is battling the same crisis. Though his children, wife, and mother were listed in the final draft of the National Register of Citizens (NRC) released on 30 July, his mother-in-law Sabitri Biswas’ name was missing. “If the government is not convinced, if this country is not willing to accept us, then shoot us and give us relief from this continuing humiliation. It seems as if they don’t want us to prove our identity,” says Sabitri, hushed by her husband when asked about her age. She is in her mid-50s. Akal Biswas and his wife Sabitir, the in-laws of Arjun Namasudra who committed suicide in 2012. 101Reporters Arjun’s family and his in-laws stay in the same area of Harinagar village under Katigorah constituency of Cachar, where the Central government in 1956 promised Indian citizenship to 173 migrated families by issuing a 'citizenship card'. The-then government also allotted lands to migrated families during the early 1950’s after they left East Pakistan (now Bangladesh) and took shelter in refugee camps near the international border. Many of the descendants of these families — who have also received D-Voter notices in recent years — did not make it to the final NRC draft. Despite having a 1956 citizenship card issued in his father’s name, Arjun too was declared a D-Voter in 2012 and the fear of arrest or deportation to Bangladesh pushed the 32-year-old towards suicide. \"After the notice came, people started mocking him saying he would be pushed beyond the Indian border to Bangladesh. He could not stand the humiliation and fear. So, he committed suicide by hanging himself, leaving behind an aged mother and three children,\" says Bashana Namasudra, Arjun’s wife. \"Fear has become a regular part of our lives due to the new rules imposed by the government. We are not outsiders. The government gave us recognition. Why do we need to prove it so many times?” she asks indignantly. “After my husband's suicide, new D-Voter notices were served to other members of my family — including my stepmother,” she says. Mockery at tribunals In 2017, acting in compliance with the FT-4 notices against them, five members of Arjun's in-law’s family appeared before the court several times to present their case. “We appeared repeatedly before the Foreigners’ Tribunal with the required documents. But the way the tribunal members behave with us is inhuman. Some mockingly call us Bangladeshis and say that we will be pushed back to where we belong,\" says Sabitri who claimed her name was missing from the final draft despite having provided citizenship card of 1956 and the 1971 legacy data. Elaborating on the condition of these tribunal courts, she further alleges that there is no proper drinking water or toilet for women though they have to spend entire day during hearing. \"We are common Indian citizens and not criminals. We expect a little humanity from them,\" says the old woman. Arjun’s father-in-law, Akal Biswas, feels the situation will never be normal for those fighting this. \"Since our childhood, we have been listening to stories of Bahiragoto (illegal migrants). We have seen people suffering due to this tag imposed by the police and government officials,” says Akal adding that the issue has now just changed its colour. “Be it D-Voter or NRC, the processes have always harmed common people. My son-in-law killed himself, and though I consider suicide as a crime, the nation is equally guilty for it. I believe it will take more and more lives,” he says. \"One day a notice came and our lives changed forever,\" says Akal Bala Namasudra, Arjun’s mother. \"We live in the border area where the fear of being thrown away from India is common and that fear wrecked my son. “We tried to prove our identity in court but at that time nothing seemed to be working for us. I didn’t lose hope but my son did and one night he hanged himself. Today, my daughter-in-law is working somewhere and so are my grandchildren. The kids clean dishes and look after cows of other people to earn their bread and butter,” she says adding that old age has made it difficult for her to work or cook. “I almost beg and knock on every door to get some food. At this age, that should not be the case. My son was brave enough to kill himself but I don’t have that courage, else I would have finished my life,” she says with tears in her eyes. His suicide served votes Arjun’s death made it to news channels once again when Prime Minister Narendra Modi mentioned him during the 2014 Lok Sabha campaign in Cachar district. \"If BJP comes to power, no Arjun will be pushed to detention camp and no one will have to live in fear or commit suicide,\" Modi had said in Cachar promising to abolish all detention camps and bring in laws to protect persecuted Hindus — if he were to become the prime minister. The reality today, however, is quite different. Detention camps still exist and fear has only intensified among the people in Harinagar and other parts of Assam. Chief Minister Sarbananda Sonowal (then the Union Sports Minister) had visited Arjun’s house and assured that the government would take care of the family. He also promised a monthly pension for the family. However, family members claim that no such financial aid has arrived from the government or from any other public representative. Political leaders across the spectrum are blaming one another for the current situation. \"BJP is trying to terrify people in the name of D-Voter and NRC because they know that people are not going to vote for them in the 2019 Lok Sabha polls. They are creating panic among people and trying to give the message: If you don’t vote for us, we will make your life even more miserable,\" claims Maulana Ataur Rahman Majharbhuiya, former Katigorah MLA whose name has been left out of NRC. Though he never visited Arjun’s house, he has assured to reach Harinagar soon and extend support to the family. Incumbent Kathigorah MLA from BJP, Amarchand Jain, said they are aware of the tough situation but people need to be supportive towards legal procedures like NRC. \"This state is taking a large burden of illegal migrants and with measures like NRC and D-Voter, they will be identified and hopefully pushed back. Our duty is to protect the legal Indian citizens and if the family members of Arjun Namasudra have adequate documents, I promise, no one will be deprived (of the citizenship),\" says Jain. 101Reporters.com",
"description": "Editor's Note: 30 profiles in 30 *** Silchar: In 2012, Arjun Namasudra of Cachar district had killed himself after he was served with a D-voter notice by the Foreigners Tribunal in Assam. Six years later, his family is battling the same crisis.",
"time_scraped": "2018-08-17 15:05:04.054463",
"article_id": "4970971",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Assam2.jpg",
"path": "full/5bd222278be389d5468b579e0093a5796947ba78.jpg",
"checksum": "dcd3a1180efad17462b7ba6603d2e214"
}
]
}