{
"source_article_link": "https://www.firstpost.com/india/in-last-independence-day-speech-of-his-term-narendra-modi-sets-stage-for-2019-polls-hits-out-at-congress-4971561.html",
"title": "In last Independence Day speech of his term, Narendra Modi sets stage for 2019 polls, hits out at Congress",
"date_published": "2018-08-15T16:18:47+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Modi-Independence-day-pti.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/FirstCutByManjul15082018.jpg"
],
"article_body": "New Delhi: Setting the stage for the 2019 Lok Sabha elections, Prime Minister Narendra Modi on Wednesday projected himself as an impatient agent of change, castigated the Congress-led UPA for its \"governance failure\" and promised housing, power, water, sanitation and healthcare for all in his mission to take the country to new heights. He also announced that the ambitious Prime Minister's Jan Aarogya Abhiyan (PMJAA), dubbed \"Modicare\" , for health insurance coverage of Rs 5 lakh each to 10 crore families will be launched on 25September on the 102nd birth anniversary of Deen Dayal Upadhyaya, the founder of Bharatiya Jana Sangh, the BJP's predecessor. In a strong election pitch, Modi reached out to Dalits, youth, farmers, tribals, women, fishermen, security forces, middle class and upper middle class by referring to the work done by his government and his endeavour to improve their lives, especially the poor. Narendra Modi giving a speech on Independence Day at Red Fort. PTI In his last Independence Day speech at the Red Fort ahead of the next general elections, Modi said there was \"senseless\" criticism against him and asserted he was an impatient and restless agent of change for eliminating poverty and bringing all-round development. Five crore people, he said, have been brought out of poverty in the last two years. The 80-minute address, however, avoided any reference to foreign policy issues, including Pakistan, or the controversies surrounding the spate of recent incidents of lynching, the National Register of Citizens in Assam and the Rafale jet deal. Breaking his silence in the context of rape and sexual exploitation in welfare homes in Bihar and Uttar Pradesh, Modi said there was a need to attack such a mindset by putting the fear of the law that had been made stringent. He said the law was supreme and no one could take it into their hands. Referring to Jammu and Kashmir, Modi repeated the lines from his last year's 15 August speech that the Kashmir problem can be resolved only by embracing its people, not with bullets or abuses. Reaffirming his mantra of \"sabka saath, sabka vikas\" (take everyone along, development for all), the prime minister said there would be no discrimination against any section and there would be no nepotism and favouritism. \"I want to reiterate my pledges - housing for all, power for all, clean cooking (gas) for all, water for all, sanitation for all, skills for all, insurance for all, connectivity for all. We want to go ahead with these programmes. \"People make senseless criticism against me. But whatever may be said, I want to publicly acknowledge that I am restless because several countries have marched ahead and I want to take the country ahead of them. I am impatient because children are still suffering from malnutrition. I am eager to provide quality of life and ease of living to countrymen. I am impatient to provide health coverage to each of the poor so that they can fight against diseases. I am eager because we have to lead a knowledge-based fourth industrial revolution,\" he said. Answering critics who question his emphasis on cleanliness and the efficacy of the campaign, Modi cited a WHO report, which said that the Swachh Bharat Mission had saved the lives of three lakh poor children. Modi turned poetic before winding up his long speech, saying that the country's fortunes were being transformed. \"We have to make a new dawn and create a new India. We want to move ahead with the dream of reaching the crescendo of development.\" Attacking the Congress but not by name, he said if a comparison was made of the speed of governance in the last four years, people would be surprised. \"If toilets were built at the speed of 2013, several decades would have gone to reach the present stage. Rural electrification would have taken two decades. Taking LPG connection to poor women would have taken 100 years. Generations would have gone to take optical fibre to its present levels. There are a lot of expectations, a lot of needs. The country is feeling a change in the last four years. There is new awareness, new enthusiasm.\" He said the world had accepted that India was synonymous to \"policy paralysis and delayed reform\". \"But, now the world is saying that policy decisions are being taken as per the 'reform, perform and transform' norm.\" Avoiding any major economic announcement, the prime minister highlighted his government's achievements, citing GST as the centrepiece and the commendations from multilateral agencies on the reform measures. \"India has registered its name as the sixth largest economy in the world. Before 2013, institutions and economists across the world used to refer to India as a risky economy, but today the same institutions and individuals are saying with confidence that reforms have given India a new momentum and strong fundamentals. \"They say the sleeping elephant has woken up and started walking. For the next three decades, India is going to guide and speed up the world economy.\" He said while the country was earlier counted among the fragile five economies of the world \"today India is considered a multi-trillion dollar destination for investment\". The prime minister said the BJP-led ND, unlike the UPA, A had the acumen to take bold decisions. \"The demand for higher MSP (minimum support price) for farmers was pending for years.\" Similar was the case with the veterans' demand for one rank, one pension, he said. Modi also attacked the opposition over the non-passage of triple talaq bill in the just-concluded monsoon session of Parliament and promised to do justice to Muslim women by getting it passed early. Alleging that the previous governments had allowed a climate of corruption to thrive, he said his government had eliminated power brokers from Delhi and plugged loopholes in various schemes like Public Distribution System that had led to savings of Rs 90,000 crore. He said six crore fake beneficiaries, \"who were never born\", of various government welfare schemes had been knocked out. The measures initiated by the government had also led to near doubling of direct tax assesses from nearly four crore to 6.75 crore and indirect tax assesses from 75 lakh to 1.16 crore on account of the introduction of GST apart from barring over three lakh suspicious companies in the anti-black money drive.",
"description": "New Delhi: Setting the stage for the 2019 Lok Sabha elections, Prime Minister Narendra Modi on Wednesday projected himself as an impatient agent of change, castigated the Congress-led UPA for its \"governance failure\" and promised housing, power, water, sanitation and healthcare for all in his mission to take the country to new heights. He also announced that the ambitious Prime Minister's Jan Aarogya Abhiyan (PMJAA), dubbed \"Modicare\" , for health insurance coverage of Rs 5 lakh each to 10 crore families will be launched on 25September on the 102nd birth anniversary of Deen Dayal Upadhyaya, the founder of Bharatiya Jana Sangh, the BJP's predecessor.",
"time_scraped": "2018-08-17 15:05:01.230284",
"article_id": "4971561",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Modi-Independence-day-pti.jpg",
"path": "full/3eceb7d8f74f3867a1b54249d4d15fab88ef5e69.jpg",
"checksum": "79b0851a7d45bacd9bcefe1816f89429"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/FirstCutByManjul15082018.jpg",
"path": "full/385b2313b114810a20d19298696c0345abcb6351.jpg",
"checksum": "223f13c016ee7f3bbb4c03be1e9ccfbd"
}
]
}