{
"source_article_link": "https://www.firstpost.com/india/election-commission-can-hold-lok-sabha-four-assembly-polls-simultaneously-in-december-says-cec-op-rawat-4972001.html",
"title": "Election Commission can hold Lok Sabha, four assembly polls simultaneously in December, says CEC OP Rawat",
"date_published": "2018-08-15T17:47:25+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/OP-Rawat-pti.jpg"
],
"article_body": "New Delhi: The Election Commission was capable of holding the Lok Sabha elections and polls to four state assemblies together in December if the parliamentary elections are advanced, Chief Election Commissioner OP Rawat said on Wednesday. His comments came when asked whether the Election Commission was ready if the Lok Sabha elections are held in December along with Assembly polls in Madhya Pradesh, Chhattisgarh, Mizoram and Rajasthan. \"Why not. There would not be any problem,\" he told PTI. File photo of Chief Election Commissioner OP Rawat. PTI There have been speculation in some circles that the Lok Sabha elections, scheduled for April-May 2019 may be advanced to November-December 2018 so that they can be held simultaneously with Assembly elections in Madhya Pradesh, Chhattisgarh, Mizoram and Rajasthan. While the term of the Mizoram Assembly will end on 15 December, the terms of Chhattisgarh, Madhya Pradesh and Rajasthan assemblies would end on 5 January, 7 January and 20 January 2019, respectively. Asked whether the required electronic voting machines (EVMs) and paper trail machines would be ready if the Lok Sabha polls are held in December along with those of four assemblies, the CEC said while all the required EVMs would be in place by September end, paper trail machines would come in November end. The CEC explained that out of 17.5 lakh paper trail machines, 16 lakh would be in place before November. The remaining 1.5 lakh paper trail or voter-verifiable paper audit trail (VVPAT) machines would be delivered by the end of November. \"As you had sought to know, if LS elections are held in December, then the first level check (FLC) of the 1.5 lakh VVPATs (which EC would get in November end) would be difficult ... then some critical small gaps would be there,\" he said. While the EC needs EVMs and VVPATs for 10 lakh polling stations for the LS polls, it needs the two devices for two lakh polling stations in four states where Assembly elections would be due in December-January. \"There would be a little constraint on the reserves. Instead of 135 per cent (reserves), will have to go for 130 per cent, if the situation arises,\" Rawat said about VVPATs. Voter-verifiable paper audit trail (VVPAT) or paper trail machine is a device which dispenses a slip with the symbol of the party for which a person has voted for. The slip appears on a small window for seven seconds and then drops in a box. But the voter cannot take it home. The VVPAT is used in all polling stations. But as of now, results of EVMs and VVPATs are matched in one polling station per constituency. There have been demands to increase the number of polling stations where EVM and VVPAT results are matched to dispel fears about electronic voting machines being 'hacked' to favour a particular political party. Rawat said there have been delays in the delivery of paper trail machines as the Technical Experts Committee appointed by it analyses the technology stabilisation issues in the initial batches and incorporates essential design improvements. \"This ensures we don't face the problems later,\" he said. While all required EVMs — 13.95 lakh ballot units and 9.3 lakh control units — will be delivered by 30 September, 17.15lakh VVPATs will also be delivered well before the end of November, he added. Over 11 per cent of the 10,300 VVPAT machines across 10 states had developed faults and had to be replaced during the 28 May bypolls.",
"description": "New Delhi: The Election Commission was capable of holding the Lok Sabha elections and polls to four state assemblies together in December if the parliamentary elections are advanced, Chief Election Commissioner OP Rawat said on Wednesday. His comments came when asked whether the Election Commission was ready if the Lok Sabha elections are held in December along with Assembly polls in Madhya Pradesh, Chhattisgarh, Mizoram and Rajasthan. \"Why not. There would not be any problem,\" he told PTI. File photo of Chief Election Commissioner OP Rawat. PTI There have been speculation in some circles that the Lok Sabha elections, scheduled for April-May 2019 may be advanced to November-December 2018 so that they can be held simultaneously with Assembly elections in Madhya Pradesh, Chhattisgarh, Mizoram and Rajasthan.",
"time_scraped": "2018-08-17 14:40:44.334640",
"article_id": "4972001",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/OP-Rawat-pti.jpg",
"path": "full/f1b1e338bff26bd4ac0a114b4853e6e5cbfcf4dd.jpg",
"checksum": "51d935a1c0cbd9b6306858cbdc90d99a"
}
]
}