{
"source_article_link": "https://www.firstpost.com/india/afghan-talibans-ghazni-attack-turns-pakistan-into-useful-us-ally-once-more-india-caught-in-uncomfortable-situation-4973851.html",
"title": "Afghan Taliban's Ghazni attack turns Pakistan into useful US ally once more; India caught in uncomfortable situation",
"date_published": "2018-08-16T07:43:13+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/download3.jpg"
],
"article_body": "Ghazni is a historic and strategically important city in Afghanistan. It straddles the Kabul-Kandahar Highway, and is also close to the tribal areas in neighbouring Pakistan. The unfortunate city has just witnessed a fierce battle between Afghan security forces and the Afghan Taliban. The city residents remain caught in an increasingly dangerous situation, with both sides suffering heavy casualties numbering in hundreds. The daring and surprising Taliban assault on Ghazni is a part of its well-calculated strategy that entails enjoying the military initiative in the insurgency that has been weaning down the Afghan security forces, while taking advantage of insurgent safe havens in Pakistan. The Afghan Taliban’s show of strength in Ghazni is reminiscent of a similar assault on Kunduz in 2015. The latest development comes on the heels of tentative signs that diplomatic efforts to kickstart the Afghan peace process are bearing fruit following landmark preliminary talks in Qatar between the US and the Afghan Taliban last month. Before that, the Afghan Taliban and the Kabul regime held a truce for Eid-ul-Fitr, leading to unprecedented scenes of the insurgents entering many cities to embrace their government opponents. File image of Taliban militants. Reuters Where does India stand on the direct talks between the US and Afghan Taliban? Nowhere. Officially, India has always been against any differentiation within the Afghan Taliban between reconcilable and irreconcilable elements because it views the insurgent group as a militant proxy of Pakistan. Other regional countries may not entirely differ with India’s arguments, but their official stand is unlike that of New Delhi's. Russia, China and Iran consider the Islamic State's Afghan branch as their biggest enemy. Moscow has been consistent in its approach that the growing IS footprint in Afghanistan is a huge danger to the security of Russia and the Central Asian Region. Iran is also willing to cooperate with its erstwhile adversary, the Taliban, to fight the new enemy, the IS. The narrative that has gained extensive acceptability is that the Afghan Taliban needs to be politically rehabilitated in order to wipe out the IS. It also perfectly suits the Pakistani military establishment, since it takes the focus away from the Afghan Taliban, allowing it to consolidate its territorial gains and find much-needed access into the Afghan governing structure through sheer military pressure. Anything that promotes political negotiations with the Afghan Taliban also has the effect of allowing Pakistan to remain strategically vital to the US and the international community, while weakening India’s efforts to have Pakistan viewed internationally as a supporter of terrorism. Despite their wide-ranging differences, Afghan president Ashraf Ghani and CEO Abdullah Abdullah agree on one point: Pakistan is the reason for most of the challenges confronting the Afghan State and its National Unity Government (NUG). Unless Afghan people are allowed to own their country, the Pakistani military establishment will continue to toy with Afghan geography, resources and lives. The existing American strategy in Afghanistan, articulated exactly a year ago in a major speech by the US president Donald Trump, has not succeeded in finding a lasting solution to the ongoing conflict. Almost all of the critical military and strategic objectives — to deny safe havens in Pakistan, to reduce the fighting capability of the Afghan Taliban, and to disincentivise Pakistan’s nurturing of the Afghan Taliban — remain unfulfilled. Consequently, the Trump administration has been forced to enter into direct negotiations with the Taliban, conceding to the group's longstanding demand. The previous American stance was that it would sit on the sidelines of an \"Afghan-led, Afghan-owned\" peace process. This has been India's stance as well. The primary aim of Washington's attitudinal shift is to bring a semblance of stability and final closure to the protracted military campaign in Afghanistan.The Afghan Taliban is absolutely aware of the fact that a major military and territorial victory on the eve of direct talks with the US can certainly help it gain more political weight. This explains the Ghazni operation. In May this year, the Afghan Taliban briefly took over parts of the western city of Farah, killing many before eventually being vanquished. And Pakistan's military establishment has also surmised correctly that the longer it plays the double game of running with the hare and hunting with the hounds, the smaller the US appetite to remain invested in the 'graveyard of empires'. An emboldened Pakistan will certainly aim to reverse all the gains India has made at great cost over the years in Afghanistan. This puts New Delhi in a diplomatically uncomfortable and militarily precarious situation. India has not been able to insist on an entirely military-focussed approach towards the Afghan Taliban since it would prompt Washington to ask New Delhi to contribute militarily. As India's political establishment has ruled out sending Indian troops to Afghanistan, New Delhi’s leverage with the Trump administration has not been very evident in this regard. India has never sougght to reduce Afghan territory to a playground for the India-Pakistan rivalry as New Delhi has had no particular favourites in Kabul. But that does not apply to Pakistan which seeks to instal a pliant regime in Afghanistan to be exploited for strategic advantage and depth against India. Since the balance of power between Kabul and Islamabad is skewed in favour of the latter, India's preferred approach has been to ensure the establishment and survival of the Afghan regime that does not work against its security interests. It should not be forgotten that the Afghan Taliban and other Pakistani proxies frequently orchestrate deadly attacks on Indian interests in Afghanistan. As a stakeholder in a peaceful and stable Afghanistan, New Delhi has no choice but to find imaginative ways to convince all stakeholders of the dangers of bringing back the militarily well-built Afghan Taliban into the corridors of power in Kabul. By creating a choice between the Afghan Taliban and the IS, the Pakistani military establishment seems to have brought the region back to the 1990s when Afghanistan, engulfed in the civil war, had become the recruiting and training ground of jihadist forces from around the world. If the Afghan Taliban assures New Delhi that it has no malevolent intentions against India, New Delhi has no business to be concerned about who controls Ghazni or Kabul. Is India so lucky? Imran Khan, unfortunately, may not be able to answer this question if and when Narendra Modi meets him.",
"description": "Ghazni is a historic and strategically important city in Afghanistan. It straddles the Kabul-Kandahar Highway, and is also close to the tribal areas in neighbouring Pakistan. The unfortunate city has just witnessed a fierce battle between Afghan security forces and the Afghan Taliban. The city residents remain caught in an increasingly dangerous situation, with both sides suffering heavy casualties numbering in hundreds. The daring and surprising Taliban assault on Ghazni is a part of its well-calculated strategy that entails enjoying the military initiative in the insurgency that has been weaning down the Afghan security forces, while taking advantage of insurgent safe havens in Pakistan. The Afghan Taliban’s show of strength in Ghazni is reminiscent of a similar assault on Kunduz in 2015. The latest development comes on the heels of tentative signs that diplomatic efforts to kickstart the Afghan peace process are bearing fruit following landmark preliminary talks in Qatar between the US and the Afghan Taliban last month. Before that, the Afghan Taliban and the Kabul regime held a truce for Eid-ul-Fitr, leading to unprecedented scenes of the insurgents entering many cities to embrace their government opponents.",
"time_scraped": "2018-08-17 14:40:33.149510",
"article_id": "4973851",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/download3.jpg",
"path": "full/1d31a14ff1f42cd2d901e7731b7b8b1a35c62e6c.jpg",
"checksum": "7a9240a3c7310c25876f97bb7ab50b2a"
}
]
}