{
"source_article_link": "https://www.firstpost.com/politics/atal-bihari-vajpayee-dead-latest-updates-imran-khan-calls-ex-pm-a-tall-personality-of-the-subcontinent-4973541.html",
"title": "Atal Bihari Vajpayee dead; latest updates: Imran Khan calls ex-PM a 'tall personality of the subcontinent'",
"date_published": "2018-08-16T23:47:09+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [],
"article_body": "Atal Bihari Vajpayee dead; latest updates: UPA chairperson Sonia Gandhi described former prime minister Atal Bihari Vajpayee as a \"towering figure\" who stood for democratic values and demonstrated this commitment in all his acts. She also paid last respects at Vajpayee residence in Delhi. The Pakistani government condoled the death of former prime minister Atal Bihari Vajpayee. \"He was a renowned statesman who contributed to bringing a change in India-Pakistan relations and remained key supporter of SAARC and regional cooperation for development,\" it said in a statement. In an address from Atal Bihari Vajpayee's residence, Prime Minister Narendra Modi remembered the late prime minister as a father figure. \"Whenever he met me, he would hug me like a father. For me, the void he has left can never be filled. He made BJP's ideology reach every corner of the country. It's because of him that BJP has come this far.\" Speaking at Atal Bihari Vajpayee'sresidence in Delhi, BJPchief AmitShah said that Atal Bihari Vajpayee's mortal remains will be kept at his residence till Friday morning. \"His body will be taken to BJP headquarters at 9 am on Friday. At 1 pm, the funeral procession will begin. The last rites cermony will be held at Smriti Sthal at 4 pm,\" he said. The Jharkhand government has declared a seven-day mourning in memory of Atal Bihari Vajpayee, while the Punjab government has declared a three-day mourning. All offices/boards/corporation and educational institutions in Punjab will remain closed on Friday as a mark of respect, while Jharkhand has announced state holiday tomorrow. The central government announceda seven-day State mourning throughout India. Meanwhile, Delhi deputy chief minister Manish Sisodia announced on Twitter that all Delhi government offices, schools, and other institutions will remain closed on Friday as \"a mark of respect\" for AtalBihari Vajpayee. Home Minister RajnathSingh saidthat the mortal remains of former prime minister Atal Bihari Vajpayee will be taken to his residence, where people can pay tribute to him.Thebody will be kept at the BJP headquarters in Delhi on Friday. In a series of tweets, Prime Minister Narendra Modicondoled the death of former prime minister AtalBihari Vajpayee. \"His passing away marks the end of an era. He lived for the nation and served it assiduously for decades. My thoughts are with his family, BJP and millions of admirers in this hour of sadness,\" Modi said. Ex-prime minister Atal Bihari Vajpayee passed away at 93. In a statement, AIIMSsaid, \"It is with profound grief that we inform about the sad demise of former prime minister of India Shri Atal Bihari Vajpayee at 5.05 pm,\" the hospital said in a statement. A large crowd of mediapersons and others has gathered outside the hospital in south Delhi to get updates on Vajpayee's heath, affecting movement of traffic on the road. Policemen have been deployed to manage the crowd and traffic outside the hospital. Bihar chief minister Nitish Kumar, and his deputy Sushil Kumar Modi arrived at All India Institute of Medical Science.They were accompanied by Bihar minister Nand Kishore Yadav. Meanwhile, Chhattisgarh chief minister Raman Singh said that the entire country is praying for the health of former prime minister AtalBihari Vajpayee. \"Chhattisgarh and the entire nation is praying for him. We pray to the God to make him healthy soon and bless him with a long life,\" he said. Shiv Sena president Uddhav Thackeray may leave for New Delhi on Thursday evening to enquire about the health of former Prime Minister Atal Bihari​ Vajpayee, who is on life support at the AIIMS, sources told .\"Atal ji and Sena founder Balasaheb Thackeray shared close relations when the Sena supremo was alive. Their personal bonding was one of the reasons why the BJP-Sena​ alliance stayed strong for decades. It would be natural for​ Uddhav ji to visit the former prime minister to check on his health,\" a source close to Thackeray said. Nobel laureate Kailash Satyarthi was seen arriving at All India Institute of Medical Sciences in Delhi where former prime minister Atal Bihari Vajpayee is admitted and is in a \"critical condition. Meanwhile,Loktantrik Janata Dal Sharad Yadav tweeted saying that he worked with Atal Bihari Vajpayee as a minister in his government and that the former prime minister loved him a lot. \"His health is not well. I pray for his early recovery and long life,\" he said in the tweet. Addressing the media, Health Minister JP Naddasaid that former prime minister's condition is \"still critical\", and that the doctors at AIIMS are taking efforts to revive his health. He also said that the medical bulletin will be out soon.Prime Minister Narendra Modi left the hospital after being briefed about Vajpayee's health. According to reports, movement around the institute has been restricted. While security outside AIIMShospital and AtalBihari Vajpayee'sresidence in Delhi has been beefed-up, traffic has also been blocked and no new entries are being allowed inside the hospital premises. \"I served as a member of his cabinet for two years, to hear about his health is distressing. He is a great leader and to work under him was a very good experience. I would be flying to Delhi today, Odisha chief minister Naveen Patnaiktold The Bharatiya Janata Party has postponed its national executive meeting in view of Atal Bihari Vajpayee's deteriorating health condition, News18 reported. According to roads leading to Krishna Menon Marg and Vajpayee'shome have been blocked. The BJP stalwart has been admitted to AIIMSfor the last nine weeks, where his condition remains critical. The entire Karnataka BJP leadership is heading from Bengaluru to Delhi, including Union minister Sadananda Gowda. Former Karnataka chief minister and state BJP President BS Yeddyurappa has suspended all meetings and scheduled plans in view of Vajpayee’s sensitive health, reported. Delhi chief minister Arvind Kejriwalhas requested hisparty volunteers not to celebrate his birthday in view of the deteriorating health condition of former prime minister Atal Bihari Vaajpayee. He hasrequests the volunteers to refrain from visiting his residence, according to reports. BJP chief ministers such as Devendra Fadnavis, Yogi Adityanath, Shivraj Singh Chouhan are rushing to AIIMS in New Delhi tovisitVajpayee as he continues to be in a critical condition and on life support.Union ministers Ram Vilas Paswan and Uma Bhartialso visited AIIMShospital in Delhi to inquire about Vajpayee's health. \"Former Prime Minister Atal Bihari Vajpayee's condition continues to remain the same. He is critical and on life support systems, read the AIIMS statement released on Thursday morning. Prime Minister Narendra Modi may pay a second visit to Atal Bihari Vajpayee in AIIMS. The hospital is expected to release the latest medical bulletin after Modi's visit. AIIMS director will brief the Prime Minister's Office about the health of Atal Bihari Vajpayee. Doctors at AIIMS are presently monitoring Vajpayee in ICU and the next one hour is said to be crucial, reported.External Affairs Minister SushmaSwaraj also paid a visit to ailing former prime ministerAtalBihari Vajpayeeat AIIMSin Delhi. In view of Atal Bihari Vajpayee’s critical health, BJPhas suspended all its programmes. An event scheduled for 20 August where Prime Minister Narendra Modi was to launch a book on Vice-President M Venkaiah Naidu’s one year in office has also been postponed, according to Senior BJP leader LK Advani and daughter Pratibha Advani arrived at AIIMShospital on Thursday morning to see ailing former PM AtalBihari Vajpayee. The BJP leader was admitted to AIIMS with a kidney tract infection, urinary tract infection, low urine output and chest congestion.\"Both his lungs are not in good condition because of pneumonia on both sides and kidneys are also weak. He is critical,\" a source told on Thursday. Congress president Rahul Gandhi will also visit AIIMS where former Prime Minister Atal Bihari Vajpayee is admitted, reported. BJP President Amit Shah arrived at AIIMSon Thursday morning where former prime minister Atal Bihari Vajpayee is admitted.Union home minister Rajnath Singh will visit ailing Vajpayee at AIIMS at around 10.30 am on Thursday, reported. Meanwhile,West Bengal chief minister MamataBanerjee will fly to Delhi today to check on AtalBihari Vajpayee at AIIMS. Atal Bihari Vajpayee is under the supervision of DrRandeep Guleriawho is currently the director of AIIMS. Dr Guleria has been thepersonal physician of Vajpayee for over three decades. A team of doctors from the nephrology, gastroenterology, pulmonology and cardiology departments is keeping round-the-clock check on the ailing leader, reported Former Prime Minister Atal Bihari Vajpayee is critical and has been put on life support system after his health deteriorated in the last one day, AIIMS said in a statement on Wednesday night.Vajpayee, a diabetic, has only one functional kidney. He had suffered a stroke in 2009 that weakened his cognitive abilities. And subsequently, he developed dementia, according to \"Former Prime Minister Shri Atal Bihari Vajpayee has been admitted for the last nine weeks at AIIMS. Unfortunately his condition has worsened over the last 24 hours. His condition is critical and he is on life support system,\" Dr Aarti Vij said in a press release.According to reports, another medical bulletin on AtalBihari Vajpayee'shealth is expected to be released by AIMS in an hour. Vajpayee was admitted at the AIIMS on 11 June with a kidney infection, urinary tract infection, low urine output and chest congestion. Vajpayee, a diabetic, has only one functional kidney, reports Vajpayee also suffered a stroke in 2009. Prime Minister Narendra Modi visited AIIMS Wednesdayevening to inquire about Vajpayee'scondition.Modi reached the hospital at around 7.15 pm and spent about 50 minutes there. Vajpayee's care team at AIIMS is led by Dr Randeep Guleria, a renowned pulmonologist and Director of AIIMS. Guleria has worked as personal physician to Vajpayee for over three decades. is reporting that a stomach infection has gotten worse for Vajpayee. AIIMS did not mention specifics but the storyline remains the same: \"Unfortunately, his condition has worsened over the last 24 hours. His condition is critical and he is on life-support system,\" AIIMS said. Born 25 December 1924, Vajpayee served three times as India's prime minister, first for a term of 13 days in 1996, and then from 1998 to 2004. He was elected to the Lok Sabha ten times and twice to the Rajya Sabha. Vajpayee was the first non Congress prime minister to serve a full five-year term. At age 93, Vajpayee is currently the oldest living former Indian Prime Minister. #EXCLUSIVE - “I will only say that he is very critical and we are all praying for him and that’s all. I met whosoever…” @drharshvardhan to @Runjhunsharmas upon visiting former Prime Minister #AtalBihariVajpayee in #AIIMS , New Delhi. pic.twitter.com/W9GHsIBD8Y — News18 (@CNNnews18) August 15, 2018 In 1996, Vajpayee was sworn in as India's 10th prime minister but the BJP couldn't cobble together a majority. Vajpayee resigned after 13 days. After the fall of the two United Front governments between 1996 and 1998, the 1998 general elections saw a bloc of political parties joining the BJP to form the National Democratic Alliance (NDA), and Vajpayee was sworn in as PM for the second time. This NDA government lasted 13 months until mid-1999 when the All India Anna Dravida Munnetra Kazhagam (AIADMK) under Jayalalithaa withdrew its support. In the 1999 general elections, the BJP-led NDA won 303 seats out of the 543 seats in the Lok Sabha. On 13 October 1999, Vajpayee took oath as PM for the third time.",
"description": "Atal Bihari Vajpayee dead; latest updates: UPA chairperson Sonia Gandhi described former prime minister Atal Bihari Vajpayee as a \"towering figure\" who stood for democratic values and demonstrated this commitment in all his acts. She also paid last respects at Vajpayee residence in Delhi. The Pakistani government condoled the death of former prime minister Atal Bihari Vajpayee. \"He was a renowned statesman who contributed to bringing a change in India-Pakistan relations and remained key supporter of SAARC and regional cooperation for development,\" it said in a statement. In an address from Atal Bihari Vajpayee's residence, Prime Minister Narendra Modi remembered the late prime minister as a father figure. \"Whenever he met me, he would hug me like a father. For me, the void he has left can never be filled. He made BJP's ideology reach every corner of the country. It's because of him that BJP has come this far.\" Speaking at Atal Bihari Vajpayee'sresidence in Delhi, BJPchief AmitShah said that Atal Bihari Vajpayee's mortal remains will be kept at his residence till Friday morning. \"His body will be taken to BJP headquarters at 9 am on Friday. At 1 pm, the funeral procession will begin. The last rites cermony will be held at Smriti Sthal at 4 pm,\" he said.",
"time_scraped": "2018-08-19 01:02:48.746550",
"article_id": "4973541",
"article_category": "India",
"image_details": []
}