{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-will-be-remembered-for-disrupting-cold-war-order-sowing-foreign-policy-seeds-for-future-4974491.html",
"title": "Atal Bihari Vajpayee will be remembered for disrupting Cold War order, sowing foreign policy seeds for future",
"date_published": "2018-08-16T18:52:11+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Vajpayee-Clinton-380-Getty.jpg",
"https://images.firstpost.com/wp-content/uploads/2016/05/Pokhran-II-reuters.jpg"
],
"article_body": "India's foreign policy continues to be one of the most fascinating segments of the country's governance since Independence, particularly given the several twists and turns it has endured. Through the Non-Aligned Movement, past Cold War equations and an enduring friendship with the USSR/Russia, through wars with Pakistan and China (followed by theon-off thaw with China), and all the way to the manner in which India-US relations have transformed, there's hardly a dull chapter in India's external affairs, and plenty of people to whom it owes its success. That said, any examination of India's foreign policy would be incomplete — starkly so — unless we look at how instrumental the late Atal Bihari Vajpayee was in key areas that have gone on to define the way India interacts with the world. As Minister of External Affairs Vajpayee took office asMinister of External Affairs in the Morarji Desai Cabinet on 26 March, 1977. It was that year at the UN General Assembly that he became the first person to address the world body in Hindi . An indication of how ahead of his time—or alternately how certain central aspects of Indian foreign policy endure despite numerous regime changes—the speech was, lies in Vajpayee's reference to \" \". The notion that the 'world is one family' remains a regular aspect of Prime Minister Narendra Modi's public addresses overseas as well. File image of Atal Bihari Vajpayee and Bill Clinton. Getty Images Another notable aspect of Vajpayee's tenure as foreign minister was his commitment to rebuilding India-China relations that had taken a beating following the 1962 war between the two countries and Beijing's support to Islamabad in the 1965 India-Pakistan War. With that in mind, Vajpayee paid the Chinese capital a visit and set the wheels in motion for the reestablishment of diplomatic relations between the two Asian countries. It is also believed to have been his idea for the two countries to list their differences — including each country's idea of where the border lies — so that these could be addressed through consultation groups. India as a nuclear power The Pokhran-II tests on 1998 — in whichIndia announced on the world stage that it was a nuclear power — were as much an exercise in boosting India's defensive capabilities as one in foreign policy. The sanctions that flew swiftly following the 14 May, 1998, tests were testament to that fact. \"India is now a nuclear weapons state... We have the capacity for a big bomb now. Ours will never be weapons of aggression,\" said Vajpayee at the time , and stated that India's would be a 'no first use' policy — something our neighbour to the northwest has staunchly chosen not to espouse. This supposed 'act of aggression' — viewed as it was in certain parts of the world — took place over two decades ago and in the time since, India has never wavered on 'no first use' and never threatened any State with nuclear weapons. This serves as a vindication of Vajpayee's words that India's nuclear arsenal would never be weapons of aggression. Relations with the US Among the countries that sanctioned India the heaviest following Pokhran-II was the US. Bilateral relations were at a low — perhaps not quite as low as 1971 when Richard Nixon sent the US' 7th Fleet to the Bay of Bengal to attack the Indian Army during the Bangladeshi War of Liberation; but still pretty bad. It is therefore all the more astonishing thatunder two years after the nuclear tests, Vajpayee's government had invited then US president Bill Clinton to India. And the Arkansas-born president went on to make the first State visit bya US president in 22 years (Jimmy Carterhad visited in 1978). Two things were happening simultaneously — evident in the signing of the landmark agreement titled, : The gradual dissolution of Cold War hardlines and the equally gradual formation of post-Cold War partnerships. Clinton signalled Washington's shift from its close ties with Islamabad, while Vajpayee showed India's willingness to no longer be as reliant as before on Russia. It was that landmark document that laid the platform for his successors Manmohan Singh and Modi to build on and turn the bilaterals into one of the most robust ones in India's foreign policy network.Of course, Donald Trump might have a thing or two to say/do about it. Relations with China History has not judged Vajpayee's outreach to China in as positive a light as the outreach to the US— with one publication describing the former prime minister as \" a bull in a China shop \". However, it's worth looking at his role in setting out a structure for New Delhi and Beijing to arrive at an understanding. As prime minister, Vajpayee was invited by then premier Wen Jiabao in 2003 for a milestone State visit and it culminated in the signing of a Declaration on Principles for Relations and Comprehensive Cooperation File image of Atal Bihari Vajpayee, George Fernandes, APJ Abdul Kalam and others after Pokhran-II. Reuters Within this text, were the lines: \" .\" And since then, all sorts of ministerial and special representatives' consultations have been put in place between the two countries, not to mention the array of multilateral institutions that number both countries as members. Relations with Pakistan It is perhaps Vajpayee's hand in this particular bilateral that history will remember most clearly in the decades to come. The former prime minister saw peace with Pakistan as a key step in resolving the Kashmir conflict, and made it a priority. On 19 February, 1999, Vajpayee was among the passengers on the Delhi-Lahore bus at the invitation of his Pakistani counterpart Nawaz Sharif and proceeded to sign the Lahore Declaration . The 2001 Agra Summit came as a breath of fresh air and a new hope for peace following the Kargil War (more on this later). And following a spell of tensions with Sharif's successor General Pervez Musharraf, Vajpayee called for the resumption of bilateral talks in January 2004. In fact, another facet of his policy towards Pakistan was evident in his message to Sourav Ganguly's Indian cricket team ahead of its historic 2004 tour of Pakistan.Vajpayee's wordswerenotexhortations of \"Bleed Blue\" or \" Pakistan \" or anything of the sort. He simply told Ganguly and his cohorts, \" (go and win hearts)\", demonstrating how even as the wounds of 1999 Kargil War were still healing, here was a man capable of drawing distinction between sports and politics. That said, and on the topic of 1999, if anyone was under the impression that Vajpayee was soft on Pakistan, his unwavering and firm response to Musharraf's aggression in Kargil proved otherwise. Southeast Asia Elsewhere, while Vajpayee did not himself create India's 'Look East' policy — the credit for that goes to PV Narasimha Rao, he did infuse it with energy and an widening of India-ASEAN linkages. No longer was the relationship purely based on economics and trade. A more expansive agenda that included connectivity, maritime security and jointHumanitarian Assistance And Disaster Relief operations was adopted and pursued. Subsequent prime ministers have sought to and successfully pushed it forward, with Modi's 'Act East' the most recent avatar of the policy. Ultimately, a lot of the fruit of Vajpayee's labour in the realm of foreign policy is being borne today/will be borne in the years to come. His disruption of the Cold War order and broadening of India's international relations horizons were responsible for sowing foreign policy seeds that remain the former prime minister's biggest contribution to India's foreign policy.",
"description": "India's foreign policy continues to be one of the most fascinating segments of the country's governance since Independence, particularly given the several twists and turns it has endured. Through the Non-Aligned Movement, past Cold War equations and an enduring friendship with the USSR/Russia, through wars with Pakistan and China (followed by theon-off thaw with China), and all the way to the manner in which India-US relations have transformed, there's hardly a dull chapter in India's external affairs, and plenty of people to whom it owes its success. That said, any examination of India's foreign policy would be incomplete — starkly so — unless we look at how instrumental the late Atal Bihari Vajpayee was in key areas that have gone on to define the way India interacts with the world. As Minister of External Affairs Vajpayee took office asMinister of External Affairs in the Morarji Desai Cabinet on 26 March, 1977. It was that year at the UN General Assembly that he became the first person to address the world body in Hindi",
"time_scraped": "2018-08-17 14:40:19.983069",
"article_id": "4974491",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Vajpayee-Clinton-380-Getty.jpg",
"path": "full/14ff44514bb81cc70238e4f2aead8f38e30f5229.jpg",
"checksum": "233e2fef82eee9b30defa7ce49cdf00a"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2016/05/Pokhran-II-reuters.jpg",
"path": "full/56675d6665f9b9596e425d978ed93e7945a3a121.jpg",
"checksum": "52610eb061ecda4c3832e0f2d13b43fb"
}
]
}