{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-how-the-former-pm-cemented-indias-position-as-a-nuclear-power-with-pokhran-ii-in-1998-4974611.html",
"title": "Atal Bihari Vajpayee passes away: How the former PM cemented India's position as a nuclear power with Pokhran-II in 1998",
"date_published": "2018-08-16T19:16:15+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Pokhran_Twitter-Fadnavis-825.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Vajpayee-Pokhran_Twitter-825.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Pokhran_fadnavis-Twitter-825.jpg"
],
"article_body": "\"The answer to an atom bomb is an atom bomb, nothing else.\" Rajya SabhaMP and Bharatiya Jana Sangh (later Bharatiya Janata Party) leader Atal Bihari Vajpayee saidtheaforementioned words in the Parliament in 1964 after the People's Republic of Chinadetonated a 16-kilotonbomb, its first nuclear test , on 16 October, 1964, to become the fifth nation in the world to join the exclusive nuclear-armed State club. The late leader'swords were notnew at the time, for the Bharatiya Jana Sangh had profusely expressed its support tomaking India a nuclear-armed nation as part of its \"Hindu nationalist\" agenda. The statement was met with thunderous approbation and was crucial in a demoralised time, where India had suffered a humiliating defeat to China two years earlier, in the 1962 war, under Jawaharlal Nehru's leadership. Thrity-four years later, Vajpayee's words took concrete shape and shook the world when India conducted nuclear tests and emerged as a nuclear power with Operation Shakti in Pokhran in 1998. File image of the crater after the underground nuclear tests on 11 May, 1998. Twitter @Dev_Fadnavis The Jana Sangh and Vajpayee's commitment to nuclear research was so colossal that in 1969, economist andparty member Subramanian Swamy published a comprehensive study on Indian nuclear strategy titled ' Systems Analysis of Strategic Defence Needs in the . In it, Swamy argued that while India could be faced with a nuclear threat from China, other superpowers or nuclear nationsaimedto keep India from acquiring such arsenal as it would diminish their power. \"We may be faced with a nuclear threat from China and be without help because a direct confrontation among the superpowers which have nuclear capability is impossible and has been made remote by mutual agreements among them. Also, it is in the superpowers' interest to keep other countries like India from acquiring nuclear defence capability as it would reduce their own manoeuvrability and power,\" he wrote in the abstract of the paper Whenerstwhile prime minister Indira Gandhi conducted the Pokhran-I test in 1974 on Buddha Purnima, she called it a \"peaceful nuclear explosion\" to pacify the western powers and avoid the threat of sanctions from them ( it didn't work ). For more than two decades after that, subsequent prime ministerssuch as PV Narasimha Rao attempted to revive nuclearresearch, only to be thwarted by American surveillance satellites and threat of sanctions. In 1995, Rao approved a nuclear test, but had to abort it after the CIA detected suspicious movement at Pokhran. A subsequent report on 15 December, 1995, on the same sent alarm bellsringing through the power corridors of Washington, compelling US Ambassador to New Delhi Frank Wisner to return to New Delhi with photographs of the hole being dug at the test site and caveats of impending sanctions if India went ahead with it. Just before elections in 1996, Rao again tried to conduct nuclear tests, but a courtesy call from CIA officials put an end to that as well. Vajpayee's first steps towards nuclear testing That year in May,Vajpayee came to power as the head of a rocky coalition government and took the first steps towards nuclear testing. He called his private secretary Shakti Sinha and asked him to locate chief scientific adviser Dr APJ Abdul Kalam,who was also the secretary of the Defence Research Development Organisation (DRDO). However, before the preparations could take shape, Vajpayee's government fell within a mere 13 days.This was also before the Comprehensive Test Ban Treaty (CTBT) was ratified by 149 countries at the United Nations. File image of former prime minister Atal Bihari Vajpayee with Dr APJ Abdul Kalam at Pokhran. Twitter @igautamshah Subsequent governments headed by HD Deve Gowda and IK Gujral did not bother with the nuclear programme, and the plans were put in cold storage. Before Vajpayee and Narasimha Rao, former prime minister Rajiv Gandhi in 1998 hadauthorised PK Iyengar, chairman of the Atomic Energy Commission, and DRDO chief VS Arunachalam, to start producing a limited number of weapons. This was after Gandhi was reportedly certain that Pakistan possessed more than one nuclear weapon, while India had none, according to an report Bhabha Atomic Research Centre directorAnil Kakodar, who was involved in the 1974 and 1998 nuclear tests, later told The Indian Express that one of the reasons conductingthe nuclear testswere important for Indiawas that post-1974, Chinahad begun sharing technology and materials with Pakistan. \"If India had to carry on with its business, including the business of developing itself, it could not possibly be doing under the threat of two nuclear adversaries. We had to have a deterrent,\" he said in the interview. When the BJP government came back to power in March 1998, with Vajpayee at its helm again, theparty veteran and prime ministerbegan laying the ground for the nuclear tests. On 8 April, he summonedDepartment of Atomic Energy (DAE) chiefR Chidambaram and DRDO chief APJ Abdul Kalam to give them the thumbs-up for the tests, reported .Principal secretary Brajesh Mishra and Vajpayee's closest aide, was responsible for conducting the entire operation from the Prime Minister's Office. The entire operation was conducted in such high secrecy that nobody except the aforementioned and home minister LK Advani knew about it. Defence minister George Fernandes was told about the tests on 9 May. The next day, the three service chiefs and foreign secretary were informed. On the morning of 11 May ,members of the Cabinet Committee on Security were formally informed about it. May 1998 Pokhran was host to an unusual set of guests in the balmy month of May 1998. Along with Kalam and Chidambaram,director of test sites preparation Dr K Santhanam and a team of nuclear scientists and engineers movedat night to avoid the prying eyes ofUS spy satellites so that drilling for a deep tunnel could be done when they were turned the other way, according to The Quint They wore ill-fitting army uniforms and assumed false identities to disguise themselves from prying villagers. The scientists and army worked at night to avoid detection andvisited Pokhran separately. Bomb shafts were dug under camouflage and the dug out sand placed in dune shapes to avoid detection. The nuclear devices were also flown and driven in from different places, according to the report. File image of Dr APJ Abdul Kalam and other nuclear scientists in disguise at the Pokhran test site. Twitter @Dev_Fadnavis 11 May, 1998: D-day After the wind died downand under cloudy skies, at 3.45 pm, three devices —thermonuclear device (Shakti I), the fission device (Shakti II), and a sub-kiloton device (Shakti III) — were detonated on 11 May, which also happened to be Buddha Purnima. Thanks to the weather condition, US satellites could detect nothing. Later in the day, Vajpayee,the weeks-oldgovernment, announced the news to the world. \"Measurements have confirmed that there was no release of radioactivity into the atmosphere. These were contained explosions like in the experiment conducted in May 1974. I warmly congratulate the scientists and engineers who have carried out the successful tests. Thank you very much indeed,\" he said, concluding his statement. Principal secretary Mishra later said''that India has a proven capability for a weaponised nuclear programme.'' On the other side of the world, USdeputy secretary of state, Strobe Talbott found out about India's entry into the nuclear weapons club from Two days later, on 13 May, two more sub-kiloton devices,Shakti IV and V, were detonated. International outrage The day after Vajpayee's press conference, The New York Times ran a story with this headline: \"India sets 3 nuclear blasts, defying a worldwide ban; tests bring a sharp outcry\".The Clinton Administration condemned the tests and said it was \"deeply disappointed\" and subsequently slapped sanctions against India Britain conveyed its \"dismay\" and Germany called it\"a slap in the face\" for the countries that ratified CTBT and the then-UN secretary general Kofi Annan issued a statement expressing his \"deep regret\". Back home, BJP bathed in triumphant glory, while the Opposition sat stunned. BJP general secretary M Venkaiah Naidu said all those who did not hail the tests were \"unpatriotic\", reported India Today Congress president Sonia Gandhi issued a statement 10 days later and said that real strength lay in restraint and \"not inthe display of The Left slammed the government and accused them of\"trying to equate the bomb with patriotism and whip up a jingoistic fervour\". Addressing the Lok Sabha in the Parliament later on, Vajpayee defended his actions and asked why shouldn't the country be self-sufficient in matters of national security. \"I was in the House in 1974, when under Indira Gandhi's leadership, nuclear tests were conducted. We had welcomed it, despite being the Opposition, because it was done for national security. What danger was there at that time? Should we begin to prepare ourselves only when we are posed with danger? If we are well-prepared, any danger in future can be taken care of,\" he said in the Lok Sabha. Vajpayeeclarified India's position on use of nuclear weapons: \"No-first use. We also said, those who don't have weapons, we will not use it against them.\" \"Pokhran-II was not done to boast our valour.Our policy is that our country should have a minimum and credible deterrent so that no external power will ever dare threaten us,\" he said, adding that atomic weapons could be used for a country's safety and security too. Following the Pokhran-II tests, in a letter to US president Bill Clinton , Vajpayee expressed his fears about having nuclear-armed neighbour and the rationale behind conducting the nuclear tests. Without directly referring to China, Vajpayee wrote, \"We have an overt nuclear weapon state on our borders, a state which committed armed aggression against India in 1962. Although our relations with that country have improved in the last decade or so, an atmosphere of distrust persists mainly due to the unresolved border problem.\" He further explained that China attempted to turn its other neighbour, Pakistan, into acovert nuclear weapons state. Vajpayee also clarified that tests were limited in number and posed no danger to any country with no ill-feelings towards India. \"We value our friendship and cooperation with your country and you personally. We hope that you will show understanding of our concern for India's security.I assure you that India will continue to work with your country in a multilateral or bilateral framework to promote the cause of nuclear disarmament,\" the letter read.",
"description": "\"The answer to an atom bomb is an atom bomb, nothing else.\" Rajya SabhaMP and Bharatiya Jana Sangh (later Bharatiya Janata Party) leader Atal Bihari Vajpayee saidtheaforementioned words in the Parliament in 1964 after the People's Republic of Chinadetonated a 16-kilotonbomb, its first nuclear test , on 16 October, 1964, to become the fifth nation in the world to join the exclusive nuclear-armed State club. The late leader'swords were notnew at the time, for the Bharatiya Jana Sangh had profusely expressed its support tomaking India a nuclear-armed nation as part of its \"Hindu nationalist\" agenda. The statement was met with thunderous approbation and was crucial in a demoralised time, where India had suffered a humiliating defeat to China two years earlier, in the 1962 war, under Jawaharlal Nehru's leadership.",
"time_scraped": "2018-08-17 14:40:14.604482",
"article_id": "4974611",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Pokhran_Twitter-Fadnavis-825.jpg",
"path": "full/0b1d77eb80cd7ff9236231ae2bca89528b57c2aa.jpg",
"checksum": "9959f01bde0ef0d48a9cfdd8a5f990c0"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Vajpayee-Pokhran_Twitter-825.jpg",
"path": "full/ab37ca10de84f3f480d82403efa0eafaf8d999a0.jpg",
"checksum": "4547ace65f07668e6e35a0a32571f102"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Pokhran_fadnavis-Twitter-825.jpg",
"path": "full/3b0f01f35ab0c035def2d96b56721a741d579aeb.jpg",
"checksum": "2cd7339137d0bc8842c88afa8bcf5b65"
}
]
}