{
"source_article_link": "https://www.firstpost.com/india/crop-munching-armyworm-which-wrought-havoc-in-africa-detected-in-karnataka-pest-threatens-millions-of-farmers-in-asia-says-un-4974261.html",
"title": "Crop-munching armyworm, which wrought havoc in Africa, detected in Karnataka; pest threatens millions of farmers in Asia, says UN",
"date_published": "2018-08-16T08:44:22+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Armyworm_Reuters_380.jpg"
],
"article_body": "London: A voracious crop-chomping pest which has wrought havoc in Africa could threaten millions of farmers in Asia, UN experts warned recently, as India battles the continent’s first reported infestation of fall armyworm. The pest — a moth which devours crops in the caterpillar stage of its life cycle — prefers maize but can feed on some 80 crops, including rice, vegetables, groundnuts and cotton. A crop-eating armyworm is seen on a sorghum plant at a farm in Limpopo. Reuters \"Fall armyworm could have a devastating impact on Asia’s maize and rice producers.... This is a threat that we cannot ignore,” the Food and Agriculture Organisation’s (FAO) regional representative Kundhavi Kadiresan said in a statement. The moth can fly 100 kilometres a night and the female can lay up to 1,000 eggs in her lifetime, the FAO said. The Indian Council of Agricultural Research sent out a pest alert on 30 July after fall armyworm was detected in Karnataka. Indian media reported that the pest was spreading at an alarming rate in the region. The FAO said fall armyworm could threaten millions of small-scale farmers who depend on their crops for food as well as income. Southern China and Southeast Asia are at greatest risk due to their climate, it added. More than 200 million hectares of maize and rice are grown annually in Asia, which produces most of the world’s rice, the FAO said. China is the second largest maize-producing country in the world behind the United States. Fall armyworm, which is native to tropical and subtropical regions of the Americas, has spread rapidly across Africa since being detected in West Africa in early 2016. Almost all sub-Saharan countries have reported infestations which have affected millions of hectares of crops and threatened the food security of more than 300 million people, according to the FAO. The UN agency said it was offering guidance to Asian governments and farmers on how to identify and deal with fall armyworm. In Africa, FAO field schools have trained thousands of farmers to recognise and report infestations. Farmers have been taught how to crush the pest by hand and curb its spread with bio-pesticides made from plants like neem and tobacco or by using natural predators like ants. Other remedies include applying ash, lime, sand or soil to infested plant parts.",
"description": "London: A voracious crop-chomping pest which has wrought havoc in Africa could threaten millions of farmers in Asia, UN experts warned recently, as India battles the continent’s first reported infestation of fall armyworm. The pest — a moth which devours crops in the caterpillar stage of its life cycle — prefers maize but can feed on some 80 crops, including rice, vegetables, groundnuts and cotton. A crop-eating armyworm is seen on a sorghum plant at a farm in Limpopo. Reuters \"Fall armyworm could have a devastating impact on Asia’s maize and rice producers.... This is a threat that we cannot ignore,” the Food and Agriculture Organisation’s (FAO) regional representative Kundhavi Kadiresan said in a statement.",
"time_scraped": "2018-08-17 14:40:16.806706",
"article_id": "4974261",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Armyworm_Reuters_380.jpg",
"path": "full/9d83348b888cb883a318e8b124657ad088c236de.jpg",
"checksum": "23a282bd3173488cfb53c55f8fae9d6d"
}
]
}