{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-at-93-from-political-aide-to-trusted-friend-lk-advani-shared-a-rare-bond-with-ex-pm-4975331.html",
"title": "Atal Bihari Vajpayee passes away at 93: From political aide to trusted friend, LK Advani shared a rare bond with ex-PM",
"date_published": "2018-08-16T18:04:27+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2015/07/Advani-Vajpayee_AFP.gif"
],
"article_body": "LK Advani and Atal Bihari Vajpayee shared a rare friendship in the political circle, with Advani describing Vajpayee as the country’s most outstanding prime minister.They entered politics almost at the same time decades ago and remained each other’s trusted advisor and friend ever since. Advani served as India’s deputy prime minister and home minister in the Vajpayee-led government of the National Democratic Alliance between 1998-2004. Advani, in his autobiography, talks about hispolitical journey in Delhi where he started work as a political aide to Vajpayee, who had just been elected to the Lok Sabha for the first time. \"It is during these two decades that I gained advanced experience in political organisation, political strategy and leadership,\" says Advani. LK Advani and AB Vajpayee in a file photo. AFP Vajpayee and Advani, whose friendship goes back to the 1950s, are credited to have helped build the Bharatiya Jana Sangha in its nascent years. The BJP was formed on 5-6 April 1980, after it broke away from the Janata Party. The Janata Party had been formed a few years earlier in 1977, with the merger of Congress O, Bhartiya Lok Dal, the Socialist Party and the Jana Sangh (the BJP's earlier avatar), with the idea of taking on Indira Gandhi and her Congress party in the 1977 Lok Sabha elections. Advani explains the stress of the coalition in his autobiography, “The stress from the beginning was not on harking back to our Jana Sangh past but on making a new beginning.” The new beginning happened primarily because both Vajpayee and Advani had been influenced a lot by Jaiprakash Narayan, who was the main architect behind the Janata Party. Throughout his autobiography, Advani praises Vajpayee's leadership. \"Some of them, such as the bold decision to make India a nuclear power and our sincere efforts to normalise relations with Pakistan in spite of the latter’s betrayal, will have a permanent place in our country’s history. History will record that India became a stronger nation, and a more self-confident nation, under Atalji’s visionary leadership,\" he said. According to ,Advani said that Vajpayee's six years as prime minister were better for India's development than the long rule of Congress' prime ministers Jawaharlal Nehru and Indira Gandhi. In May 2013, Advani had also released a blog on the BJP’s website, describing Vajpayee as the country’s most outstanding prime minister. In his blog criticising the Manmohan Singh government, he praises Vajpayee's ability to create three new states without any disturbance. \"Under Vajpayee ji the NDA divided three major States – Madhya Pradesh, Uttar Pradesh and Bihar and created three new States – Chhattisgarh, Uttarakhand and Jharkhand without even a ripple of disturbance.\" In an interview to , Advani termed Vajpayee a \"great consensus builder\" and that his legacy of consensus building was very important for all parties. Advani said he had written to then prime minister Manmohan Singh, saying Vajpayee deservesBharatRatna, the highest civilian honour, and that he would feel \"grateful and happy\" if the government acceded to his request. The letter listed 10 reasons for giving the honour to Vajpayee. \"He (Manmohan Singh) may have considered it or not but I feel I would not have written such a letter today. It would seem I was demanding it as our government is in place,\" he said. Speaking to CNN-IBN Advani said, \"In Vajpayee's entire tenure as PM there is not one single aspect which I can regard as been a blot on him in his career.\" He also spoke about how heconceded being the prime ministerial candidate for Vajpayee. \"Very often it is thought that I conceded the space, but it was his natural space. I always regarded him as my leader. I, in fact, have been saying now these days after these interviews that for me he was a role model. How the leader of the country should be like. Both in respect of his attitude to issues as well as in respect above all his absolute modesty and humility even when he could credit himself with many achievements,\" he said. Advaniin one of his blogs in 2010, had mentioned that how under the then UPA government the country's equation with Pakistan was in shambles. He then recollected how Vajpayeeunder his regime had successfully led the Pakistan Army general to surrender before him, hailing his confidence and the stand he too on Kashmir. India’s Independence was accompanied by the creation of Pakistan. Partition had traumatic consequences: the killing of lakhs of innocent men, women and children, and the uprooting of crores. Since Independence, therefore, a vital touchstone for judging Government of India’s handling of external affairs has been its Pakistan Policy.Only a government confident of itself could have responded to all this in the manner in which Vajpayee did. He first had the Army use its full might to quell the Kargil operation, which was the General’s own adventure. And he followed it up by another brave move: an invitation to the General for talks at Agra. It was this firm stand that made the General ultimately discard his Agra attitude and at Islamabad in January 2004 sign a joint statement with Vajpayee that “he will not permit any territory under Pakistan’s control to be used to support terrorism in any manner ”. As per a reportby Mid Day , Advani had once revealed that during their younger days, the two would often go to eat ‘ on the streets, with Advani driving the scooter and Vajpayee riding pillion. He reportedly said, \"And I remember those days, Rivoli and Regal (cinema halls), in the middle was a We would go there and have Those days, I would drive the scooter and he (Vajpayee) would ride pillion. I was not particular about But he (Vajpayee) would sit beside the and eat, also \" The former prime minister Atal Bihari Vajpayee passed away on Thursday in All India Institute of Medical Sciences (AIIMS) hospital in Delhi. He was admitted to AIIMS on 11 June and his health deteriorated on Wednesday. Advani and daughter Pratibha Advani visited Vajpayee on Thursday morning. Advani had been a regular visitor to the hospital. Vajpayee had been undergoing treatment at AIIMS for akidney tract infection, urinary tract infection, low urine output and chest congestionfor the past nine weeks.The 93-year-old BJP leader was a diabetic and had only one functional kidney.",
"description": "LK Advani and Atal Bihari Vajpayee shared a rare friendship in the political circle, with Advani describing Vajpayee as the country’s most outstanding prime minister.They entered politics almost at the same time decades ago and remained each other’s trusted advisor and friend ever since. Advani served as India’s deputy prime minister and home minister in the Vajpayee-led government of the National Democratic Alliance between 1998-2004. Advani, in his autobiography, talks about hispolitical journey in Delhi where he started work as a political aide to Vajpayee, who had just been elected to the Lok Sabha for the first time. \"It is during these two decades that I gained advanced experience in political organisation, political strategy and leadership,\" says Advani. LK Advani and AB Vajpayee in a file photo. AFP Vajpayee and Advani, whose friendship goes back to the 1950s, are credited to have helped build the Bharatiya Jana Sangha in its nascent years. The BJP was formed on 5-6 April 1980, after it broke away from the Janata Party. The Janata Party had been formed a few years earlier in 1977, with the merger of Congress O, Bhartiya Lok Dal, the Socialist Party and the Jana Sangh (the BJP's earlier avatar), with the idea of taking on Indira Gandhi and her Congress party in the 1977 Lok Sabha elections.",
"time_scraped": "2018-08-17 14:40:51.535011",
"article_id": "4975331",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2015/07/Advani-Vajpayee_AFP.gif",
"path": "full/eb1bbee8dc582e1afe0d4c0da2ca48ac0f365f93.jpg",
"checksum": "d0fab4909fd085439ec92b705344906d"
}
]
}