{
"source_article_link": "https://www.firstpost.com/india/nia-arrest-of-2-youths-for-is-links-another-case-of-guilt-by-association-demonisation-of-muslims-writes-markandey-katju-4975921.html",
"title": "NIA arrest of 2 youths for 'IS links' another case of guilt by association, demonisation of Muslims, writes Markandey Katju",
"date_published": "2018-08-16T12:08:14+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/muslims-afp1.jpg"
],
"article_body": "In Hyderabad, the National Investigation Agency (NIA) has arrested two Muslim youths , Mohammed Abdullah Basith (24) and Mohammed Abdul Qadeer (19) for \"allegedly conspiring to further the Islamic State (IS) ideology to carry out terrorist activities in India\". It is alleged that they were in touch with one Adnan Hassan who is facing trial in the 2016 IS module case. From what I could make out, this is just another instance of the doctrine 'guilty by association' which has been rejected and held invalid by the Supreme Court of India in , following its earlier decision in and several decisions by the US Supreme Court, such as Elfbrandt versus Russell In , Justice William Douglas of the US Supreme Court observed, \"(I)in days of great tension when feelings run high it is a temptation to take short cuts by borrowing from the totalitarian techniques of our opponents, but when we do so we set in motion a subversive influence that destroys us from within.\"Perhaps these youths will be released after spending 20 years in jail, during which they will have to undergo terrible torture, until they are ultimately found innocent by the court, as in the case of Nisaruddin Ahmed (who spent 23 years in jail before the Supreme Court found him innocent), Amir (who spent 14 years in jail before his acquittal) and several others.​ Representational image. AFP Many people have asked why Indian Muslims are silent despite lynchings and other atrocities against them. So let me attempt an answer. In one word, the answer is fear, but this has to be elaborated. We must first understand that secularism is a feature of modern industrial, not a feudal, society. India is still semi-feudal, as is borne out by the rampant casteism and communalism still prevalent in our society. No doubt we have provided for secularism in our Constitution, but that is only on paper. The truth is that most (not all) Hindus are communal as are most Muslims. This I can say from my personal experience. When I am with Hindu friends and relatives, and they are sure no Muslim is around, they often spout venom against Muslims, calling them fanatics and terrorists. When a Muslim is lynched, most Hindus are indifferent, and some even happy: \"One terrorist less\". There is an unwritten policy in the Indian police to recruit very few Muslims. For instance, as revealed in the reply to an RTI query, in the Uttar Pradesh Police, only two percent of sub-inspectors, three percent of head constables and four percent of constables are Muslims. This is negligible in a state that comprises 18 to 20 percent Muslims in its population. Now since the vast majority of policemen are Hindus, and since most Hindus are communal, and since the police is armed while most Muslims are not, it follows that Muslims are usually at the receiving end in most incidents eg the Batla House or Bhopal 'encounters'. What can unarmed people do when faced with an armed organisation? Who can fight the State? Also, since Muslims have been demonised as terrorists and fanatics, they are often falsely implicated in incidents of terrorism. When a bomb blast or such other incident takes place, the police is often unable to apprehend the real culprit. This is because criminal investigation is a science. In western countries, when a crime is committed, the police collects fingerprints, blood, hair, fibres etc from the spot and sends them to a laboratory for scientific tests, and only thereafter is the crime solved. On the other hand, in India, most policemen are neither trained in scientific investigation nor have the equipment for it, and yet there is pressure on them to solve the crime. So what do they do? They often apprehend some Muslim youths on mere suspicion, fabricate evidence against them and charge them. Their bail application is usually rejected as the public prosecutor informs the court that the accused is a dreaded terrorist, and the case lingers on for years. Often after 10 years or more the accused is found not guilty, but all these years he had to spend behind bars. Who will restore these years of his life ? So Muslims have learnt, as the Jews had learnt under Nazi rule, to be quiet. After all, what can they do? Who will hear them? The film accurately describes their plight. As the great Urdu poet Faiz wrote: \" \"",
"description": "In Hyderabad, the National Investigation Agency (NIA) has arrested two Muslim youths , Mohammed Abdullah Basith (24) and Mohammed Abdul Qadeer (19) for \"allegedly conspiring to further the Islamic State (IS) ideology to carry out terrorist activities in India\". It is alleged that they were in touch with one Adnan Hassan who is facing trial in the 2016 IS module case. From what I could make out, this is just another instance of the doctrine 'guilty by association' which has been rejected and held invalid by the Supreme Court of India in , following its earlier decision in",
"time_scraped": "2018-08-17 14:40:41.692616",
"article_id": "4975921",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/muslims-afp1.jpg",
"path": "full/1311938b0ee2eb45802a9967a22d0bbb23e3ff75.jpg",
"checksum": "3d2a777a946aeebc0ce12bf63f1b0a97"
}
]
}