{
"source_article_link": "https://www.firstpost.com/india/narendra-modi-discusses-kerala-flood-situation-with-pinarayi-vijayan-asks-ministry-of-defence-to-expand-relief-operations-in-state-4975101.html",
"title": "Narendra Modi discusses Kerala flood situation with Pinarayi Vijayan, asks Ministry of Defence to expand relief operations in state",
"date_published": "2018-08-16T10:27:40+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/NARENDRA-MODI_cr1.jpg"
],
"article_body": "New Delhi: Prime Minister Narendra Modi on Thursday morning spoke toKeralaChief Minister Pinaryi Vijayan to discuss flood situation in the state. He also asked the Defence Ministry to step up the rescue and relief operations across the state. File image. Reuters \"Spoke toKeralaCM Shri Pinarayi Vijayan again this morning. We discussed the flood situation in the state. Have asked the Defence Ministry to further step up the rescue and relief operations across the state. Praying for the safety and well-being of the people ofKerala,\" he tweeted. Keralahas been witnessing incessant rain since past few days, causing flooding and landslide in the state. So far, at least 67 people have lost their lives in the havoc. As the flood situation continues to grow worse in the state, rising level of water in Muttom Metro Yard area led to the suspension of train services at Kochi Metro on Thursday. Karnataka State Road Transport Corporation bus services have also been stopped from Chamarajanagar district for Tamil Nadu's Ooty andKerala's Kochi. Taking note of the crisis, Southern Naval Command has suspended all training activities to support in the flood relief operations as requested byKeralaState Disaster Management Authority (KSDMA). All resources have been mobilised for rescue and relief efforts in Ernakulam and Trichur cities in the state. Follow LIVE updates on Kerala rains.",
"description": "New Delhi: Prime Minister Narendra Modi on Thursday morning spoke toKeralaChief Minister Pinaryi Vijayan to discuss flood situation in the state. He also asked the Defence Ministry to step up the rescue and relief operations across the state. File image. Reuters \"Spoke toKeralaCM Shri Pinarayi Vijayan again this morning. We discussed the flood situation in the state. Have asked the Defence Ministry to further step up the rescue and relief operations across the state. Praying for the safety and well-being of the people ofKerala,\" he tweeted. Keralahas been witnessing incessant rain since past few days, causing flooding and landslide in the state. So far, at least 67 people have lost their lives in the havoc. As the flood situation continues to grow worse in the state, rising level of water in Muttom Metro Yard area led to the suspension of train services at Kochi Metro on Thursday. Karnataka State Road Transport Corporation bus services have also been stopped from Chamarajanagar district for Tamil Nadu's Ooty andKerala's Kochi.",
"time_scraped": "2018-08-17 14:40:46.995370",
"article_id": "4975101",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/NARENDRA-MODI_cr1.jpg",
"path": "full/74d247fa407f81ea4b6963c78b7dbce6b56509ed.jpg",
"checksum": "ad92f46665c62b613b286b5586e4e1c5"
}
]
}