{
"source_article_link": "https://www.firstpost.com/living/carnatic-artistes-targeted-for-choosing-christian-songs-on-the-difference-between-art-and-devotional-music-4976771.html",
"title": "Carnatic artistes targeted for choosing Christian songs: On the difference between art and devotional music",
"date_published": "2018-08-16T21:52:16+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/carnatic-singers-825.jpg"
],
"article_body": "The world of Carnatic music has been embroiled in a murky debate for the last few days over Carnatic singers singing Christian devotional songs. Social media has been rife with angry messages abusing and threatening these singers for being “Vatican stooges” and for helping evangelists in their alleged cause of conversion of Hindus into Christianity. Messages threatening to prevent them from performing, veiled and open threats of physical harm and unbridled verbal abuse have seen a couple of these singers yielding to the pressure. OS Arun is a popular singer of Carnatic music and devotional music, particularly known for the latter. When he was to give a performance of Christian devotional songs, all hell broke loose. He cancelled the show. Nithyashree Mahadevan, who sang an album of songs in praise of Christ, included one which starts with ' '. These words are similar to a great composition by the Carnatic composer Tyagaraja, which was written in praise of Rama – ! Everything else about the song, including the raga, is different. Nevertheless, there were angry charges of plagiarism. A rumour that the whole song had been plagiarised and that “Yesu” had been substituted for “Rama” throughout, raised the hackles of many. Nothing of that kind had happened, and yet, the singer apologised on social media in no uncertain terms and affirmed her strong Hindu affiliation. In an opposite reaction, TM Krishna, who recently performed in churches in a deliberate attempt to take Carnatic music to different venues, has declared that he is going to release one song every month in praise of Allah or Christ! Nithyashree Mahadevan and TM Krishna. Facebook While the din of angry posts about the singers continues, there have been calls on Facebook by musicians to unite against this “fascism”. Many are deeply disturbed by the idea of political or religious outfits presuming to decide what a Carnatic singer can and cannot sing. As professional musicians, it seems clear, they can choose to sing anything they want, so long as it is within the law of the country. The audacity of brazenly threatening a citizen for doing something perfectly legal is astonishing — even incomprehensible — and should not go unpunished in a democracy with law and order in place. Many are quick to blame the current political climate of Hindu intolerance. And there is certainly something in that. How does one have the temerity to create such unrest within a community and with such overt communal hues? Fascism begins like this. The secretary of a leading sabha, who does not wish be named, said that many organisers have decided to keep out of the debate. He confirmed that they had received many messages, from known and unknown persons, even anonymous messages, adding that considering the sheer amount of exaggeration, posturing and twisting of facts, it was pointless to enter the debate. “No moderate voice will be heard – you will be seen as belonging to one or the other camp,” he said. He said that the sabhas would not tolerate any Carnatic composition being tampered with; even substituting ‘Krishna’ for ‘Rama’ in a composition is not acceptable. He adds, “As for compositions on Jesus and Allah, if the audience accepts and enjoys it, then so be it. The audience for Carnatic music is typically conservative and may balk at hearing a on Allah, but who is to say!” While many in the Carnatic world find it appalling that singers should be threatened like this, a considerably large number of people have also expressed disquiet about this willingness to sing songs in praise of Christ. But why this disquiet now? Singers singing songs praising other deities is not a new phenomenon. MS Subbulakshmi has sung paeans on Allah. Singer Yesudas, a Christian, sings devotional songs in praise of Ayyapan or Krishna, which are huge hits. The context for the current controversy and disquiet among even mild, liberal Hindus is the aggressive nature of Christian proselytisation in Tamil Nadu. Approaching the poorer classes and lower castes, Christian zealots adopt many practices — some of them very questionable — to convert Hindus. Specifically, the worry and anger is over a rising and blatant appropriation of Hindu symbols, Hindu rituals etc. Well-known tunes of hymns in praise of Hindu deities have been foisted wholesale on hymns in praise of Christian deities — even the tune of the sacred ‘ ’ that was sung by MS Subbulakshmi. It is easy to see why this is being done. After all, converts need a world of rituals and symbols to relate to, and what is easier than appropriating familiar ones from the religion they leave behind? Contemporary conversion by Christian zealots, with intolerance at its heart, is a nasty business. Carnatic singers who sing Christian devotional songs are seen as willy-nilly contributing to conversion! However far-fetched this possibility seems, it is the perceived issue. One might understand the present issueas a conflation of two different genres of music — art music and religious music. Religious music has for its goal heightening religious sentiments: The performer and audience share a common faith and devotion, with the former leading the latter into a heady journey of religious ecstasy through music. Art music, on the other hand, is fundamentally artistic in intent. Though most of its compositions are religious in content and in praise of Hindu deities, Carnatic music is not religious music. Historically, the compositional forms of and which are romantic in theme (some border on the raunchy) have been sidelined in favour of the which is religious in content. In any case, artistic presentation of through compositions and improvisation is the main intent of Carnatic music, not evoking religious sentiments. Admittedly, the fact that most performers and audiences are also Hindu queers the pitch somewhat and both do find religious moments through this music. But to necessarily associate Carnatic music with Hindu sentiments is doing a disservice to the musical genre which, as one of the most sophisticated melodic systems in the world, has an appeal beyond its religious association. When a performer like OS Arun, who offers (Hindu) religious music in the above sense, decides to sing Christian songs, there is a tension, a conflating of roles. Had he wanted to include it as part of a Carnatic concert, as an artistic presentation rather than as a religious one, it might not have roused this rabble. The worry seems to be that Arun’s could be used as a tool for proselytising. Because what he offers is religious music, which is premised on a common faith binding the performer and audience. Of course, a Hindu religious fanatic may have no patience with such distinctions and would likely demand a blanket gag on Carnatic singers singing any song that praises other deities! Not since the days of Tamil Isai movement when the Carnatic world was divided between those who felt that compositions in Tamil should be prominently included in concerts and those who resisted this, has the atmosphere been so politicised and polarised. It is interesting that this issuetoo, revolved around compositions and their content. It had little to do with the artistic aspect of the music, as does the current issue. TM Krishna’s declaration that he would release one Carnatic song on Jesus or Allah every month was almost predictable, and, if successful, this could weaken the association of Carnatic music with Hinduism. Non-religious themes would be ideal, but populating it with compositions on other religious deities would also be a way forward — though one does wonder at the task of bringing out quality compositions month after month driven by an extra musical consideration. The aesthetic challenge of creating a corpus of compositions on Allah and Jesus, or on anything at all, and getting it accepted by audiences is not trivial. That Carnatic music consists predominantly of compositions on the Hindu pantheon is a historical and contingent feature, and obviously a troublesome one too. It need not define the music.",
"description": "The world of Carnatic music has been embroiled in a murky debate for the last few days over Carnatic singers singing Christian devotional songs. Social media has been rife with angry messages abusing and threatening these singers for being “Vatican stooges” and for helping evangelists in their alleged cause of conversion of Hindus into Christianity. Messages threatening to prevent them from performing, veiled and open threats of physical harm and unbridled verbal abuse have seen a couple of these singers yielding to the pressure. OS Arun is a popular singer of Carnatic music and devotional music, particularly known for the latter. When he was to give a performance of Christian devotional songs, all hell broke loose. He cancelled the show. Nithyashree Mahadevan, who sang an album of songs in praise of Christ, included one which starts with ' '. These words are similar to a great composition by the Carnatic composer Tyagaraja, which was written in praise of Rama – ! Everything else about the song, including the raga, is different. Nevertheless, there were angry charges of plagiarism. A rumour that the whole song had been plagiarised and that “Yesu” had been substituted for “Rama” throughout, raised the hackles of many. Nothing of that kind had happened, and yet, the singer apologised on social media in no uncertain terms and affirmed her strong Hindu affiliation.",
"time_scraped": "2018-08-17 14:40:53.215344",
"article_id": "4976771",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/carnatic-singers-825.jpg",
"path": "full/5262c1e80ce2f130deba49f2ab88d670e3e2c596.jpg",
"checksum": "4c7e87a2691702dc282b08173dc0f60c"
}
]
}