{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayees-insaniyat-jamhuriyat-kashmiriyat-is-the-foundation-for-peace-in-kashmir-4976011.html",
"title": "Atal Bihari Vajpayee's 'Insaniyat, Jamhuriyat, Kashmiriyat' is the foundation for peace in Kashmir",
"date_published": "2018-08-16T18:03:49+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/NawazSharif_Vajpayee_Reuters.jpg"
],
"article_body": "Former prime minister Atal Bihari Vajpayee, whose birthday on 25 December is celebrated as 'Good Governance Day', has been lauded for his policies on Kashmir since he became the prime minister for the first time in 1996. Vajpayee held the position of prime minister (the second time around) between 1998 and 2004. His approach towards addressing the Kashmir issue came to be called the Vajpayee Doctrine. It also included improving relations with neighbouring Pakistan. The Vajpayee doctrine on Kashmir first coined the slogan 'Insaniyat, Jamhuriyat, Kashmiriyat', which meant humanity, peace, and keeping the sanctity of the people of Kashmir. His doctrine aimed at achieving peace, progress and prosperity in the Valley. The doctrine received universal acclaim, and more consequentially, it was lauded by extremist elements in the state. File photo of former prime minister of India Atal Bihari Vajpayee and former prime minister of Pakistan Nawaz Sharif. Reuters Insaniyat, Jamhuriyat, Kashmiriyat Speaking in the Lok Sabha on 21 April, 2003 Vajpayee had defined his plan to deal with the complex issues concerning Jammu and Kashmir. He spoke of major economic projects in areas such as the development of road and rail infrastructure and promoting employment for the youth, noted Regarding relations with Pakistan Vajpayee had said, \"We have extended our hand of friendship to Pakistan. Let us see how Pakistan responds. Stopping cross-border infiltration and destruction of terrorist infrastructure can open the door for talks. Talks can take place on all issues including Jammu and Kashmir.” The former prime minister had further added that the gun could not solve problems. He had said, \"Issues can be guided by the three principles of insaniyat (humanism), jamhooriyat (democracy) and kashmiriyat (Kashmir’s legacy of amity).” The perspective was coined after the military face-off with Pakistan after the December 2001 terrorist attack on the Indian Parliament had ended. The article said, \"Back channel talks with Pakistan were under way, resulting in a ceasefire across the Line of Control in November 2003. In January 2004, India agreed to resume dialogue with Pakistan, following an assurance from President Pervez Musharraf that 'territory under Pakistan’s control' would not be used for terrorism against India. Dialogue was resumed only after this categorical assurance\". Lately, the media has been abuzz with different interpretations of his slogan. The term implied that India had a viable new strategy to ensure peace in the Valley. Unfortunately, the slogan disappeared after the fall of Vajpayee's government, until Prime Minister Narendra Modi brought it back into the public's consciousness in 2014. Modi said it was his 'mantra'. Bilateral talks with Pakistan A big part of Vajpayee's efforts to resolve the conflict in Kashmir, was to initiate bilateral dialogue with Pakistan. He aimed to keep third-party interventions out of the India-Pakistan equation. Vajpayee forwarded a hand of friendship based on reciprocity and mutual trust. He believed a collective fight against poverty and terrorism in the subcontinent would help to strengthenbonds between the two neighbours. In February this year, the then Jammu and Kashmir chief minister Mehbooba Mufti had appealed to Modi to initiate discussions with Pakistan once again to iron out the differences over Kashmir, which could result in peace for the conflict-torn state. She said, \"Dialogue with Pakistan is necessary if we are to end the bloodshed,\" in a tweet on 12 February. Mufti's hope that dialogue between the two neighbours would solve the long-standing dispute has been shared by leaders in Kashmir. The Abdullahs, Mufti's political rivals, have also demanded talks in the past. Mufti referred to the bilateral talks that Vajpayee participated in, during his tenure as the prime minister. The Agra Summit of 2001 was hailed as a breakthrough for peace between India and Pakistan. It was the cause for hope that resolution of the conflict was possible. reported thatthe then Pakistani president Musharraf had put forwarda 'four-point solution' to theunrest inKashmir. According to reports, the pointers were, in principle, acceptable to Vajpayee, butjust hours before the signing ceremony, thedeal did not come to pass. Vajpayee had also signed a Lahore Declaration with then prime minister Nawaz Sharif on 21 February 1999. As part of the declaration, Pakistan agreed to resolve all bilateral issues between the two countries, including the issue of Jammu and Kashmir in a peaceful manner. Vajpayee's bus service to Pakistan On 19 February, 1999, Vajpayee rode the bus to Pakistan on the Delhi-Lahore bus service called 'Sada-e-Sarhad', which means 'Call of the Frontier'. It was launched as a symbol of the efforts made by the Vajpayee government to initiate a peaceful equation with Pakistan. reported that Vajpayee made a visit to Minar-e-Pakistan where he re-affirmed India's commitment to the existence of Pakistan. His emotional speech in Lahore made Sharif say, \"Mr Vajpayee, now you can win elections even in Pakistan,\" according to the report. Even in the face of Pakistan's attack in Kargil between May and June 1999, Vajpayee did not terminate the bus service. The attack was successfully pushed back by the Indian armed forces. However, the service was suspended during tensions in the aftermath of the terrorist attack on the Indian Parliament on 13 December, 2001. Kashmir after Vajpayee On the 72nd Independence Day, Modi said that the BJP government would follow Vajpayee's perspective for peace in Kashmir. In his Independence Day address, Modi said that Vajpayee's vision of Insaniyat, Jamhuriyat and Kashmiriyat would be followed in Kashmir.",
"description": "Former prime minister Atal Bihari Vajpayee, whose birthday on 25 December is celebrated as 'Good Governance Day', has been lauded for his policies on Kashmir since he became the prime minister for the first time in 1996. Vajpayee held the position of prime minister (the second time around) between 1998 and 2004. His approach towards addressing the Kashmir issue came to be called the Vajpayee Doctrine. It also included improving relations with neighbouring Pakistan. The Vajpayee doctrine on Kashmir first coined the slogan 'Insaniyat, Jamhuriyat, Kashmiriyat', which meant humanity, peace, and keeping the sanctity of the people of Kashmir. His doctrine aimed at achieving peace, progress and prosperity in the Valley. The doctrine received universal acclaim, and more consequentially, it was lauded by extremist elements in the state. File photo of former prime minister of India Atal Bihari Vajpayee and former prime minister of Pakistan Nawaz Sharif. Reuters Insaniyat, Jamhuriyat, Kashmiriyat",
"time_scraped": "2018-08-17 14:40:49.365797",
"article_id": "4976011",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/NawazSharif_Vajpayee_Reuters.jpg",
"path": "full/b7f8cebc39dc05578b5d8a5693b3aeece73154a1.jpg",
"checksum": "c68a986ed8db958a31de567c6ec45b47"
}
]
}