{
"source_article_link": "https://www.firstpost.com/india/minimum-support-price-poll-gimmicks-cannot-alleviate-farm-distress-government-steps-woefully-inadequate-4977191.html",
"title": "Minimum support price: Poll gimmicks cannot alleviate farm distress, government steps woefully inadequate",
"date_published": "2018-08-16T17:03:11+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/PaddyField380101.jpg"
],
"article_body": "Editor's Note: Ludhiana: Even by his extravagant standards, Prime Minister Narendra Modi’s promises to farmers seem far-fetched. He has vowed to double farm income by 2022 and pay farmers a support price of 50 percent over the cost of production. Now, the Centre has announced a big increase in the minimum support prices (MSP) of 14 crops, an increase in the scope of the programme that the agriculture ministry describes as a “paradigm shift”. The announcement of the MSP hike came at a rally, jointly organised by the BJP and the Shiromani Akali Dal (SAD) on 11 July at Muktsar in Punjab where Modi addressed a huge gathering of farmers from Punjab, Haryana and Rajasthan, who will be among its largest beneficiaries. It marked the launch of the BJP’s 2019 re-election campaign. A five-yearly hike in minimum support price hardly helps farmers to cover their crop production costs. Image courtesy KG Sharma Over the past decade, the MSP seems to have become the prime political tool of the party in power to woo the farm vote. And, with general elections less than a year away, the Modi government is proving to be no exception. A year before the 2009 general elections, the MSP of agricultural products was hiked by 25-50 percent. In the following years, the increase was a measly 3-7 percent. But, a year before the 2014 general elections, the MSP increase was in the range of 28-52 percent, followed by a meagre rise in the next three years. In the 1997 Assembly election in Punjab, the SAD-BJP combine had promised farmers free electricity, which played no small role in their victory. Hiking the MSP has become a similar poll gimmick. Huge hikes every fifth year The recent hikes include a 28 percent increase in cotton prices, 42 percent in the case of jowar, 36 percent for bajra, 52 percent for ragi and 19 percent in the case of maize. The MSP of paddy has been increased by Rs 200 per quintal as compared to Rs 50-60 earlier. “Political parties in power are using MSP hike as a vote seeking tool in the Lok Sabha election year to remain in power,” says Manpreet Singh Grewal, president, Punjab Agricultural University Kisan Club. With about 60 percent of the population dependant on agriculture and allied sectors, he says, “MSP should be declared on a yearly basis on the actual increase in costs.” Dharam Vir Gandhi, MP from Patiala, agrees. \"MSP should be enhanced on the basis of the increased cost of production every year instead of once in 4-5 years,” he says. “This MSP hike is a vote-seeking tactic. The UPA government too played the same music before the 2009 and 2014 elections. The trend to woo farmers only during election years is adversely affecting the whole agriculture sector and the consumer. The Commission on Agricultural Costs and Prices (CAPC) should consider all factors before fixing MSP of agricultural products.\" As Mewa Singh Kular, president of the Innovative and Progressive Farmers Association explains, “Cost of seeds, fertilisers, pesticides and labour go up every year more than the MSP hike.” Punjab BJP spokesperson Anil Sarin, however, claims that the BJP-led government had kept its promise of ensuring 150 percent of the input cost to farmers. “The BJP is committed to double the MSP by 2022,” says Sarin. “Now that a formula has been devised, MSP hike will be made on a yearly basis to ensure adequate margins for farmers.” Prescriptive prices, meager buying But even if the MSP were set annually to reflect the true cost of production, there is no guarantee that there would be many takers at those prices. The government, through the Food Corporation of India (FCI) buys only wheat and rice, while the state-owned Cotton Corporation of India buys raw cotton and sugar mills buy sugarcane at pre-set prices. For all the other commodities, the MSP is just a prescriptive price backed by no buying power. Moreover, even in the case of rice, wheat and cotton, the volumes actually procured at the MSP has fallen far short of targets. For example, in 2017-18, the FCI and other state agencies procured 308.24 lakh metric tonnes (LMT) of a total production of 985.10 LMT of wheat, or just 31.29 percent of that harvested. In 2016-17, of the 1,086.6 LMT of rice produced, the FCI and other state agencies procured 381.06 LMT, or almost 35 percent of the total. In 2014-15, India produced 386 lakh bales of cotton of which the CCI procured With the government unable to buy more than a third of the crop, the announced MSP does not make much difference to farmers' pockets. As a result, the bulk of India’s agricultural produce is sold for a fraction of that price. All that a higher MSP does is benefit a section of rich farmers with surpluses to sell, while the cost is borne by the urban and rural poor and the tax payer. For all the attention it has garnered, tinkering with MSP will do little to improve farm productivity and raise living standards in rural India. What will make a difference are structural reforms that enable the farmer to grow what’s sustainable, that leave him free to sell where and to whom he chooses, that improve credit availability and a host of other measures that will boost India’s agricultural ecosystem and make farming profitable. 101Reporters.com",
"description": "Editor's Note: Ludhiana: Even by his extravagant standards, Prime Minister Narendra Modi’s promises to farmers seem far-fetched. He has vowed to double farm income by 2022 and pay farmers a support price of 50 percent over the cost of production. Now, the Centre has announced a big increase in the minimum support prices (MSP) of 14 crops, an increase in the scope of the programme that the agriculture ministry describes as a “paradigm shift”. The announcement of the MSP hike came at a rally, jointly organised by the BJP and the Shiromani Akali Dal (SAD) on 11 July at Muktsar in Punjab where Modi addressed a huge gathering of farmers from Punjab, Haryana and Rajasthan, who will be among its largest beneficiaries. It marked the launch of the BJP’s 2019 re-election campaign.",
"time_scraped": "2018-08-17 14:40:58.212463",
"article_id": "4977191",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/PaddyField380101.jpg",
"path": "full/c2775ba41eadde88746376aa4c3f08f900c48b12.jpg",
"checksum": "e399ddc322780bb34ddad4c13575b488"
}
]
}