{
"source_article_link": "https://www.firstpost.com/india/16-students-staff-member-hospitalised-after-having-food-at-a-private-school-in-mumbai-food-poisoning-suspected-4977471.html",
"title": "16 students, staff member hospitalised after having food at a private school in Mumbai; food poisoning suspected",
"date_published": "2018-08-16T15:30:37+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/MUMBAI_POLICE_NEW_AFP1.jpg"
],
"article_body": "Mumbai: At least 16 students and a staff member of a private school here were hospitalised today due to suspected food poisoning, a civic official said. Representational image. AFP The Class 7 students and the staff member ate food (dal khichdi) served to them at the Sahyadri Vidya Mandir in suburban Bhandup following which they complained of a stomachache. They were admitted to a hospital in Mulund, the official of the Brihanmumbai Municipal Corporation said. The students — 12 girls and four boys — and the school staffer was responding to the treatment and will be kept under observation for 24 hours, a doctor attending them said. Food poisoning is suspected to be the cause of the illness, the civic official said, adding that an inquiry would be conducted into the matter. On 10 August, a girl student of a civic-run school in Govandi area here died while over 400 other students were hospitalised due to suspected poisoning after they took iron-boosting medicines given by the school",
"description": "Mumbai: At least 16 students and a staff member of a private school here were hospitalised today due to suspected food poisoning, a civic official said. Representational image. AFP The Class 7 students and the staff member ate food (dal khichdi) served to them at the Sahyadri Vidya Mandir in suburban Bhandup following which they complained of a stomachache. They were admitted to a hospital in Mulund, the official of the Brihanmumbai Municipal Corporation said. The students — 12 girls and four boys — and the school staffer was responding to the treatment and will be kept under observation for 24 hours, a doctor attending them said.",
"time_scraped": "2018-08-17 14:41:06.012401",
"article_id": "4977471",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/MUMBAI_POLICE_NEW_AFP1.jpg",
"path": "full/efbaceae0096066732ec1348835fe6495224e3bb.jpg",
"checksum": "cfc9ed7af95eb0872e492d7cb1533cde"
}
]
}