{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-ex-pm-rose-above-hardline-politics-was-last-indian-politician-to-be-universally-revered-4977551.html",
"title": "Atal Bihari Vajpayee passes away: Ex-PM rose above hardline politics, was last Indian politician to be universally revered",
"date_published": "2018-08-16T17:52:34+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/atal-bihari-vajpayee-380-AP.jpg"
],
"article_body": "If you want to understand the importance of Atal Bihari Vajpayee , make a trip to Srinagar or even Anantnag. While you are there, strike a conversation with a cross-section of Kashmiris—politicians, students, hoteliers, drivers, shopkeepers, even separatists—and ask them which Indian politician they love the most. The universal answer would be: Atal Bihari Vajpayee. Everywhere you go in Kashmir, people would refer to the Vajpayee doctrine of and his famous recital of local poet Mehjoor: This love for Vajpayee in Kashmir requires a bit of deconstruction. Here is a leader of a party that has opposed Article 370, practiced hardline Hindutva and has always opposed the Nehruvian model of going soft on Kashmir. Yet, in the mind of heart of Kashmiris, Vajpayee towers over everyone. But, that’s quintessential Vajpayee for you — the last Indian politician who was universally loved, respected and perhaps even revered. The man who straddled ideological divides and represented an India that is liberal, inclusive and believes in the principles of humanity ( ) and democracy ( ). Unlike those who followed or preceded him in his own party or its alma mater, the RSS, Vajpayee was perhaps the only contemporary Indian who had no enemies. File image of former prime minister Atal Bihari Vajpayee. AP The masses loved him for his oratory, an impromptu mix of rousing rhetoric, poetic flourish, biting sarcasm and regaling humour, delivered with trademark pauses and dramatic gestures of his right hand. Vajpayee, as Edward Murrow famously said about Winston Churchill, could mobilise language and send it to battle. Such was his mastery over oratory, even his political rivals relied on it to represent India in major verbal wars. A classic example is the then PV Narasimha Rao’s decision to ask Vajpayee to represent India in the UN, convinced that Vajpayee’s words would neutralise the Pakistani onslaught. (That reminds us of the famous banter between the two. Once Rao called Vajpayee his guru. Vajpayee immediately retorted by saying, 'If I am guru, you are —master of mischief.) One reason for this love for Vajpayee even among rivals was his own ability to rise above the political divide. If he was loved by rivals, it was because he gave the same respect to his rivals. It is often said that Vajpayee called Indira Gandhi, who was to later send him to jail during the Emergency, an avatar of Durga. When Jawaharlal Nehru died, Vajpayee delivered a speech in Parliament that is remembered as an epitome of Indian democracy’s values of respect, admiration and civility that prevailed in that age. On Nehru’s death, Vajpayee said: “…a song has become silent, and a flame has banished into the Unknown.” The loss, said Vajpayee, was not that of a family or community or party. Mother India was in mourning because \"her beloved Prince has gone to sleep\". Humanity was sad because its servant and 'worshipper has left it forever'. The 'benefactor of the downtrodden has gone.' The 'chief actor of the world stage has departed after performing his last act,' he said. Vajpayee went on to compare Jawaharlal Nehru to the most hallowed of all Indian heroes. In \"Panditji's life\", he said, \"we get a glimpse of the noble sentiments to be found in the saga of Valmiki\". For, like Ram, Nehru was 'the orchestrator of the impossible and inconceivable'. He too 'was not afraid of compromise but would never compromise under duress'. In remembering the deceased prime minister, Vajpayee celebrated the human being whom 'no one can replace'. That \"strength of personality\", he remarked, \"that vibrancy and independence of mind, that quality of being able to befriend the opponent and enemy, that gentlemanliness, that greatness — this will not perhaps be found in the future\". If Nehru were alive today, he would have read a similar encomium for Vajpayee, called him a great son of India who represented everything that this great land stands for—love, compassion, idealism and unflinching dedication to the ideals of humanity. The irony, however, is this: The politics of a man who talked of love and compassion was chequered by two of the most violent episodes of Indian politics. One, the Ramjanmbhoomi movement that changed the contours of Indian politics with its trail of bloodshed and blatant communalism. Two, the Gujarat riots that changed the way India looked at the BJP. But, it is perhaps to Vajpayee’s credit, the former prime minister managed to rise even above these cataclysmic events. The BJP’s kamandal movement, in spite of Vajpayee being part of the leadership troika, is still considered LK Advani’s political adventure. Vajpayee managed to distance himself from that violent phase by walking away with the moniker of a (mask) — a term then considered a pejorative —, and not the real face of the militant BJP. And, though he was the prime minister then, people still remember Vajpayee for advising the then Gujarat chief minister Narendra Modi to 'follow ' during the Gujarat riots. Somehow, Vajpayee’s image of an avuncular man with a happy-go-lucky mien, helped him rise above hatred, animosity and remain the only man trusted and loved above the political divide. This contradiction was evident throughout his tenure. Vajpayee was credited with Pokaran II, but also pilloried for the Kandahar surrender and the accompanying exchange of terrorists. His government was guilty of lapses in Kargil but also winning the war without letting it escalate into a nuclear exchange. But, in spite of swaying between aggression, surrender and diplomacy marked by the Lahore trip and Agra invite to Pervez Musharraf, Vajpayee retained the aura of a statesman whose primarily call in life was love and peace. The greatest tribute to him would be for India to remember his ethos of . All of them today need a Vajpayee—the last Indian who neither made enemies, nor had enemies. Someone who was loved and respected from Kashmir to Kanyakumari, perhaps more by his rivals than followers of the Hindutva ideology his alma mater claims to represent. Follow updates on Atal Bihari Vajpayee's health here.",
"description": "If you want to understand the importance of Atal Bihari Vajpayee , make a trip to Srinagar or even Anantnag. While you are there, strike a conversation with a cross-section of Kashmiris—politicians, students, hoteliers, drivers, shopkeepers, even separatists—and ask them which Indian politician they love the most. The universal answer would be: Atal Bihari Vajpayee. Everywhere you go in Kashmir, people would refer to the Vajpayee doctrine of and his famous recital of local poet Mehjoor:",
"time_scraped": "2018-08-17 14:40:16.738370",
"article_id": "4977551",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/atal-bihari-vajpayee-380-AP.jpg",
"path": "full/fa9daf3792aa4fd935c7da1bedceaec0c31ac1fe.jpg",
"checksum": "7b17bb50f7c57ca46c8c1fa29b9b73ab"
}
]
}