{
"source_article_link": "https://www.firstpost.com/india/gauri-lankesh-murder-case-sit-claims-five-suspects-arrested-were-also-involved-in-mm-kalburgi-killing-4979391.html",
"title": "Gauri Lankesh murder case: SIT claims five suspects arrested were also involved in MM Kalburgi killing",
"date_published": "2018-08-16T18:21:49+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2017/10/gauri_lankesh_pti1.jpg"
],
"article_body": "Bengaluru: The SIT probing the killing of journalist-activist Gauri Lankesh on Thursday claimed that five suspects, arrested in connection with the case, were involved in rationalist MM Kalburgi's killing. Representational image. PTI Twelve suspects have been arrested in connection with the Lankesh case. Kalburgi was shot dead on 30 August 2015 at home and the case is being investigated by the criminal investigation department (CID). \"Yes, we have got certain leads provided to us by the Special Investigation Team..It will be premature to share the details. We cannot even say how man yare involved. All we can say at this juncture is that the leads are very credible,\" IGP, CID, KSR Charan Reddy told PTI. Sources in the SIT confirmed that at least five suspects were involved in the killing but did not elaborate. The SIT has arrested 12 people including the alleged mastermind Amol Kale and sharpshooter Parashuram Waghmare. Left-leaning Lankesh, known for her strong anti-Hindutva stand, was shot dead in front of her house on 5 September last year, triggering outrage.",
"description": "Bengaluru: The SIT probing the killing of journalist-activist Gauri Lankesh on Thursday claimed that five suspects, arrested in connection with the case, were involved in rationalist MM Kalburgi's killing. Representational image. PTI Twelve suspects have been arrested in connection with the Lankesh case. Kalburgi was shot dead on 30 August 2015 at home and the case is being investigated by the criminal investigation department (CID). \"Yes, we have got certain leads provided to us by the Special Investigation Team..It will be premature to share the details. We cannot even say how man yare involved. All we can say at this juncture is that the leads are very credible,\" IGP, CID, KSR Charan Reddy told PTI. Sources in the SIT confirmed that at least five suspects were involved in the killing but did not elaborate.",
"time_scraped": "2018-08-17 14:40:12.041430",
"article_id": "4979391",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2017/10/gauri_lankesh_pti1.jpg",
"path": "full/764a87b0235c61b9e63d0b662523c52501e5ff83.jpg",
"checksum": "1383a3da8e48e3b3112843157852cf4c"
}
]
}