{
"source_article_link": "https://www.firstpost.com/india/as-jammu-becomes-home-for-refugees-from-four-communities-state-govt-has-to-deal-with-complex-issue-of-rights-4980561.html",
"title": "As Jammu becomes home for refugees from four communities, govt has to deal with complex issue of rights",
"date_published": "2018-08-16T23:00:11+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Jagti-township-for-Kashmiri-Pandits.jpg"
],
"article_body": "Jammu : Except for the Rohingya Muslims from Myanmar, and the Hindus from Pakistan who fled during partition, the other displaced people who chose to settle in Jammu are, strictly speaking, not refugees, though they are legally classified as such. Like Moti Lal Raina, 72, a Kashmiri Pandit who fled Srinagar after Pakistan-backed terrorists targeted them and other Hindu groups in the Kashmir Valley during the 1990s. Like Des Ram, 44, whose grandfather migrated from Mirpur, in what is now Pakistan-occupied Kashmir (PoK), after the Kashmir war of 1947. But unlike Mohinder Lal, 42, whose grandfather moved from Sialkot in Pakistan after partition during the great Migration. And Mohmmad Islam, 31, a Rohingya who fled during the attacks against his community in Myanmar during 2016 and chose Jammu as his temporary home. Separate colonies housing these communities have sprung up in the region over the years, with each group living under different rules and restrictions. The Rohingya, of course, have no rights in the state, though they do get humanitarian assistance. The Pandits and those from what is now PoK, who migrated mainly from Mirpur, Muzaffarabad and parts of Poonch, can vote in Assembly and Parliament elections, and can own land and get government jobs as they are state citizens. But the refugees from Pakistan can only vote in Parliament elections and are denied the other rights. Jagti township for Kashmiri Pandits. Image courtesy: Jatinder Jamwal The one bright spot for these refugee families, except in some instances for the Rohingya group, is the way the Hindu Dogra community welcomed and enabled them to raise their families with respect and dignity. Not that nostalgia for their original homes ever leaves them. “Leaving your home in a single night forever is a difficult task,” said Moti Lal Raina. “But the love and affection we received in Jammu has been exemplary. Although there will always be memories of Kashmir, at least we have been able to survive after our exodus from the Valley,” added Raina, whose grandson is pursuing engineering from a Pune college with his son serving as a senior officer in Jammu PWD. For over 70 years, Jammu has been a melting pot of people who landed upon its verdant slopes to escape persecution and forge a new life. Today, these four different groups of refugees who arrived in Jammu during different eras, have enjoyed government assistance in terms of housing and other humanitarian help. Yet, they also have their own grievances. Immigrants from West Pakistan 'invisible people' Rajiv Chuni, Chairman of SOS International, an organisation for PoK refugees, says that they are not treated at par with Kashmiri Pandits. “The central government says PoK will be re-captured and refugees from there will be settled back,” said Chuni. “But It has been 70 yearssince our forefathers migrated from PoK and we are still living the life of refugees.” As per the figures put forth in the state Assembly, a total of 31,619 families had migrated from PoK. Of these, 26,319 families settled in Jammu while the rest settled elsewhere in the country. But they do get the benefits of being state subjects, unlike the 5,764 families from Sialkot in Pakistan, mainly from the SC community, who are not considered “permanent residents” of the state. Labha Ram, president of West Pakistani Refugees Action Committee, said that the irony is that while these families are allowed to build houses in the border belt of Jammu where they settled, they do not own the land but only bricks of their homes. “This has become a political issue as Kashmir-centric parties do not want us to become residents and vote in state Assembly,” Labha Ram said. “They say it will change the demography of the state.\" Brig (retd) Anil Gupta, state spokesperson of BJP, added that while some Muslim refugees from other countries were given citizenship rights in Jammu and Kashmir, these Hindus from West Pakistan are leading a life of ‘invisible people’. Also, according to Ram, the number of families from Pakistan are much more than the officially registered 5,764 families. The pandits have a wholly different set of demands. Panun Kashmir, one of the groups speaking for Kashmiri Hindus who were forced to flee their homes, has demanded a separate ‘homeland’ within Kashmir for this group, ruled as a Union territory (UT). Kuldeep Raina, general secretary of Panun Kashmir, said that Jammu supported and treated the Kashmiri Pandit community well when there was no hope. But he argues that “pandits cannot live openly in Kashmir as we will be an easy target of Islamic insurgents. The Kashmiri Hindus need a separate 'homeland'.” According to Raina, about 60,000 such families had migrated to Jammu and other parts of the country. Rohingya migrants on target The presence of the one outsider community in Jammu, the Rohingya, however, has become a controversial issue. They have been accused, by politicians and local residents, of becoming a potential threat to national security. As per official records, there were 5,743 Burmese nationals in Jammu in 2016, up from 5,107 in 2014, though police sources say their numbers have swelled since 2016. (The number of Tibetan and Burmese refugees combined is 13,433 in Jammu and Kashmir, but most Tibetans are settled in Ladakh region.) As per an official document placed in the state Assembly in 2017, they have been involved in crimes like illegal border crossings, with 17 FIRs filed against 38 Rohingya for various cases, according to the state government. Cases of Rohingya possessing Aadhaar cards had set off alarm bells among the security agencies but no action seems to have been taken on this. Some NGOs from Jammu and Kashmir and outside are helping Rohingya in cash and kind from time to time. However, strict surveillance is kept on the activities of these foreigners and the organisations extending a helping hand to them. Mohammad Islam, a Rohingya, when asked whether he would prefer to go back to his home once the condition improves, says that their homes have been destroyed by the army in Myanmar. \"Except on few occasions when we felt threatened, there has been a general atmosphere of peace. Despite being a refugee from a far off area, I am running a tea stall,\" says Mohammad, who runs a tiny tea kiosk at Bathindi in Jammu. Zorawar Singh Jamwal, who is the chief of a pressure group Team Jammu, says that the Rohingya are a threat not only to Jammu but to entire nation. \"They have been settled here as per a plan of demographic change of Hindu dominated Jammu. Their deportation is must as the condition in Myanmar has improved now,\" says Jamwal. 101Reporters.com",
"description": "Jammu : Except for the Rohingya Muslims from Myanmar, and the Hindus from Pakistan who fled during partition, the other displaced people who chose to settle in Jammu are, strictly speaking, not refugees, though they are legally classified as such. Like Moti Lal Raina, 72, a Kashmiri Pandit who fled Srinagar after Pakistan-backed terrorists targeted them and other Hindu groups in the Kashmir Valley during the 1990s. Like Des Ram, 44, whose grandfather migrated from Mirpur, in what is now Pakistan-occupied Kashmir (PoK), after the Kashmir war of 1947. But unlike Mohinder Lal, 42, whose grandfather moved from Sialkot in Pakistan after partition during the great Migration. And Mohmmad Islam, 31, a Rohingya who fled during the attacks against his community in Myanmar during 2016 and chose Jammu as his temporary home. Separate colonies housing these communities have sprung up in the region over the years, with each group living under different rules and restrictions. The Rohingya, of course, have no rights in the state, though they do get humanitarian assistance. The Pandits and those from what is now PoK, who migrated mainly from Mirpur, Muzaffarabad and parts of Poonch, can vote in Assembly and Parliament elections, and can own land and get government jobs as they are state citizens. But the refugees from Pakistan can only vote in Parliament elections and are denied the other rights.",
"time_scraped": "2018-08-17 14:40:07.122614",
"article_id": "4980561",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Jagti-township-for-Kashmiri-Pandits.jpg",
"path": "full/83f2025be6399d03447832e2c576ba12dc3cbe8c.jpg",
"checksum": "409c4c04481ad87f638a1a34ec3d7f17"
}
]
}