{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-was-rare-leader-sought-resolution-of-kashmir-dispute-with-humaneness-says-mirwaiz-umar-farooq-4980221.html",
"title": "Atal Bihari Vajpayee was 'rare' leader, sought resolution of Kashmir dispute with 'humaneness', says Mirwaiz Umar Farooq",
"date_published": "2018-08-16T20:51:55+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee_PTI.jpg"
],
"article_body": "Srinagar : A section of separatist leaders Thursday said former Prime Minister Atal Behari Vajpayee was a \"great man\" and a rare leader with \"humaneness\" who sought a resolution of the issues related to Kashmir. File image of Atal Bihari Vajpayee. PTI \"I am sad to hear about the demise of AB Vajpayee ji. Atalji was indeed a rare Indian leader who had the humaneness to seek the resolution of the festering Kashmir dispute in the wide ambit of humanity and not within the confines of a constitution,\" chairman of moderate faction of Hurriyat Conference Mirwaiz Umar Farooq told He said the former Prime Minister made sincere efforts to walk his talk when he initiated unconditional talks with the Hurriyat conference. \"He was also a man of peace for his neighbours, especially wanted cordial and peaceful relations with Pakistan and was ready to address all issues including the core issue of Kashmir through dialogue. May his soul rest in peace,\" he added. Former Hurriyat chairman Professor Abdul Gani Bhat said Vajpayee was \"a great man in more than many cases\". \"His politics was broadly consisted of reconciliation and balancing...and he did it towards the end of his tenure as prime minister,\" Bhat said. Bhat said Vajpayee's efforts to improve relations with Pakistan and settle the dispute in Jammu and Kashmir will go down in the annals of history as a singular effort to build a stable, prosperous and peaceful south Asia. \"Now is the time, while paying tributes to the great man, for the leadership of the sub-continent to follow his vision of a peaceful region. Initiate a dialogue and resolve all disputes including the dispute of Jammu and Kashmir in the interests of peace, prosperity and development,\" he added.",
"description": "Srinagar : A section of separatist leaders Thursday said former Prime Minister Atal Behari Vajpayee was a \"great man\" and a rare leader with \"humaneness\" who sought a resolution of the issues related to Kashmir. File image of Atal Bihari Vajpayee. PTI \"I am sad to hear about the demise of AB Vajpayee ji. Atalji was indeed a rare Indian leader who had the humaneness to seek the resolution of the festering Kashmir dispute in the wide ambit of humanity and not within the confines of a constitution,\" chairman of moderate faction of Hurriyat Conference Mirwaiz Umar Farooq told He said the former Prime Minister made sincere efforts to walk his talk when he initiated unconditional talks with the Hurriyat conference.",
"time_scraped": "2018-08-17 14:40:09.345880",
"article_id": "4980221",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee_PTI.jpg",
"path": "full/d56a394078d1a771be1fef022d66a3daf04aee58.jpg",
"checksum": "7feed26316add0957d1da0a86143bf4c"
}
]
}