{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-statesman-who-answered-questions-with-disarming-wit-ex-pm-was-never-distant-or-self-important-4982281.html",
"title": "Atal Bihari Vajpayee passes away: Statesman who answered questions with disarming wit, ex-PM was never distant or self-important",
"date_published": "2018-08-17T08:00:37+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee-380-PTI.jpg"
],
"article_body": "I had just got off the plane from Lucknow to Delhi, feeling exhausted. I had been on an arduous tour of Uttar Pradesh in the run-up to the General Election of 1991 in the heat of the midsummer. Just as I began to walk from the plane to the airport terminal, I noticed a familiar figure ahead of me: Atal Bihari Vajpayee had got off the same plane. I quickly caught up and greeted him. He replied affably, although he must have been even more tired after a campaign tour. The reporter in me could not resist the opportunity, and I asked who would be the leader of the party in the Lok Sabha if both he and LK Advani won their seats. Both had lost the 1984 election, and only Advani had contested — and won — the 1989 election. Now, in 1991, both were in the fray. File image of Atal Bihari Vajpayee. PTI Almost any other politician would have given an evasive reply, or sought to deflect the question. But Vajpayee did not bat an eyelid as he replied with characteristic elan: \" lottery , ban jayega (whoever get lucky will be the House leader)\". It is almost a cliche that Vajpayee was one of the finest orators of the age. His wit and his poetry were also renowned. But one of the most endearing facets of his discourse was this sort of heartfelt sincerity, that he unfailingly exuded. One never felt he was putting on an act. He said what he believed, and he did so with a sage calm, and an affability that never sounded self-important. Ready clarification While covering a particularly heated debate in the Lok Sabha from the press gallery a couple of years later, I missed a part of what Vajpayee said in the House amid disturbances.While writing my report that evening, I hesitated, not wanting to go wrong. It was a time of landlines, and I quickly dialled Vajpayee’s residence number, thinking I would ask his personal secretary if he could please ask Vajpayee if he would clarify what I had missed. In the rush of filing my report, I had forgotten how late in the evening it was. Nor did I recognise the voice that said, \"Hello\". But it was impossible to miss the ringing tone of the reply when I had posed my question, thinking I was speaking to his assistant. \"Shiv Kumar ,\" boomed the unmistakeable voice of Vajpayee.I immediately apologised, saying I had not realised how late it was. But the leader was quick to put me at ease. Saying that I had done right to try and clarify, he willingly repeated what he had said in the House. Rare statesmanship Vajpayee was not just a mass orator and politician in the corridors of power. He was a statesman who put the interests of the country ahead of party or personal interests. When the UN first set up its human rights commission in the early 1990s, and the Kashmir issue came up, he willingly led the Indian delegation and ably defended the country. As the tallest leader of the Opposition at the time, he could have enjoyed the discomfort of the government, and no one could have blamed him if he had decided to guard himself and his party against the possibility of being embarrassed at the international forum. Yet, he not only undertook that very public task, Vajpayee also interceded behind the scenes with leading separatist leaders on behalf of the government of the day (led by PV Narasimha Rao). That effort too risked public embarrassment.So closely did Vajpayee support the government on issues of national importance that the former cabinet secretary, Naresh Chandra, went to call on him when the government appointed him as ambassador to the US in 1995. The meeting sent out a public signal that the spectrum of India’s political leaders were united in backing the positions its representative would take in Washington, DC over the next few very crucial years. Chandra continued to be the ambassador in the US in the early period after Vajpayee came to power in 1998.",
"description": "I had just got off the plane from Lucknow to Delhi, feeling exhausted. I had been on an arduous tour of Uttar Pradesh in the run-up to the General Election of 1991 in the heat of the midsummer. Just as I began to walk from the plane to the airport terminal, I noticed a familiar figure ahead of me: Atal Bihari Vajpayee had got off the same plane. I quickly caught up and greeted him. He replied affably, although he must have been even more tired after a campaign tour. The reporter in me could not resist the opportunity, and I asked who would be the leader of the party in the Lok Sabha if both he and LK Advani won their seats. Both had lost the 1984 election, and only Advani had contested — and won — the 1989 election. Now, in 1991, both were in the fray. File image of Atal Bihari Vajpayee. PTI Almost any other politician would have given an evasive reply, or sought to deflect the question. But Vajpayee did not bat an eyelid as he replied with characteristic elan: \"",
"time_scraped": "2018-08-17 14:40:06.581811",
"article_id": "4982281",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee-380-PTI.jpg",
"path": "full/1be66214ab2cd197132a21d2b4b42250d3a6bb68.jpg",
"checksum": "163660fbb4a9a3d7cee491905d622086"
}
]
}