{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-helpline-numbers-emergency-contact-details-and-how-you-can-help-with-donations-supplies-medicines-4982181.html",
"title": "Kerala floods: Helpline numbers, emergency contact details, and how you can help with donations, supplies, medicines",
"date_published": "2018-08-17T08:53:25+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [],
"article_body": "Kerala has been ravaged by unprecedented floods following torrential rains that also triggered landslides, claiming 97 lives since 8 August besides disrupting air, rail and road traffic in several places. Union Home Minister Rajnath Singh had on 12 August undertook an aerial survey of the floot-hit regions and announced an immediate central assistance of Rs 100 crore to the state for relief works. The Kerala government has put out appeals for financial donationsand essential items for thousands of displaced people, living in relief camps around the state. Here's how you can help those affected by the Kerala floods: Contribute through the Chief Minister's Distress Relief Fund (CMDRF) The chief minister's office released a letter appealing for help to rebuild the lives of people affected by the floods in Kerala. Chief Minister Pinarayi Vijayan said, \"We have an important task before us, the task of bringing life back to normalcy.\" Here's how you can help those affected by the unprecedented floods in Kerala. Now you can make donations online to Chief Minister's Distress Relief Fund through the site, https://t.co/OFHTHlZ9by #KeralaFloods #StandWithKerala . pic.twitter.com/XNlBKqdCUT — CMO Kerala (@CMOKerala) August 14, 2018 Direct link:https: donation.cmdrf.kerala.gov.in Donations can be made through cheques or demand drafts (DD), or internet banking. Address for cheques:The Principal Secretary (Finance) Treasurer, Chief Minister’s Distress Relief Fund, Secretariat, Thiruvananthapuram – 1; To contribute online - Account number: 67319948232 Bank: State Bank of India Branch: City branch, Thiruvananthapuram IFS Code: SBIN0070028 PAN: AAAGD0584M Name of Donee: CMDRF Saving their lives was our priority. Now it is our duty to help them rebuild it. Contribute generously to the Chief Minister's Distress Relief Fund. #KeralaFloods #KeralaFloodRelief pic.twitter.com/eNHjyENt8d — CMO Kerala (@CMOKerala) August 11, 2018 The chief minister's office has also released helpline numbers. Kasargod: 9446601700 Kannur: 91-944-668-2300 Kozhikode: 91-944-653-8900 Wayanad: 91-807-840-9770 Malappuram: 91-938-346-3212 Malappuram: 91-938-346-4212 Thrissur: 91-944-707-4424 Thrissur: 91-487-236-3424 Palakkad: 91-830-180-3282 Ernakulam: 91-790-220-0400 Ernakulam: 91-790-220-0300 Alappuzha: 91-477-223-8630 Alappuzha: 91-949-500-3630 Alappuzha: 91-949-500-3640 Idukki: 91-906-156-6111 Idukki: 91-938-346-3036 Kottayam: 91-944-656-2236 Kottayam: 91-944-656-2236 Pathanamthitta: 91-807-880-8915 Kollam: 91-944-767-7800 Thiruvananthapuram: 91-949-771-1281 Alert: People in the low lying areas along Chalakudy river and its tributaries are requested to move to higher locations as a precautionary measure. All stranded people are being attended by the forces in maximum capacity. #KeralaFloods2018 pic.twitter.com/6QWiTj2Guc — CMO Kerala (@CMOKerala) August 16, 2018 Donate essential items People in relief camps across the state are in need of essential items like food (pulses, lentils, milk powder, other food items), sleeping mats, water, toiletries, sanitary napkins, towels, blankets, cooking utensils, basic household furniture, containers, and footwear, among others. Click here for LIVE updates on KERALA FLOODS In Ernakulam, the district administration has joined hands with Anbodu Kochi, an NGO, and has rolled out an initiative called #DoForKerala which is a social media campaign and is helping by setting up collection points across the state. The District Collectors of the Kannur and Idukki put up posts on social media with ways to donate for the people in the districts. Infosys and UST Global have also arranged multiple collection points for relief items. Donate through independent websites The Kerala chapter of Institute of Electrical and Electronics Engineers (IEEE) with the IT has launched a donation website. Through their website ( keralarescue.in ), people can appeal for help and provide specific locations and requirements. Individuals can also register as volunteers on the site. Rapid Response India has also released a portal for donations. Their teams have been been providing on-ground in Kerala since the onset of the calamity, by distributing food and medical assistance. NGO Goonj is also accepting financial donations and essential items. World Vision India has dedicated its website for accepting help for the people affected by the Kerala floods. Actor Siddharth tweeted about donating for the cause of helping people affected by the Kerala flood rebuild their lives. He called it the 'Kerala Donation Challenge', and tweeted the documenting certifying the amount he had donated to the CMDRF, along with a letter urging people to donate. I dare you. I beg of you! What do I have to do to make you read and share this? I did the #KeralaDonationChallenge It was awesome! Will you? Please? #KeralaFloods #SaveKerala @CMOKerala pic.twitter.com/9RmMjSKVBC — Siddharth (@Actor_Siddharth) August 16, 2018",
"description": "Kerala has been ravaged by unprecedented floods following torrential rains that also triggered landslides, claiming 97 lives since 8 August besides disrupting air, rail and road traffic in several places. Union Home Minister Rajnath Singh had on 12 August undertook an aerial survey of the floot-hit regions and announced an immediate central assistance of Rs 100 crore to the state for relief works. The Kerala government has put out appeals for financial donationsand essential items for thousands of displaced people, living in relief camps around the state. Here's how you can help those affected by the Kerala floods: Contribute through the Chief Minister's Distress Relief Fund (CMDRF) The chief minister's office released a letter appealing for help to rebuild the lives of people affected by the floods in Kerala. Chief Minister Pinarayi Vijayan said, \"We have an important task before us, the task of bringing life back to normalcy.\"",
"time_scraped": "2018-08-17 14:40:12.164385",
"article_id": "4982181",
"article_category": "India",
"image_details": []
}