{
"source_article_link": "https://www.firstpost.com/india/daily-bulletin-atal-bihari-vajpayees-funeral-floods-in-kerala-key-vote-for-imran-khan-and-the-days-other-top-stories-4982291.html",
"title": "Daily Bulletin: Atal Bihari Vajpayee's funeral, floods in Kerala, key vote for Imran Khan and the day's other top stories",
"date_published": "2018-08-17T08:03:00+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Ram-Nath-Kovind-at-Vajpayee-funeral_PTI.jpg"
],
"article_body": "Atal Bihari Vajpayee funeral : Former prime minister Atal Bihari Vajpayee will be cremated at Smriti Sthal near Rajghat on the banks of the Yamuna river on Friday evening at 4 pm. Earlier in the day, Vajpayee's mortal remains will be taken to the BJP office, where national leaders are expected to pay their last respects to the three-time former prime minister. At 1 pm, a gun carriage final journey to the Smriti Sthal will begin. Kerala floods : Over 94 people have died in Kerala over the last week as the worst floods in the state's history wreaked havoc. A completely inundated Kochi airport has been closed till Saturday, while lakhs of people have been evacuated. Presently, around 1.5 lakh people are in refugee camps. On Friday evening, after paying his last respects to Vajpayee, Prime Minister Narendra Modi is expected to visit Kerala and conduct an aerial survey of flood-hit areas. President Ram Nath Kovind pays tribute to former prime minister Atal Bihari Vajpayee in New Delhi. PTI Imran Khan faces key vote : A united Opposition, led by the PML-N and PPP, claiming rigging and military manipulation in Pakistan general elections last month resulted in the PTI's victory, have called for a vote of confidence. On Friday, lawmakers in Pakistan's National Assembly will vote, and a victory for PTI may cement Imran Khan's candidature as the next prime minister of Pakistan. Davis Cup reforms passed : World tennis chiefs on Thursday approved a radical Davis Cup overhaul that will condense the 118-year-old worldwide showpiece into an 18-team, week-long event but critics blasted the changes as a \"black day\" for the sport.The shake-up for the men's tournament received 71.43 percent support from delegates at the International Tennis Federation annual meeting in Orlando, well ahead of the two-thirds majority needed for approval. Disney stands by decision to fire James Gunn : There has been a strong push to get James Gunn back as director of following his firing from the project. But Disney and Marvel have chosen to stand by their decision to not reinstate him as helmer for the movie. The decision came following a meeting between Gunn and studio chairman Alan Horn, reported. : A massive protest over the ban of conspiracy theorist Alex Jones' Twitter account will see thousands of users deactivating their accounts on 17 August as a part of the #DeactiDay movement. The move comes after Twitter merely suspended Jones' account whereas brands like Apple, YouTube and Facebook took down his accounts, apps and videos from their respective services. Twitter merely suspending the conspiracy theorist's account meant that he will be able to get back to tweeting in a week's time, which is not what most of the Twitterati want despite Jones' 8,91,000 followers on the platform.",
"description": "Atal Bihari Vajpayee funeral : Former prime minister Atal Bihari Vajpayee will be cremated at Smriti Sthal near Rajghat on the banks of the Yamuna river on Friday evening at 4 pm. Earlier in the day, Vajpayee's mortal remains will be taken to the BJP office, where national leaders are expected to pay their last respects to the three-time former prime minister. At 1 pm, a gun carriage final journey to the Smriti Sthal will begin. Kerala floods : Over 94 people have died in Kerala over the last week as the worst floods in the state's history wreaked havoc. A completely inundated Kochi airport has been closed till Saturday, while lakhs of people have been evacuated. Presently, around 1.5 lakh people are in refugee camps. On Friday evening, after paying his last respects to Vajpayee, Prime Minister Narendra Modi is expected to visit Kerala and conduct an aerial survey of flood-hit areas. President Ram Nath Kovind pays tribute to former prime minister Atal Bihari Vajpayee in New Delhi. PTI",
"time_scraped": "2018-08-17 14:41:12.466930",
"article_id": "4982291",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Ram-Nath-Kovind-at-Vajpayee-funeral_PTI.jpg",
"path": "full/52220cafe823b258b0b16fdce5d783c4bec4468a.jpg",
"checksum": "8b90b26dd6c240aaca35c0c07c15759d"
}
]
}