{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-at-93-imran-khan-remembers-ex-pm-as-friend-of-pakistan-russia-uk-us-recall-him-as-great-statesman-4982611.html",
"title": "Atal Bihari Vajpayee passes away at 93: Imran Khan remembers ex-PM as friend of Pakistan; Russia, UK, US recall him as 'great statesman'",
"date_published": "2018-08-17T09:13:47+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal_Bihari_Vajpayee_Reuters11.jpg"
],
"article_body": "New Delhi: The diplomatic corps in India offered condolences on the demise of former Prime Minister Atal Bihari Vajpayee. Referring to Vajpayee as a 'great statesman', ambassador of Russia to India, Nikolay Kudashev, said Vajpayee was an integral part of Indian politics and was a respected personality in India as well as globally. \"We knew him also as a poet, a man of knowledge and a true friend of our country, where he is well-known as one of the architects of our long-lasting and time-tested privileged strategic partnership,\" Kudashev said. United Kingdom High Commissioner to India Dominic Asquith expressed grief over the death of Vajpayee and termed him as 'one of India's greatest leaders.' \"We are saddened by the passing of former Prime Minister of India Shri #AtalBihariVajpayee. We will remember him as one of India's greatest leaders. Shri Vajpayee was much respected in the UK as a statesman par excellence,\" he said. Pakistan's prime minister-in-waiting Imran Khan remembered Vajpayee as a \"tall personality of the subcontinent\". \"His attempts for the betterment of India-Pakistan relationship will always be remembered. Vajpayee, as a foreign minister, took responsibility of improving India-Pakistan ties,\" quoted him as saying. File image of former prime minister Atal Bihari Vajpayee. Reuters The Japan envoy also expressed grief over the death of former prime minister stating that he was one of the most inspiring world leaders of all times. \"I am deeply saddened by the passing away of former prime minister and Bharat Ratna Atal Bihari Vajpayee. He was one of the most inspiring world leaders of our times. The upswing in India-Japan relations was only possible by the initiatives started by Prime Minister Vajpayee,\" Japanese ambassador Kenji Hiramatsu said. \"The demise of such a great leader is a great loss not only to India but also to Japan and other part of Asia as well as the entire international community. May his legacy live on, and may his soul rest in eternal peace,\" he added. The Australian High Commissioner to India, Harinder Sidhu, also expressed deepest condolences on the death of the former Prime Minister. She took to her official Twitter handle to write, \"On behalf of the Australian Government, I express my deepest condolences on the passing of former Prime Minister, Shri Atal Bihari Vajpayee. #AtalBihariVajpayee @PMOIndia\" Foreign Affairs Ministry of Nepal released a statement with the message of condolence from its Prime Minister K.P. Oli on the behalf of the government and people of Nepal. Referring to the Vajpayee as a 'visionary statesman', Oli said that he will be remembered for his 'sagacity and exemplary selfless service to the people of India.' Remembering Vajpayee's contribution in India in strengthening Indo-Nepal ties, Oli said that Nepal has lost a true friend and a well-wisher. President of Sri Lanka, Maithripala Sirisena wrote: \"Today, we have lost a great humanist and a true friend of Sri Lanka. Former Prime Minister of India Atal Bihari Vajpayee was a visionary leader and an ardent defender of democracy. My condolences to his family and millions of his admirers around the world.\" Former Lankan President Mahinda Rajapaksa also condoled the death of Vajpayee. He wrote on his official Twitter account: \"India has lost a great leader with the passing of Former Prime Minister Atal Bihari Vajpayee. I extend my deepest condolences to the family & the people of India.\" The 93-year-old Bharatiya Janata Party (BJP) veteran breathed his last at 5:05 pm on Thursday, here at All India Institute of Medical Science (AIIMS) following a prolonged illness. Vajpayee, who led the National Democratic Alliance government from 1998 to 2004, was the first-ever member of the Bharatiya Janata Party to become India's Prime Minister. (ANI)",
"description": "New Delhi: The diplomatic corps in India offered condolences on the demise of former Prime Minister Atal Bihari Vajpayee. Referring to Vajpayee as a 'great statesman', ambassador of Russia to India, Nikolay Kudashev, said Vajpayee was an integral part of Indian politics and was a respected personality in India as well as globally. \"We knew him also as a poet, a man of knowledge and a true friend of our country, where he is well-known as one of the architects of our long-lasting and time-tested privileged strategic partnership,\" Kudashev said. United Kingdom High Commissioner to India Dominic Asquith expressed grief over the death of Vajpayee and termed him as 'one of India's greatest leaders.' \"We are saddened by the passing of former Prime Minister of India Shri #AtalBihariVajpayee. We will remember him as one of India's greatest leaders. Shri Vajpayee was much respected in the UK as a statesman par excellence,\" he said.",
"time_scraped": "2018-08-17 14:40:53.738838",
"article_id": "4982611",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal_Bihari_Vajpayee_Reuters11.jpg",
"path": "full/1a849e6f780e269d233ec885d2dc77dad8b63e75.jpg",
"checksum": "b883613a61009cd10a9fb781d7859906"
}
]
}