{
"source_article_link": "https://www.firstpost.com/india/mild-tremors-jolt-bengaluru-karnatakas-natural-disaster-authorities-call-it-crustal-movement-not-earthquake-4982261.html",
"title": "Mild tremors jolt Bengaluru; Karnataka's natural disaster authorities call it 'crustal movement', not earthquake",
"date_published": "2018-08-17T07:43:10+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/05/earthquake-reuters.jpg"
],
"article_body": "Bengaluru: Mild tremor with noise akin to the lightning in parts of Bengaluru sent residents in several areas into a tizzy on Thursday. Panicked residents ran out of their house fearing a major earthquake in the offing. However, Dr GS Srinivasa Reddy, director of Karnataka State Natural Disaster Monitoring Centre (KSNDMC), confirmed it was not an earthquake but only crustal movement. “Our records show that it was not an earthquake but only the crustal movement. There is a dynamic system of our earth,” Reddy told Representational image. Reuters Though it was a phenomenon observed at many places, it was felt more intensely in the southern part of Bengaluru very much. Some people observed that the windows and doors fluttered without any reason. Padmini, a resident said, she was taken aback when the window and the door of her house fluttered wildly. Y Vasundhara, a resident of South Bengaluru said she was at home when she heard the huge roar at about 3.05 pm. “Initially I felt it was the thunderbolt but then I noticed that it was sunny weather outside. I rushed out of the house and looked at the sky but it was clear. Later, my neighbours who too had rushed out told me that it was an earthquake.” Homemaker S Sandhya too shared a similar experience. She too felt that the floor was shaking as she heard the roaring sound. “I realised that it was a tremor only after watching the television,” said Sandhya.",
"description": "Bengaluru: Mild tremor with noise akin to the lightning in parts of Bengaluru sent residents in several areas into a tizzy on Thursday. Panicked residents ran out of their house fearing a major earthquake in the offing. However, Dr GS Srinivasa Reddy, director of Karnataka State Natural Disaster Monitoring Centre (KSNDMC), confirmed it was not an earthquake but only crustal movement. “Our records show that it was not an earthquake but only the crustal movement. There is a dynamic system of our earth,” Reddy told Representational image. Reuters Though it was a phenomenon observed at many places, it was felt more intensely in the southern part of Bengaluru very much.",
"time_scraped": "2018-08-17 14:40:07.764874",
"article_id": "4982261",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/05/earthquake-reuters.jpg",
"path": "full/8022f7ae2ef60eb0d4772a5132edede736a454e7.jpg",
"checksum": "236a5a77a33b2f014b63cff81bf7c52e"
}
]
}