{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-at-93-bhishma-pitamaha-of-indian-politics-former-prime-minister-was-humanity-personified-4983621.html",
"title": "Atal Bihari Vajpayee passes away at 93: Bhishma Pitamaha of Indian politics, former prime minister was humanity personified",
"date_published": "2018-08-17T13:09:14+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-vaaj_380.jpg"
],
"article_body": "A legend par excellence,Atal Bihari Vajpayee larger than life persona was \"humanity personified\". Born in a middle-class Brahmin family to Krishna Devi and Krishna Bihari Vajpayee on 25 December, 1924 in Gwalior, the former prime minister’s humane approach to life earned him the distinction of (One who has no enemies) His father was a poet and a school teacher. Vajpayee did his schooling from the Saraswati Shishu Mandir, Gwalior. Later, he studied at Victoria College, Gwalior – now Laxmi Bai College, for his graduation. It was at Dayanand Anglo-Vedic College, Kanpur that Vajpayee completed his post-graduation in political science. The Narendra Modi government has declared his birthday on 25 December as Good Governance Day. A file photo of Atal Behari Vajpayee. Reuters The of Indian politics as former prime minister Manmohan Singh described him, Vajpayee indeed was a legendary statesman of independent India with apolitical career spanning nearly six decades. The three-time prime minister with broken terms of six years, Vajpayee was decorated with the country’s highest civilian honour — Bharat Ratna — by Prime Minister Narendra Modi in 2015. He was earlier honoured with Padma Vibhusha by prime minister PV Narasimha Rao in 1992. Vajpayee’s cultural moderation, liberalism and political reasonableness helped him to become an acceptable face of the BJP to successfully lead a 20-party alliance -- National Democratic Alliance, or the NDA. Atal , as he was affectionately called by his admirers, was a poet by heart, a trait he learnt from his father. He penned down 52 poems reflecting his approach to social and cultural dimensions of the Indian society. It was during his tenure that India successfully conducted five nuclear tests at Pokhran in May 1998. Vajpayee took several diplomatic initiatives to improve bilateral relations with all South Asian neighbours and extended a hand of friendship towards Pakistan undertaking a bus journey to Lahore in 1999 with a message of peace and cooperation. As the first non-Congress prime minister completing a full five-year term, Vajpayee initiated a series of economic reforms and encouraged foreign investment and privatisation. A bachelor for life, the former prime ministercame in contact with the Rashtriya Swayamsevak Sangh (RSS) in 1939 and became a (full-time worker) in 1947. He also had a stint in journalismand worked as the editor of Hindi monthly, Hindi weekly and the dailies and Vajpayee began his career in politics as a freedom fighter and took part in the Quit India Movement in 1942. Later he joined the Bharatiya Jana Sangh (BJS) founded by Syama Prasad Mookerjee and became his political secretary. Vajpayee accompanied Mookerjee during his in Jammuand Kashmir against Article 370 of the Indian Constitution where the veteran thinker from Bengal and a former member of the Jawaharlal Nehru cabinet died under mysterious circumstances in 1951. Vajpayee became national secretary of BJS in charge of the northern region and was elected to the Lok Sabha for the first time in 1957 from Balrampur in Uttar Pradesh. The former prime ministerwas a ten-time member of the Lok Sabha from different states including Uttar Pradesh, Madhya Pradesh, Delhiand Gujarat. He was twice the member of the Rajya Sabha. He rose to become the national president of the Jana Sangh in 1968. The former prime minister along with his other party colleagues, Nanaji Deshmukh, Bhairon Singh Shekhawat and LK Advani participated in the JP movement spearheaded by veteran socialist leader Jayaprakash Narayan against the internal Emergency imposed by then prime minister Indira Gandhi in 1975 and was imprisoned for 19 months. Vajpayee supported the merger of Jana Sangh with the newly formed Janata Party in 1977 which defeated Indira Gandhi in the post-Emergency General Elections. Vajpayee became the external affairs minister in 1977 when the Morarji Desai-led Janata Party coalition came to power. As the foreign minister, Vajpayee travelled extensively across the globe and established himself as a political leader of reckoning. He became the first dignitary to deliver a speech at the United Nations General Assembly in Hindi. After the collapse of Desai government and the split of Janata Party on the issue of dual membership of the Jana Sangh leaders due to their association with the RSS, Vajpayee along with other former Jana Sangh leaders formed the Bharatiya Janata Party in 1980. Vajpayee vehemently opposed Operation Blue Star by the army at the Golden Temple in Amritsar and raised his voice against the anti-Sikh riots after the assassination of Indira Gandhi in 1984. Similarly, hedid not favour demolition of the Babri Masjid on 6 December, 1992 and described it as \"unfortunate”. The BJP lost heavily in the 1984 Lok Sabha elections winning only two seats. Vajpayee himself lost in Gwalior. Vajpayee remained leader of the Opposition in the Parliament till 1996. In 1996, thethen president Shankar Dayal Sharma invited Vajpayee to become the 10th Prime Minister of India following the BJP emerging as the single largest party in the 1996 General Elections. However, he lost the vote of confidence in Parliament and his first stint as prime minister lasted only 13 days as he failed togarner support from other parties which considered BJP as politically untouchable. However, in 1998, the BJP-led coalition NDA came back to power and Vajpayee was again sworn in as the prime minister.Vajpayee’s second term asprime minister will be remembered for the five nuclear tests conducted by India at Pokhran desert in Rajasthan in May 1998. His Jammu and Kashmir doctrine of restoring normalcy in the state in the spirit of , and (democracy, humanityand Kashmiri identity) still reverberates in the Valley as the only way to resolve all the outstanding issues with Pakistan in a spirit of mutual respect. Vajpayee took the peace initiative by inaugurating the historic Delhi-Lahore bus service in February, 1999 and personally took the message of peace and cooperation to the people of Pakistan. However,Islamabad stabbed him in the back by launching Kargil incursions which Indian armed forces successfully vacated. The Vajpayee government lost by one vote on the floor of the house after 13 months after the All India Anna Dravida Munnetra Kazhagam (AIADMK) led by JJayalalitha withdrew its support to the NDA in mid-1999. In the 1999 mid-term polls, the NDA came back with afull majority in the wake of the Kargil victory and Vajpayee took oath as Prime Minister of India for the third time on 13 October 1999. He successfully managed the 20-party coalition and completed full five years (1999-2004) in office as the first non-Congress prime minister. Vajpayee’s third term witnessed hijacking of Indian Airlines flight IC 814 from Kathmandu to New Delhi in December 1999 which was taken to Kandahar in Afghanistan. Also, there was an unsuccessful attack on Indian Parliament on 13 December 2001, when Pakistan-supported terrorists stormed the Parliament building in Delhi. Vajpayee government introduced many economic and infrastructural reforms, including encouraging the private sector and foreign investments. It also undertook National Highway Development Projects and Pradhan Mantri Gram Sadak Yojana. Vajpayee adopted pro-business, free-market reforms approach to boost India’s economic development and as a result, the Indian economic achieved impressive gains and all-round growth. In March 2000, Vajpayee signed the Historic Vision Document during the visit of the then US president Bill Clinton. The Declaration incorporated several strategic issues, apart from pitching for expansion in trade and economic ties between the two countries. Vajpayee again tried for peace with Pakistan by inviting then president Pervez Musharraf for the Agra summit.But the talks failed to achieve any breakthrough as Musharraf refused to condemn terrorism in all its manifestations. In the aftermath of the communal riots in Gujarat in 2002 in the wake of the Godhra train tragedy, Vajpayee made a passionate appeal for peace and communal harmony during a visit to the riot-torn areas in the state. The NDA lost the 2004 General Elections and the Congress-led United Progressive Alliance assumed the reins of power with Manmohan Singh succeeding Vajpayee. Vajpayee soon after had to hand over the BJP as well as the NDA leadership to LK Advani and announced his retirement from active politics owing to poor health but he created such a high benchmark in Indian politics which only a few can dare to scale over.",
"description": "A legend par excellence,Atal Bihari Vajpayee larger than life persona was \"humanity personified\". Born in a middle-class Brahmin family to Krishna Devi and Krishna Bihari Vajpayee on 25 December, 1924 in Gwalior, the former prime minister’s humane approach to life earned him the distinction of (One who has no enemies) His father was a poet and a school teacher. Vajpayee did his schooling from the Saraswati Shishu Mandir, Gwalior. Later, he studied at Victoria College, Gwalior – now Laxmi Bai College, for his graduation. It was at Dayanand Anglo-Vedic College, Kanpur that Vajpayee completed his post-graduation in political science. The Narendra Modi government has declared his birthday on 25 December as Good Governance Day.",
"time_scraped": "2018-08-17 14:40:13.076404",
"article_id": "4983621",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-vaaj_380.jpg",
"path": "full/812f69710258ab97a6d3ae93038788ec8871eb33.jpg",
"checksum": "d0da33969104ceb4003112e21008a726"
}
]
}