{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-centre-declares-7-day-mourning-period-as-mark-of-respect-for-former-prime-minister-4983491.html",
"title": "Atal Bihari Vajpayee passes away: Centre declares 7-day mourning period as mark of respect for former prime minister",
"date_published": "2018-08-17T11:52:17+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/PTI8_16_2018_000276B.jpg"
],
"article_body": "A seven-day State mourning was announced by the Central government as a mark of respect to former prime minister Atal Bihari Vajpayee, who passed away on Thursday. In a circular, the Home Ministry said the national flag would fly at half-mast from Thursday for seven days across India and a State funeral would be accorded to Vajpayee. The government also said the state funeral of Vajpayee will be held at Delhi's Smriti Sthal on Friday and declared a half-day holiday in all central government offices, central public sector undertakings across the country and the Delhi government offices of NCT of Delhi. \"As a mark of respect to the departed dignitary, it has been decided that seven days of State mourning will be observed throughout India from 16 to 22 August, both days inclusive. During this period, the national flag will be flown at half-mast throughout India where it is regularly flown and there will be no official entertainment during the period of the State mourning,\" the Home Ministry said. Narendra Modi, Venkaiah Naidu and BJP president Amit Shah pay tribute to Atal Bihari Vajpayee. PTI The national flag would also fly half mast on Friday in all Indian missions abroad. Former prime minister Atal Bihari Vajpayee passed away on Thursday evening in New Delhi at the age of 93, and was revered by political leaders.Prime Minister Narendra Modi expressed his sorrow. \"Atal 's passing away is a personal and irreplaceable loss for me. I have countless fond memories with him. He was an inspiration to like me. I will particularly remember his sharp intellect and outstanding wit,\" he said. The West Bengal, Chhattisgarh, Tamil Nadu, Puducherry, Madhya Pradesh, Tripura and Gujarat governmentsdeclared a half-day holiday intheir offices and educational institutions on Friday as a mark of respect, and declared a week-long State mourning on Thursday. State government officials have said that during this period, the national flag will be flown at half-mast. In Madhya Pradesh, Vajpayee's home state, there will be no official entertainment programmes, a government order said. reported that the Supreme Court and the Registry will also observe a half-day holiday on Friday, and will work till 1 pm. West Bengal chief minister Mamata Banerjee and Tripura chief minister Biplab Deb travelled to Delhi on Thursday evening to pay their last respects to the BJP leader. However, the Maharashtra government did not declare a public holiday on Friday, since it is already a holiday on account of , the Parsi new year. The BJP-led state government has not declared an additional holiday as part of national mourning due to Vajpayee’s death, the official said on Thursday. The Karnataka governmenthas, however, declared seven days of mourning. A government release said that due to the flood situation in some parts of the state, other than those involved in the relief work, schools, colleges and government offices would have a holiday on Friday. Follow latest updates on Atal Bihari Vajpayee's funeral",
"description": "A seven-day State mourning was announced by the Central government as a mark of respect to former prime minister Atal Bihari Vajpayee, who passed away on Thursday. In a circular, the Home Ministry said the national flag would fly at half-mast from Thursday for seven days across India and a State funeral would be accorded to Vajpayee. The government also said the state funeral of Vajpayee will be held at Delhi's Smriti Sthal on Friday and declared a half-day holiday in all central government offices, central public sector undertakings across the country and the Delhi government offices of NCT of Delhi. \"As a mark of respect to the departed dignitary, it has been decided that seven days of State mourning will be observed throughout India from 16 to 22 August, both days inclusive. During this period, the national flag will be flown at half-mast throughout India where it is regularly flown and there will be no official entertainment during the period of the State mourning,\" the Home Ministry said. Narendra Modi, Venkaiah Naidu and BJP president Amit Shah pay tribute to Atal Bihari Vajpayee. PTI",
"time_scraped": "2018-08-17 14:40:09.518666",
"article_id": "4983491",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/PTI8_16_2018_000276B.jpg",
"path": "full/43c4c2b3d8ba1acda5721c6d3d6730e8832aa036.jpg",
"checksum": "bcc9087c2f3159fc6f28e19432b56900"
}
]
}