{
"source_article_link": "https://www.firstpost.com/india/pakistan-govt-leaders-mourn-atal-bihari-vajpayee-imran-khan-says-ex-pms-effort-to-improve-cross-border-ties-will-be-remembered-forever-4983051.html",
"title": "Pakistan govt, leaders mourn Atal Bihari Vajpayee; Imran Khan says ex-PM's effort to improve cross-border ties will be remembered forever",
"date_published": "2018-08-17T11:41:44+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/ImranKhan_AFP2.jpg"
],
"article_body": "Islamabad: Pakistan government and top leaders have paid respects to Atal Bihari Vajpayee and said the former Indian prime minister contributed to bringing \"a change\" in bilateral ties and remained a key supporter of regional cooperation for development. Prime Minister-in-waiting Imran Khan also expressed condolences over Vajpayee's demise, saying his efforts for India-Pakistan peace will always be remembered. File image of PTI chief Imran Khan. AFP Foreign Office spokesman Mohammad Faisal said that \"we have learnt with sadness the passing away of Mr Atal Bihari Vajpayee\". \"Mr Vajpayee was a renowned statesman who contributed to bringing a change in India-Pakistan relations and remained a key supporter of SAARC and regional cooperation for development,\" he said in a statement. The government and people of Pakistan extend their \"heartfelt condolences\" to Vajpayee's family and to the government and people of India, the spokesman said. Cricketer-turned-politician Khan, who is expected to take oath as prime minister tomorrow, said in a statement that Vajpayee was a prominent political personality of the sub-continent and his death has created a big void. \"Efforts of Mr Vajpayee for improvement in relations between Pakistan and India will be remembered forever,\" the Pakistan Tehreek-e-Insaf chief said. Khan said that Vajpayee started efforts for improving Indo-Pak ties and continued them after becoming prime minister. \"As foreign minister, Vajpayee strived to open up ways towards normalisation of relations among neighbouring states and had successfully taken this agenda to new heights after assuming the office of prime minister,\" he said. Khan said, \"I extend sympathies to the people of India in this hour of grief\". He further said that by creating peace between the two countries, \"we can truly recognise the service of Vajpayee\". Khan said both countries have just celebrated their independence and there is also a desire for peace on both sides of the border despite political differences. Pakistan Muslim League-Nawaz (PML-N) president Shahbaz Sharif said that Vajpayee and former Pakistan prime minister Nawaz Sharif had launched a sincere peace effort between the two countries. \"In the death of former prime minister Atal Bihari Vajpayee, India has lost a leader whose services to regional peace will be remembered for long time. He and Nawaz Sharif launched a sincere peace effort between neighbouring countries in 1999. Wish India builds on his legacy by giving peace a chance,\" Shahbaz said in a tweet. According to the PML-N, Vajpayee and Sharif had initiated peace efforts between the two countries after the former's historic bus journey to Lahore in 1999 but General Pervez Musharraf did a Kargil misadventure, sabotaging their efforts and later overthrowing the Sharif government. The PML-N circles also talk about Nawaz's efforts to bring peace with India and seeking friendly relations with it one of the reasons behind his removal from the post of the prime minister in July 2017 in the Panama Papers case. He was subsequently imprisoned in Avenfield properties corruption case last month. Nawaz and his daughter Maryam are serving 10 and seven years imprisonment respectively at Adiala Jail Rawalpindi. Vajpayee, one of India's most charismatic leaders and inspirational orators, died yesterday at the age of 93. His death was announced by the All India Institute of Medical Sciences (AIIMS) hospital where he was admitted on 11 June with a variety of ailments.",
"description": "Islamabad: Pakistan government and top leaders have paid respects to Atal Bihari Vajpayee and said the former Indian prime minister contributed to bringing \"a change\" in bilateral ties and remained a key supporter of regional cooperation for development. Prime Minister-in-waiting Imran Khan also expressed condolences over Vajpayee's demise, saying his efforts for India-Pakistan peace will always be remembered. File image of PTI chief Imran Khan. AFP Foreign Office spokesman Mohammad Faisal said that \"we have learnt with sadness the passing away of Mr Atal Bihari Vajpayee\".",
"time_scraped": "2018-08-17 14:40:31.290189",
"article_id": "4983051",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/ImranKhan_AFP2.jpg",
"path": "full/055a1a4809f331dc0337402ce544684f246d9015.jpg",
"checksum": "c909af0a238c6c45f72e01fb7a4745d8"
}
]
}