{
"source_article_link": "https://www.firstpost.com/india/kashmirs-hurriyat-leaders-recall-atal-bihari-vajpayee-as-rare-indian-leader-who-understood-pain-of-kashmiris-4983011.html",
"title": "Kashmir's Hurriyat leaders recall Atal Bihari Vajpayee as 'rare Indian leader who understood pain of Kashmiris'",
"date_published": "2018-08-17T10:28:38+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/vajpayee-380-new-PTI.jpg"
],
"article_body": "For any separatist leader, engaging in any kind of diplomacy with the Indian government on the future of Kashmir is a decision fraught with political repercussions. In the last three decades of turmoil, many have paid the price for holding back channel negotiations with New Delhi, with their lives. But when the Hurriyat Conference leaders led by Kashmir's head priest and chief of moderate Hurriyat, Mirwaiz Umar Farooq, held their first round of talks on 22 January, 2004, with the then NDA government, they put their hope in Atal Bihari Vajpayee. The two initial rounds of talks were held with then deputy prime minister LK Advani, and then they held direct meetings with Vajpayee. \"When I first went to meet him as part of a Hurriyat delegation, he looked straight at me and said: 'Professor , (Dear professor, this puzzle has to be solved)', and whatever we do, we will do it with good intention,\" said Professor Abdul Gani Bhat, senior separatist leader, who is part of the moderate Hurriyat, on Thursday. File image of Atal Bihari Vajpayee. PTI Vajpayee met Kashmiri separatists in January 2004, despite Pakistan not being in favour of those talks. The foundation for these talks was laid when the NDA government in New Delhi announced the non-initiation of combat operations (NICO) in the Muslim holy month of fasting in December 2000, like the current dispensation did in the previous Ramzan, but failed to extend it. The decision was aimed at reducing the violence and creating a conducive atmosphere for the peace talks to be held. In 2001, Vajpayee announced a political dialogue on Kashmir and it was followed by the appointment of KC Pant as the Centre's first official interlocutor on Kashmir in 2001. In February 2003, Vajpayee replaced Pant with NN Vohra, the present governor of the state as his point man on Kashmir. But like his predecessor, Vohra too failed to hold talks with the Hurriyat, who insisted that they would talk to the prime minister directly. After two months of back channel diplomacy and a successful India-Pakistan dialogue on the sidelines of SAARC Summit, in 2004, the Hurriyat Conference went ahead and held talks with Advani and Vajpayee. \"The first time I met Vajpayee, I felt delighted listening to him. He was a man with a vision — a vision to build a peaceful, prosperous and stable tomorrow for the entire people of South Asian region. For that, he wanted the dispute of Kashmir to be resolved, which he did tried when he became the prime minister,\" Bhat said. He said Vajpayee initiated the process of 'a purposeful dialogue' with Pakistan in which he didn't lose faith. But the troubles back home for the then Pakistan president Pervez Musharraf cast a shadow on the whole process, \"He (Vajpayee) understood disputes will have to be addressed. We were close to settling the Kashmir problem. To quote the then foreign minister of Pakistan, the settlement of Kashmir dispute was just 'a signature away',\" Bhat said. The first round of talks was held in Delhi between Advani and four separatist groups which was followed by second round of talks on 27 March, 2004 during which discussions were held on human rights issues and the cases of political detainees. After these two meeting, the third did not take place as the government changed in New Delhi. Another initiative by the Congress eventually took off on 5 September, 2005 in which former prime minister Manmohan Singh promised Hurriyat leaders that he would 'consider' reducing the footprint of soldiers in Kashmir, but nothing happened. That led to the collapse of talks. \"If any Indian prime minister has to pay tribute to Vajpayee, he should translate his vision into reality. The leaders of India and Pakistan should not stay frozen in the past and initiate a purposeful dialogue for a brighter tomorrow. Dialogue is the beauty of politics,\" Bhat added. But Mirwaiz said the problem was not the dialogue, but the outcome. He said the Hurriyat leadership at that time took a risk by engaging in talks with New Delhi despite reservations of people, but after Vajpayee, there was no forward movement. \"His approach was based on humanity,\" Mirwaiz said, \"And he believed that the road to peace in the entire region of South Asia passed through Kashmir. I would say he was a rare Indian leader who understood to some extent the pain of Kashmiris. In his death, South Asia has lost a great leader.\" In Kashmir, after the country’s first prime minister Jawaharlal Nehru, if there is any politician whose name is on the tips of tongues of people, it would be Vajpayee, primarily because of his reconciliatory gestures. In an April 2003 speech in Srinagar, he extended his hand of friendship to Pakistan. He effected the ceasefire along the Line of Control in November 2003 and also started cross-LoC bus services and trade between the two sides of Kashmir. Vajpayee’s vision for resolving the problems in Kashmir within the framework of 'Insaaniyat (humanism), Kashmiriyat (inclusive Kashmir) and Jhamooriyat (democracy)' remains his abiding legacy in Kashmir, so much so that even the hardliner Hurriyat leader Syed Ali Shah Geelani last year evoked his three-worded strategy to resolve the Kashmir dispute. It was because of Vajpayee’s humanity and his statesmanship that hope was kindled in Kashmir when the BJP came to office after the 2014 Lok Sabha elections. With Prime Minister Narendra Modi winning a huge mandate, people thought there would be some positive movement for bringing about a permanent settlement of Kashmir question. This optimism was shared on the streets, but the previous four years have reminded people of anything but the Vajpayee era. \"The very philosophy that made Vajpayee a 'statesman' in the eyes of many people across the political spectrum has been dishonoured and rejected by the new BJP leadership. The least his party could do to honour his legacy was to start a dialogue on Kashmir, but with the General Election around the corner, that is unlikely to happen,\" said Mohammed Syed Malik, a veteran journalist who has covered Kashmir for decades.",
"description": "For any separatist leader, engaging in any kind of diplomacy with the Indian government on the future of Kashmir is a decision fraught with political repercussions. In the last three decades of turmoil, many have paid the price for holding back channel negotiations with New Delhi, with their lives. But when the Hurriyat Conference leaders led by Kashmir's head priest and chief of moderate Hurriyat, Mirwaiz Umar Farooq, held their first round of talks on 22 January, 2004, with the then NDA government, they put their hope in Atal Bihari Vajpayee. The two initial rounds of talks were held with then deputy prime minister LK Advani, and then they held direct meetings with Vajpayee. \"When I first went to meet him as part of a Hurriyat delegation, he looked straight at me and said: 'Professor , (Dear professor, this puzzle has to be solved)', and whatever we do, we will do it with good intention,\" said Professor Abdul Gani Bhat, senior separatist leader, who is part of the moderate Hurriyat, on Thursday.",
"time_scraped": "2018-08-17 14:40:09.591972",
"article_id": "4983011",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/vajpayee-380-new-PTI.jpg",
"path": "full/57ba5d784decac9430d0d54da64058b90eea8da7.jpg",
"checksum": "5c315bf6f631074582acfacda334772f"
}
]
}