{
"source_article_link": "https://www.firstpost.com/india/politics-loses-its-poetry-roundup-of-headlines-in-indian-dailies-observing-atal-bihari-vajpayees-death-4983371.html",
"title": "'Politics loses its poetry': Roundup of headlines in Indian dailies observing Atal Bihari Vajpayee's death",
"date_published": "2018-08-17T14:13:30+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/rnpdvxftax-15344758041.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/ssss.jpg"
],
"article_body": "India, on Thursday, lost one of its most charismatic leaders, former prime minister Atal Bihari Vajpayee. People all over the world are mourning the loss of the stalwart who led the nation through several crises with his inclusive politics and excellent oratory. Here's are a few of the headlines of the Indian dailies on Vajpayee's demise: The headline of read, “Politics loses its poetry”, a reference to the former prime minister’s love for poetry. Vajpayee, a man of letters, was an accomplished poet. A majority of Vajpayee’s poetry which saw full publication was patriotic in virtue. The paper quoted the reactions of the political leaders, mourning his loss. headline, The Economic Times' headline \"Kavi, Alvida na Kehna\" also referred to Vajpayee's love for poetry. The largest English daily, ran with the headline “PM, poet, statesman, gentleman”, encapsulating the former prime minister's personality, who has admired by followers and rivals both. The news report pointed out four lasting legacies of Vajpayee — the nuclear tests he conducted in Rajasthan’s Pokhran in 1998, road construction, his approach to Indo-Pak relations and the privatisation of several PSUs. The headline of read “A nation’s loss”. The report pointed out how Vajpayee was loved and respected across the political divide. The picture on the home page also highlighted his words from the Lok Sabha in 1996, \" \" (The game of power will go on...Governments will come and go...but this nation must remain). , ran with the headline \"Era of Atal ends\", mourning the loss of one of India's tallest leaders. The paper quoted his poem, , where he says he is not afraid of death as he has lived his life to the fullest. The daily also had full coverage of the 'era of Atal' on page 6,7 and 8 with a timeline of the former prime minister's accomplishments and the difficulties he faced. published a news report witha poetic headline “Vajpayee, BJP’s gentle colossus, fades away”.The daily reminded the readers on how he was the only non-Congress prime minister to complete the full term in office, that he was elected to the Lok Sabha 10 times and was a Rajya Sabha member twice. The news report also focused on the political reactions. report led with the headline \"Rajdharma Reminder,\"remembering Vajpayee’s advice to Narendra Modi after communal riots in Gujarat in 2002. Vajpayee in his biography explained that Rajdharma was a meaningful term, and for somebody in a position of power, it meant not discriminating among the higher and lower classes of society or people of any religion, \"If India is not Secular, then India is not India at all.\" \"A colossus, unaided by machines\" was another headline on the Telegraph front page, commenting on how his death has affected masses. Only true mass leaders with that indefinable quality called charisma, unaided by the modern-day publicity machine of 24/7 television and relentless social media chatter, can evoke such emotions among vast swathes of people who never met them, said the report. The headline was \"Atal Bihari Vajpayee dies, an era ends in IndianPolitics\". the report noted two milestones of his career- the nuclear tests he conducted in Rajasthan’s Pokhran in 1998 and shaping India's foreign policy, especially recasting ties with the US. , a Hindi daily's headline read: “ (The Atal era of Indian politics comes to an end)”.The paper noted the former prime minister’s instrumental role in shaping India’s foreign policy, among other things. International media , too, paid their tribute to the Vajpayee calling 'moderate face of BJP', 'statesman of international stature'. The 93-year-old Bharatiya Janata Party (BJP) veteran breathed his last at 5.05 pm on Thursday,in Delhi at All India Institute of Medical Science (AIIMS) following a prolonged illness. Vajpayee, who led the National Democratic Alliance government from 1998 to 2004, was the first-ever member of the Bharatiya Janata Party to become India's Prime Minister.Lakhs of people are expected to attend the former prime minister’s funeral at Rashtriya Smriti Sthal in New Delhi at 4 pm on Friday.",
"description": "India, on Thursday, lost one of its most charismatic leaders, former prime minister Atal Bihari Vajpayee. People all over the world are mourning the loss of the stalwart who led the nation through several crises with his inclusive politics and excellent oratory. Here's are a few of the headlines of the Indian dailies on Vajpayee's demise: The headline of read, “Politics loses its poetry”, a reference to the former prime minister’s love for poetry. Vajpayee, a man of letters, was an accomplished poet.",
"time_scraped": "2018-08-17 15:05:01.254360",
"article_id": "4983371",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/rnpdvxftax-15344758041.jpg",
"path": "full/9b431c611c5f6fe26b087daa77b3d371cfb870d9.jpg",
"checksum": "3d92e73440055d0e6675c83740926872"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/ssss.jpg",
"path": "full/c8f0ca305b4530afe294860dced63f7e2e8b09c3.jpg",
"checksum": "e4c9424ed15c562f3aaee85936d7b26a"
}
]
}