{
"source_article_link": "https://www.firstpost.com/india/keralas-disaster-management-authority-revises-toll-of-rain-related-deaths-to-106-defence-forces-scale-up-rescue-operations-4983911.html",
"title": "Kerala's disaster management authority revises toll of rain-related deaths to 106; defence forces scale up rescue operations",
"date_published": "2018-08-17T12:39:54+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/naveen-Nair_3801.jpeg"
],
"article_body": "Thiruvananthapuram : More than 100 people died in rain-related incidents in Kerala in just one day on Thursday, sources in the State Disaster Management Authority said, even as defence forces scaled up operations Friday morning to rescue those stranded in worst-hit areas. The toll for Thursday, initially put at 30, has now been revised to 106, the sources said, which takes the overall fatalities to 173 since the second spell of monsoon fury unleashed itself on 8 August. Image of rescue operations in Kerala. Firstpost/Naveen Nair Prime Minister Narendra Modi is expected to reach Kerala on Friday night after the funeral of former prime minister A B Vajpayee. He is likely to undertake an aerial survey of the flood-affected areas on Saturday. Chief Minister Pinarayi Vijayan had on Thursday said 23 more helicopters will join the rescue operations on Friday and 200 additional boats will also be pressed into service. Around 3,000 people were rescued from Ernakulam and Pathanamthitta districts on Thursday. Several people are stranded in buildings in various districts. Many of them, including children, were rescued from various waterlogged areas. \"In one of the worst rain and flood disasters to hit Kerala, 106 people lost their lives on a single day on Thursday,\" a source in the Kerala State Disaster Management Authority said. In the second spell of rains to hit the state since 8 August, 67 people had lost their lives till Tuesday. Army, Navy, Air Force and NDRF personnel have begun rescuing people stranded in the worst affected areas of Ernakulam, Pathanamthitta and Thrissur districts from Friday morning. Many elderly persons and women with young children were rescued since Friday morning. Local fishermen have also joined the rescue mission bringing in their boats to help in evacuation of the stranded people in various places in Aluva, Kalady, Perumbavoor, Muvattupuzha and Chalakudy. A weather report at 7 am has predicted heavy rain accompanied by gusty winds in various parts of the state on Friday. Winds at the speed of 60 kmph is expected in Pathanamthitta, Thiruvananthapuram, Kollam, Alappuzha, Kottayam, Idukki, Ernakulam, Thrissur, Palakkad, Malappuram, Kozhikode and Wayanad districts, the report said. Desperate non-resident Keralites from Australia, the US and the UK were making fervent pleas to authorities through television channels seeking help for their dear ones. Soumya from Australia said her parents and their relatives were stranded in Aluva for the past two days. Another person said an elderly relative, Mary Varghese, was badly in need of oxygen cylinder and her condition was worsening. In a WhatsApp video, a stranded woman with her 6-year-old child was seen pleading for help. \"We have no food or water. Please help us.\" On instructions from the Prime Minister, the Defence Ministry has rushed in fresh teams of the three armed forces for relief and rescue operations in the state where over 1.5 lakh homeless and displaced people are taking shelter in relief camps. Twelve additional teams of of the National Disaster Response Force comprising about 540 personnel were also rushed to Kerala. The operations at the Kochi International Airport will remain suspended till 26 August, with runways being flooded. Over 25 trains were either cancelled or rescheduled in Kerala. Kochi Metro operations have not been affected so far, sources said. With waters flooding the private Aster Medi City in Kochi, some patients were shifted to other hospitals. The state government also decided to raise excise duty on Indian Made Foreign Liquor till 30 November to mop up additional resources for relief and rehabilitation efforts, official sources said. Follow LIVE updates on Kerala rains here.",
"description": "Thiruvananthapuram : More than 100 people died in rain-related incidents in Kerala in just one day on Thursday, sources in the State Disaster Management Authority said, even as defence forces scaled up operations Friday morning to rescue those stranded in worst-hit areas. The toll for Thursday, initially put at 30, has now been revised to 106, the sources said, which takes the overall fatalities to 173 since the second spell of monsoon fury unleashed itself on 8 August. Image of rescue operations in Kerala. Firstpost/Naveen Nair Prime Minister Narendra Modi is expected to reach Kerala on Friday night after the funeral of former prime minister A B Vajpayee. He is likely to undertake an aerial survey of the flood-affected areas on Saturday.",
"time_scraped": "2018-08-17 14:40:13.005491",
"article_id": "4983911",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/naveen-Nair_3801.jpeg",
"path": "full/d5148115c0ce3c4975d9e82733edcebafe9f2218.jpg",
"checksum": "180970a1c3d17210cfa604b3e603ccf7"
}
]
}