{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayees-mortal-remains-taken-to-bjp-hq-ex-pm-to-be-cremated-at-rashtriya-smriti-sthal-near-rajghat-4983531.html",
"title": "Atal Bihari Vajpayee's mortal remains taken to BJP HQ; ex-PM to be cremated at Rashtriya Smriti Sthal near Rajghat",
"date_published": "2018-08-17T11:18:56+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee-book_PTI.jpg"
],
"article_body": "New Delhi: Former prime minister Atal Bihari Vajpayee's mortal remains, wrapped in the tricolour, were taken to the Bharatiya Janata Party (BJP) headquartersin Delhion Friday for the people to pay their last respects to the departed leader. The body in a flower-decked casket was carried in a hearse to 6-A Deen Dayal Upadhyay Marg headquarters. File image of former prime minister Atal Bihari Vajpayee. PTI Vajpayyee, who passed away at the AIIMSin Delhi on Thursday evening at the age of 93, will be cremated at the Rashtriya Smriti Sthal near Rajghat in the national capital at 4 pm. His last journey will begin from the BJPheadquarters to Rashtriya Smriti Sthal at 1 pm. The government has announced a state funeral for Vajpayee. A seven-day state mourning has been announced as a mark of respect for the former prime minister. Delhi government offices, schools and institutions have been closed. Congress President Rahul Gandhi, National Security Advisor Ajit Doval and all the three armed forces chiefs earlier led a host of leaders in paying homage to Vajpayee.",
"description": "New Delhi: Former prime minister Atal Bihari Vajpayee's mortal remains, wrapped in the tricolour, were taken to the Bharatiya Janata Party (BJP) headquartersin Delhion Friday for the people to pay their last respects to the departed leader. The body in a flower-decked casket was carried in a hearse to 6-A Deen Dayal Upadhyay Marg headquarters. File image of former prime minister Atal Bihari Vajpayee. PTI Vajpayyee, who passed away at the AIIMSin Delhi on Thursday evening at the age of 93, will be cremated at the Rashtriya Smriti Sthal near Rajghat in the national capital at 4 pm.",
"time_scraped": "2018-08-17 14:40:05.692810",
"article_id": "4983531",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee-book_PTI.jpg",
"path": "full/a7cddcc39eeeff38934f1c4ff60fb1b63d2cde7c.jpg",
"checksum": "c2b9303435b12e13f066e7632b14d2fc"
}
]
}