{
"source_article_link": "https://www.firstpost.com/india/kerala-rains-toll-rises-to-164-in-10-days-hundreds-of-defence-personnel-launch-operations-to-rescue-those-stranded-4984211.html",
"title": "Kerala rains: Toll rises to 164 in 10 days; hundreds of defence personnel launch operations to rescue those stranded",
"date_published": "2018-08-17T13:26:41+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Rains_PTI.jpg"
],
"article_body": "Thiruvananthapuram: More than a dozen helicopters, hundreds of defence personnel, National Disaster Response Force (NDRF) teams and ordinary fishermen with their motor boats on Friday launched a massive rescue operation in Kerala as rains subdued and the death toll touched 164 in 10 days. There were six new deaths reported on Friday. Although the intensity of rains decreased in several districts since Friday morning, waters from the big dams in Idukki district continued to be let out keeping 13 districts in red alert, except for Kasargode. An aeriel view of the floods in Aluva after heavy rains, in Kerala. PTI Waters from the Periyar river and its tributaries kept many towns in Ernakulam and Thrissur submerged. The worst affected include Paravur, Kalady, Chalakudy, Perumbavoor and Muvatupuzha. \"We have no food and there are 150 people waiting to be rescued,\" said a group of people who send a video clip to the television channels from Chalakudy. Thousands of people are still perched on high rise buildings waiting to be rescued and taken to relief camps. Over 50,000 people are lodged in the Ernakulam and Thrissur camps alone. Prime Minister Narendra Modi on Friday discussed the flood situation with Chief Minister Pinarayi Vijayan over the phone and said he would be heading to the state later in the day to take stock of the situation. There are 2.25 lakh people put up in 1,568 relief camps all over the state, Vijayan said on Friday. The central districts of Pathanamthitta is facing its worst ever calamity as the overflowing Pamba river has inundated several towns, including Ranni, Kozhenchery are completely submerged. Hundreds of experienced fishermen from the coastal villages of the state capital arrived at Pathanamthitta and started rescue operations as the helicopters began airlifting people to safer places. Aluva legislator Anwar Sadat said shortage of fuel was hampering rescues as the only mode of transport to be used is the boat. \"Things are very bad. Aluva is completely marooned. People have no food or water. Our only solace is the numerous fishermen who are rescuing us. \"But now even their families are asking them to return. More defence personnel are required, also they are more competent and the process will gain speed,\" said Sadat pleading for help. On Friday, Achenkovil river started overflowing into the Pandalam town. Helicopters filled with food packets left the state capital and headed to the central districts as the number of displaced people crossed lakhs. The authorities in the worst affected districts have taken over big lorries which can best navigate through the flooded roads to reach people marooned in small pockets. The Met has forecast less rains in the next 24 hours till Saturday, which is expected to aid the rescue and relief operations taken up on a war footing. Relief operations are progressing well in Malappuram, Kozhikode and Wayanad. The latter two districts have put up over 20,000 camps. Major national and state highways as well as the rail traffic continued to be disrupted in various parts of the state. Railway operations between Ernakulam and Thrissur is suspended; while the Alappuzha sector is open to Thiruvananthapuram, but the Kottayam sector is closed. Some long distance trains were being diverted via the Nagercoil sector. Kerala is facing the heaviest rains and floods witnessed in the state since 1924 which by now have caused massive destruction with damages to crops and properties estimated to be thousands of crores.",
"description": "Thiruvananthapuram: More than a dozen helicopters, hundreds of defence personnel, National Disaster Response Force (NDRF) teams and ordinary fishermen with their motor boats on Friday launched a massive rescue operation in Kerala as rains subdued and the death toll touched 164 in 10 days. There were six new deaths reported on Friday. Although the intensity of rains decreased in several districts since Friday morning, waters from the big dams in Idukki district continued to be let out keeping 13 districts in red alert, except for Kasargode. An aeriel view of the floods in Aluva after heavy rains, in Kerala. PTI Waters from the Periyar river and its tributaries kept many towns in Ernakulam and Thrissur submerged. The worst affected include Paravur, Kalady, Chalakudy, Perumbavoor and Muvatupuzha.",
"time_scraped": "2018-08-17 14:40:07.816708",
"article_id": "4984211",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Rains_PTI.jpg",
"path": "full/486edb84b8810fceeb4145060c61d8b00231645a.jpg",
"checksum": "80fb91c53b7d8880bc3237c182b0be8e"
}
]
}