{
"source_article_link": "https://www.firstpost.com/india/supreme-court-tells-keralas-national-crisis-management-committee-to-consider-lowering-water-level-of-mullaperiyar-dam-by-3-feet-4984591.html",
"title": "Supreme Court tells Kerala's National Crisis Management Committee to consider lowering water level of Mullaperiyar Dam by 3 feet",
"date_published": "2018-08-17T14:30:33+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Mullaperiyar380.jpg"
],
"article_body": "New Delhi: The Supreme Court on Friday asked the National Crisis Management Committee (NCMC) and a sub-committee set up by Kerala to deal with the flood situation in the state to coordinate and explore the possibility of reducing the water level at the Mullaperiyar Dam by three feet. A bench of Chief Justice Dipak Misra and Justice D Y Chandrachud asked Kerala and Tamil Nadu to abide by the directions given by NCMC on the rehabilitation of displaced people and the reduction of water level from the existing 142 feet to 139 feet at the dam. Mullaperiyar reservoir in Kerala. Reuters The bench observed that it was not an expert to deal with such severe natural calamity and was leaving to the executive to contain the crisis. The top court asked Kerala to submit the report on the steps taken on disaster management and rehabilitation measures. The death toll in the monsoon fury in the southern state has crossed 167, while rains and flood water have caused extensive damage. Rise in flood waters in Periyar River due to the rains and opening of the shutters of all major dams including Mullaperiyar, Cheruthoni, part of Idukki reservoir and Idamalayar, have severely affected the lives of people in downstream areas. Follow LIVE updates on Kerala rains here.",
"description": "New Delhi: The Supreme Court on Friday asked the National Crisis Management Committee (NCMC) and a sub-committee set up by Kerala to deal with the flood situation in the state to coordinate and explore the possibility of reducing the water level at the Mullaperiyar Dam by three feet. A bench of Chief Justice Dipak Misra and Justice D Y Chandrachud asked Kerala and Tamil Nadu to abide by the directions given by NCMC on the rehabilitation of displaced people and the reduction of water level from the existing 142 feet to 139 feet at the dam. Mullaperiyar reservoir in Kerala. Reuters The bench observed that it was not an expert to deal with such severe natural calamity and was leaving to the executive to contain the crisis.",
"time_scraped": "2018-08-17 14:40:49.417884",
"article_id": "4984591",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Mullaperiyar380.jpg",
"path": "full/61657a690e1d62b66642a7c038c85a005d5054fa.jpg",
"checksum": "e2182740759e1edeb5f503949783f388"
}
]
}