{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-twitterati-slam-national-media-for-ignoring-ravaged-state-ask-why-is-it-not-a-national-calamity-yet-4984251.html",
"title": "Kerala floods: Twitterati slam national media for ignoring ravaged state, ask why is it not a 'national calamity' yet",
"date_published": "2018-08-17T14:27:08+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-floods_PTI.jpg"
],
"article_body": "With at least 164 persons losing their lives in Kerala since 8 August, 1.5 lakh people in over 1,000 relief camps, more than 75,000 houses submerged in water, and most of its citizens getting no access to food and basic facilities, the state's citizens are outraged at how the national media isn't treating the situation with the gravity it deserves, with many on social media asking the Centre on why it isn't treating the situation as a national disaster. Heavy rains have lashed Kerala and caused flooding for the last 10 days. PTI The silence on part of the national media, coming just a few months after a video featuring Priya Prakash Varrier winking in a Malayalam movie went viral, makes many on social media question the nation's priorities when it comes to the state. With posts featuring the hashtag #KeralaFloodsNeedNationalDisasterTag, people, though aware of the efforts put in by the National Disaster Management Authority (NDMA), ask why the state isn't part of national priorities. Journalist Nikhila Henry asks, \"Red alert in all 14 districts; thousands crying out for their lives, 35 dams opened, the fourth busiest airport in the country remains closed; still this has not been declared as a national calamity; isn't it because Kerala is not part of India?\" The Facebook group, Delhi Solidarity Group, questioned the Rs 3,900 crores sanctioned for the Shivaji statue in Mumbai against the Rs 100 crore fund sanctioned for the worst floods and rains Kerala has faced in 140 years. The hashtag #100CrNotEnough is making its way around Twitter as well. \"The Central Government needs to do more for submerged state. A stony silence on the issue and a meagre sum of money is not a show of solidarity or good governance\", tweeted Antara. #100crNotEnough The central Government needs to do more for the submerged State. A stony silence on the issue and a meagre sum of money is not a show of solidarity or good governance. #KeralaFloodRelief pic.twitter.com/qAQGV83LJV — Antara (@mukh_ra) August 17, 2018 Prime Minister Narendra Modi's visit to the state on Friday evening was also met with criticisms. \"Why is it decided that only once the prime minister visits will the nation know about the crisis? Is it because national headlines about Kerala must feature his statements?\" wrote Naseel Voici, writer at on his Facebook page. But even while the outrage continues on social media, the question of when a calamity becomes a national disaster is still not clear. The NDRF is under the control of the NDMA. According to the National Disaster Management Policy of 2009, these units will be made available to state governments in the event of \"any serious threatening disaster situation\". Although nothing has been said by the central government on declaring Kerala floods as a national disaster yet, Union home minister Rajnath Singh said that additional NDRF teams are deployed in Kerala.",
"description": "With at least 164 persons losing their lives in Kerala since 8 August, 1.5 lakh people in over 1,000 relief camps, more than 75,000 houses submerged in water, and most of its citizens getting no access to food and basic facilities, the state's citizens are outraged at how the national media isn't treating the situation with the gravity it deserves, with many on social media asking the Centre on why it isn't treating the situation as a national disaster. Heavy rains have lashed Kerala and caused flooding for the last 10 days. PTI The silence on part of the national media, coming just a few months after a video featuring Priya Prakash Varrier winking in a Malayalam movie went viral, makes many on social media question the nation's priorities when it comes to the state. With posts featuring the hashtag #KeralaFloodsNeedNationalDisasterTag, people, though aware of the efforts put in by the National Disaster Management Authority (NDMA), ask why the state isn't part of national priorities. Journalist Nikhila Henry asks, \"Red alert in all 14 districts; thousands crying out for their lives, 35 dams opened, the fourth busiest airport in the country remains closed; still this has not been declared as a national calamity; isn't it because Kerala is not part of India?\" The Facebook group, Delhi Solidarity Group, questioned the Rs 3,900 crores sanctioned for the Shivaji statue in Mumbai against the Rs 100 crore fund sanctioned for the worst floods and rains Kerala has faced in 140 years.",
"time_scraped": "2018-08-17 14:40:48.248159",
"article_id": "4984251",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-floods_PTI.jpg",
"path": "full/4f795fce75c9efd2b3db20d4939bf1b3f7d9c6c1.jpg",
"checksum": "9d07bb37378c86faf1e5a8c6670b433b"
}
]
}