{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-kashmiris-mourn-a-leader-who-tried-to-restore-lost-their-dignity-4984501.html",
"title": "Atal Bihari Vajpayee passes away: Kashmiris mourn a leader who tried to restore their lost dignity",
"date_published": "2018-08-17T15:05:02+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-vaaj_380.jpg"
],
"article_body": "The demise of former prime minister and political stalwart Atal Bihari Vajpayee has saddened Kashmiris across the political divide, who is remembered here for talking strong political initiatives for the resolution of Kashmir dispute, that changed the political landscape of the state, particularly, the Valley. The former prime minister passed away at AIIMS in New Delhi on Thursday evening, after being hospitalised for nine weeks. His death despite being out of active political life for some time nowis being mourned across India. A file photo of Atal Behari Vajpayee. Reuters Vajpayee broke the ice in Kashmir by addressing a rally in Kashmir— for decades noprime minister had done that— when he on 18 April, 2003 addressed a huge gathering in Srinagar’s SK Stadium and his speech triggering not just inside the Valley but on the borders too. The most important being on the India-Pakistan front. “All problems are settled through talks. We are ready (for talks) to solve the problems within (internal) and the problems outside (external),” Vajpayee told a huge gathering, which was managed by thenchief minister Mufti Mohammad Sayeed, to the dismay of his then alliance partner Congress. He said India was ready friendship with Pakistan as both countries shared thousands of years of old civilisation. “Maps are changing. We also must change and it is the appropriate time for changing the maps. We in Delhi are changing maps. We will work jointly,” he said to the thunders applause of the people. “We must work in tandem to save democracy, humanity and Kashmiryat,”Vajpayee said, offering “justice and humanity” ( ) as the basis for talks. That speech changed the on the ground situation at least in the Kashmir Valley, the frisking by forces on the roads, crackdowns, and the Special Operations Group, which was held responsible by human rights groups, was disbanded, suddenly. \"There was something him which also changed the political discourse in Kashmir. Here was a man from a Right-wing party, who just did not want peace between India and Pakistan, but wanted to give back lost dignity to the people of Kashmir. He will be always remembered as a reference point on Kashmir,\" Naeem Akhtar, Senior Peoples Democratic Party leader, told , after the death of the poet prime minister. “He showed the way for the future prime ministers. That you can expect to bring peace without playing with the sentiments of people. And that this (Kashmir) issue can be resolved and this can be followed by the other people,\" Akhtar said. In Jammu and Kashmir, Vajpayee's tenure had always been remembered as a first Delhi-based politician who started several initiatives for the resolution of Kashmir problem. Vajpayee was among the few politicians who were involved in Kashmir for decades. In 1953 he accompanied Bharatiya Jan Sangh founder Syama Prasad Mukherjee to Kashmir when entry into the state was restricted. He was arrested along with Mukherjee, who died in custody triggering an agitation that led to the dismissal of Sheikh Abdullah’s government and his subsequent arrest. National Conference leader, Ali Mohammed Sagar, who meet Vajpayee when he was the prime minister, told , that it was because of his knowledge on Kashmir and the “wrongdoing by New Delhi”, committed by every other prime minister which made Vajpayee rethink Kashmir and its issues. “He met Hurriyat leaders and went to Pakistan by bus and addressed people from Minar-e-Pakistan and said you can change friend but not neighbours. He was a statement like few others in Indian politics,” Sagar said. “That kind of atmosphere is missing today,” he said. With his own style of statesmanship, Vajpayee made his era different on the Kashmir front. Peoples Democratic Party president Mehbooba Mufti said the demise of the veteran leader is an end of an era, \"where he always showed courage and conviction in healing Kashmir through his reconciliatory measures\". She said Vajpayee was a crusader of peace who understood Kashmir and initiated a series of CBMs for people of Kashmir, respecting their sentiments. Ashok Khujaria, senior Bharatiya Janata Party leader, who is one the few people still associated with the party from the old school, said he was astonished by the way Vajpayee tried to beat his own hawkish side and his other colleagues who were pessimistic about any forward movement in Kashmir. “Many of us had a problem when he floated the idea of talking to the separatists, but that did work and it was for good. His intention of solving the Kashmir conundrum was straight from the heart,” Khujaria said. “Not many prime ministers have had that kind of attitude,” Khujaria said. Jammu and Kashmir governor NN Vohra also expressed grief over the demise of former Vajpayee. He described him as an astute and visionary leader whose thinking was deeply infused by humanism. CPM leader and MLA Kulgam, Mohammad Yousef Tangrami said the Vajpayee tried to reach to the people of Kashmir by initiating certain important initiatives which helped in creating hope among the people. “Opening of dialogue with stakeholders including Pakistan and other dissenting voices were meaningful steps which were taken during his tenure. Besides, the opening of trade and people to people contact across LOC which were seen as major confidence-building measures were initiated during his prime ministership. Despite severe limitations of BJP’s policies, he will be remembered for not following the 'beaten tracks',” Tangrami said in a statement.",
"description": "The demise of former prime minister and political stalwart Atal Bihari Vajpayee has saddened Kashmiris across the political divide, who is remembered here for talking strong political initiatives for the resolution of Kashmir dispute, that changed the political landscape of the state, particularly, the Valley. The former prime minister passed away at AIIMS in New Delhi on Thursday evening, after being hospitalised for nine weeks. His death despite being out of active political life for some time nowis being mourned across India. A file photo of Atal Behari Vajpayee. Reuters Vajpayee broke the ice in Kashmir by addressing a rally in Kashmir— for decades noprime minister had done that— when he on 18 April, 2003 addressed a huge gathering in Srinagar’s SK Stadium and his speech triggering not just inside the Valley but on the borders too. The most important being on the India-Pakistan front. “All problems are settled through talks. We are ready (for talks) to solve the problems within (internal) and the problems outside (external),” Vajpayee told a huge gathering, which was managed by thenchief minister Mufti Mohammad Sayeed, to the dismay of his then alliance partner Congress.",
"time_scraped": "2018-08-19 01:02:53.306689",
"article_id": "4984501",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-vaaj_380.jpg",
"path": "full/812f69710258ab97a6d3ae93038788ec8871eb33.jpg",
"checksum": "d0da33969104ceb4003112e21008a726"
}
]
}