{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-funeral-swami-agnivesh-heckled-assaulted-outside-bjp-hq-by-mob-activist-was-going-to-pay-last-respects-to-ex-pm-4984371.html",
"title": "Atal Bihari Vajpayee funeral: Swami Agnivesh heckled, assaulted outside BJP HQ by mob; activist was going to pay last respects to ex-PM",
"date_published": "2018-08-17T13:30:04+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/agnivesh-reuters.jpg"
],
"article_body": "Swami Agnivesh was assaulted by a mob once again at DDU Marg in New Delhi on Friday morning. The assault happened outside the BJP office on the Deendayal Upadhyay Road, reports have said. Reports further added that the social activist was heckled and assaulted by a mob when he wason his way topay his last respectsto former prime minister Atal Bihari Vajpayee at the BJP headquarters. A video tweeted by showed Agnivesh walking towards the venue, as a few members of the crowd begin to heckle and then physically assault him. A woman can be seen attempting to hit Agnivesh with her slipper as media crew follow the activist.The people following the activist were raising slogans of and , a few metres away from BJP headquarters. File image of activist Swami Agnivesh.Reuters The incident comes a month after he was assaulted similarly by a mob in Jharkhand's Pakur district.the mob consisted of BJP Yuva Morcha activists who raised slogans of ‘Swami go back’. Reacting to what he called the \"murderous assault\" , Agnivesh said, \"I have asked the police to investigate the matter. Don't know what they were angry about. They were not ready to listen to me.\" He added that the attack was a sponsored attack and that the government should have provided security, CNN-News 18 reported. Agnivesh is now under medical care in a hospital.",
"description": "Swami Agnivesh was assaulted by a mob once again at DDU Marg in New Delhi on Friday morning. The assault happened outside the BJP office on the Deendayal Upadhyay Road, reports have said. Reports further added that the social activist was heckled and assaulted by a mob when he wason his way topay his last respectsto former prime minister Atal Bihari Vajpayee at the BJP headquarters. A video tweeted by showed Agnivesh walking towards the venue, as a few members of the crowd begin to heckle and then physically assault him. A woman can be seen attempting to hit Agnivesh with her slipper as media crew follow the activist.The people following the activist were raising slogans of",
"time_scraped": "2018-08-17 14:40:13.605783",
"article_id": "4984371",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/agnivesh-reuters.jpg",
"path": "full/04da3156716986684a8550ce4786d3315bfb67ad.jpg",
"checksum": "55a794929e387abf6e7dab84089a3fa2"
}
]
}