{
"source_article_link": "https://www.firstpost.com/india/understanding-rescue-relief-ops-during-kerala-floods-dynamic-coordination-centres-help-evacuate-those-stranded-in-remote-parts-4984241.html",
"title": "Understanding rescue, relief ops during Kerala floods: Dynamic coordination centres help evacuate those stranded in remote parts",
"date_published": "2018-08-17T13:48:11+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/WhatsApp-Image-2018-08-15-at-4.10.19-PM.jpeg"
],
"article_body": "Rains have subsided in several districts of Kerala but rescue operations continue with renewed intensity, as the death toll has risen to 164 in the last 10 days. Water from the big dams of Idukki district continue to be let out, and 13 districts of the state remain under red alert. The toll is likely to rise over the next few days as hundreds of people remain stranded in flooded areas, according to The Indian Express .While multiple sources on the ground report a slight reduction in the water level in Ranni and Pathanamthitta areas, many two-storey houses were fully submerged in water in and around Aluva, a town hardly 30 kilometres north of Kochi, on Friday morning. Rescue operations are on in full swing in Kerala amid heavy rain. Firstpost/Naveen Nair Kerala chief minister Pinarayi Vijayan on Friday stated that 16 teams of army, 13 teams of navy, 10 teams of air force and 39 teams of the NDRF are now engaged in rescue operations. The NDRF has so far rescued 4,000 people, while the navy has rescued 550. Speaking to , TV Sajeev, head of the forest health division, Kerala Forest Research Institute, said that there are three groups from outside the state who are coordinating rescue operations at the moment: NDRF, navy and air force. \"They have divided Kerala into three portions for purposes of operational efficiency. Rescue activities are coordinated at the district level, every district collector is operating a district coordination centre, and additionally, has their own rescue teams. Official helplines have been constituted across institutes and offices. Their role is to break down the locations of the stranded people into geographical coordinates and then transfer the information to the District Coordination Centre,\" said Sajeev. The District Coordination Centre then assigns the locations to different rescue teams, manned either by the national forces or district teams. The rescued people are being transferred to relief camps across districts which provide accommodation, food and basic medical care services. Private relief camps have also been set up across districts. There are 2.25 lakh people put up in 1,568 relief camps all over the state, Vijayan said on Friday. Sajeev said that if there is a medical emergency, helplines flag it while passing on information. The cases are then routed to either a functional super speciality hospital at the respective district, or coordinate with the District Coordination Centres and decide. \"When medical emergencies crop up at relief camps, the problem is that routes to the functional hospitals within some districts are submerged, so either we have to use boats or escalate this to the district coordination teams again,\" he said. Thousands of people are still perched on highrise buildings waiting to be rescued and taken to relief camps. Over 50,000 people are lodged at the Ernakulam and Thrissur camps alone. Local fishermen have also joined the rescue mission, bringing in their boats to help in the evacuation of the stranded people in various places in Aluva, Kalady, Perumbavoor, Muvattupuzha and Chalakudy. The National Crisis Management Committee on Thursday decided to scale up relief and rescue operations in flood-hit Kerala by involving the three defence services and other agencies, besides providing essential commodities to marooned people in 14 worst-affected districts. Follow LIVE updates on Kerala rains here",
"description": "Rains have subsided in several districts of Kerala but rescue operations continue with renewed intensity, as the death toll has risen to 164 in the last 10 days. Water from the big dams of Idukki district continue to be let out, and 13 districts of the state remain under red alert. The toll is likely to rise over the next few days as hundreds of people remain stranded in flooded areas, according to The Indian Express .While multiple sources on the ground report a slight reduction in the water level in Ranni and Pathanamthitta areas, many two-storey houses were fully submerged in water in and around Aluva, a town hardly 30 kilometres north of Kochi, on Friday morning. Rescue operations are on in full swing in Kerala amid heavy rain. Firstpost/Naveen Nair",
"time_scraped": "2018-08-17 14:40:49.408293",
"article_id": "4984241",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/WhatsApp-Image-2018-08-15-at-4.10.19-PM.jpeg",
"path": "full/b9e5c5daa63aebef6990565051ee24ae20c4d7cf.jpg",
"checksum": "1ad00d69233181e83acd81ded8987e26"
}
]
}