{
"source_article_link": "https://www.firstpost.com/india/minimum-support-price-unkept-promises-on-cost-mitigation-bad-formula-to-determine-msp-compound-farm-woes-4986921.html",
"title": "Minimum support price: Unkept promises on cost mitigation, bad formula to determine MSP compound farm woes",
"date_published": "2018-08-17T19:24:30+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/farmers-punjab-afp.jpg"
],
"article_body": "Editor's Note: Farmers across India are sceptical about the promised benefits of the minimum support price (MSP) promised by the government for their crop. In a , the government announced that the MSP would be set at 50 percent over the cost of production and vowed to double farmers’ incomes by 2022. As Amrinder Singh Punia, a farmer and general secretary of the Punjab Agricultural University Kisan Club, points out, “Government has only concentrated on paddy, wheat and cotton procurement by its agencies like the Food Corporation of India and Cotton Corporation of India. There is no procurement of maize, ragi, jowar, and other pulses by government agencies.” Therefore, most farmers have little choice but to sell their crops in the open market at whatever price they can get. Farmers know that state procurement is limited to just these few crops. What irks them is that even here, the performance of procurement agencies has been poor. As R Ramakumar, a professor at the Tata Institute of Social Sciences, Mumbai points out, for all crops (except sugarcane), fewer than 5 percent of households report sales to a government agency or cooperative that assures an MSP. Representational image. AFP Poor procurement system “Farmers largely sell their output to private traders. Only 31 percent of paddy farmers and 39 percent of wheat farmers are even aware of the MSP scheme. Worse, only 13.5 percent of paddy farmers and 16.2 percent of wheat farmers sell their harvest to procurement agencies. The reason for this is the shortage or unavailability of procurement agencies and local purchasers,” says Ramakumar. He argues for expanding the procurement system rather than adopting cash-transfer models like the Bhavantar Bhugtan Yojana (BBY) in Madhya Pradesh. Under the BBY, the government pays an amount equivalent to the difference between the MSP and the average price in the market into the farmer’s bank account. “With schemes like BBY, the government would have no incentive to expand the procurement system by investing more in warehousing and storage,” Ramakumar points out. “When procurement suffers, so does distribution; with less food procured, there would also be less scope to run an efficient public distribution system (PDS). Given the option of paying the farmer a fixed amount, the government would aim to abandon procurement, and thus distribution, altogether.” Ramakumar believes a universal PDS would allow the government to put the procured agricultural commodities to good use by distributing it among the poorer sections of the population. Widening the PDS to distribute agricultural commodities would also exert a sharp downward pull on food prices and inflation. Expanding the PDS will also force thegovernment to increase the volume of theproduce it buys from farmers. Moreover, a BBY-type scheme is vulnerable to manipulation by traders, he says. As the experience of BBY in Madhya Pradesh has shown, traders colluded to push down prices soon after cash payments began, and asked farmers to collect the difference from the government. As soon as the window for BBY payments closed, prices return to normal. Says Chhattisgarh farmer Sudesh Tikam, “The Central government had declared an MSP of Rs 4,400 per quintal of gram, but they did not purchase gram from the farmers. So, we launched the 'Chana Satyagraha' across the state.” He adds that due to the failure of the government, four lakh gram growers in the state have been left in the lurch. Gyandalal Patidar, a farmer from Madhya Pradesh, believes that MSP only benefits the big farmers. “If we get the value of our produce in the market itself, it will save us the trouble of running around. It’s difficult for those farmers who are not well educated,” he says. Ramakumar says the reason why the MSP benefits only the bigger farmers is that small farmers are desperate to sell their crops quickly and cannot endure the delays of the public procurement process. So, middlemen take advantage of them. Formula fails farmers The Commission for Agricultural Costs and Prices has used the ‘A2+FL’ formula to calculate MSP. The cost of purchasing inputs like seeds, pesticides, fertilisers and machinery among others falls under the ‘A2’ cost category, while the cost of family labour is reflected in the ‘FL’ component. The National Commission on Farmers (NCF), headed by eminent agronomist MS Swaminathan, had employed a more comprehensive calculation of costs (‘C2’) and recommended that the MSP should be set at 50 percent over C2 if farming was to be made profitable. Gurcharan Singh Maur, farmer leader from Rajasthan says that the support price has been increased according to the A2 formula under which only direct expenses and labour costs incurred by the farmer have been considered. He says farmers want the MSP to be determined using the C2 formula. As Punjab farmer Punia points out, though the government has increased MSP of paddy by Rs 200 per quintal, it isn’t enough. There has been a steady increase in the prices of seeds, fertilisers, pesticides and labour over the past few years. This leaves very little scope for a farmer like him to make a profit. He adds that in addition to using the ‘C2+ 50%’ formula for calculating the MSP, the government also needs to expand procurement beyond the Punjab-Haryana-western Uttar Pradesh farm belt. “We also need to expand procurement to more crops also, such as coarse grains, millets and pulses.” “The data from the Situation Assessment Survey of 2012-13 shows that the average monthly income of an agricultural household in India at Rs 6,426, was only one-third of the minimum salary stipulated by the 7th Pay Commission,” says Ramakumar. “The need-based minimum monthly income stipulated by the commission for a worker with a family is Rs 18,000 .” The BJP had set the goal of making agriculture profitable in its 2014 election manifesto. It promised farmers a minimum 50 percent margin over the cost of production, cheaper agriculture inputs and credit, access to new farming technologies using the rural-employment guarantee schemes to aid agriculture. The party had promised it would implement the NCF’s recommendation once it came to power. Four years later, farmers are justifiably angry that nothing of the sort has happened. Also Read Minimum support price: Poll gimmicks cannot alleviate farm distress, government steps woefully inadequate 101Reporters.com",
"description": "Editor's Note: Farmers across India are sceptical about the promised benefits of the minimum support price (MSP) promised by the government for their crop. In a , the government announced that the MSP would be set at 50 percent over the cost of production and vowed to double farmers’ incomes by 2022. As Amrinder Singh Punia, a farmer and general secretary of the Punjab Agricultural University Kisan Club, points out, “Government has only concentrated on paddy, wheat and cotton procurement by its agencies like the Food Corporation of India and Cotton Corporation of India. There is no procurement of maize, ragi, jowar,",
"time_scraped": "2018-08-20 03:51:35.014706",
"article_id": "4986921",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/farmers-punjab-afp.jpg",
"path": "full/a8be4b4ee8a98d92e61d99cd59659b0846c823d1.jpg",
"checksum": "dd098c0e240f79a5eaf00b723174c2c3"
}
]
}