{
"source_article_link": "https://www.firstpost.com/politics/atal-bihari-vajpayees-body-cremated-with-full-state-honours-in-delhi-narendra-modi-leads-thousands-to-bid-adieu-to-ex-pm-4986461.html",
"title": "Atal Bihari Vajpayee's body cremated with full State honours in Delhi; Narendra Modi leads thousands to bid adieu to ex-PM",
"date_published": "2018-08-17T18:43:49+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/vajpayeee_twitteratbjp4india.jpg"
],
"article_body": "The mortal remains of former prime minister Atal Bihari Vajpayee were cremated with full State honours in Delhi on Friday. Before the last rites were performed, Prime Minister Narendra Modi, BJP chief Amit Shah, several Union ministers and chief ministers of many states walked the entire 3.6-kilometre stretch of the funeral procession. Former prime minister Manmohan Singh, Lok Sabha Speaker Sumitra Mahajan, veteran BJP leaders and Vajpayee's long-time associates LK Advani and Murli Manohar Joshi, RSS chief Mohan Bhagwat, Home Minister Rajnath Singh, External Affairs Minister Sushma Swaraj, Defence Minister Nirmala Sitharaman and Congress president Rahul Gandhi were present at the funeral. Others attending the ceremony were, Delhi chief minister Arvind Kejriwal, his deputy Manish Sisodia, Chhattisgarh chief minister Raman Singh, and Congress leaders Ghulam Nabi Azad, Anand Sharma, Ashok Gehlot and Raj Babbar. Former Prime Minister Dr Manmohan Singh and Congress President @RahulGandhi arrive to attend the funeral of former Prime Minister Atal Bihari Vajpayee. pic.twitter.com/TVMSVKHshb — Congress (@INCIndia) August 17, 2018 Vajpayee's foster daughter Namita Bhattacharya lit the funeral pyre amid the chanting of Vedic hymns and firing of a 21-gun salute by soldiers atthe funeral. After the mortal remains were brought from BJP headquarters to Rashtriya Smriti Sthall, the three service chiefs placed wreaths on the body of Vajpayee, in keeping with the military honours. Sitharaman, President Ram Nath Kovind and Modi were among those who paid homage to Vajpayee. Army Chief General Bipin Rawat, Navy Chief Admiral Sunil Lanba & Air Chief Marshal Birender Singh Dhanoa, pay last tribute to former PM #AtalBihariVajpayee at Smriti Sthal in Delhi pic.twitter.com/oDq4kzHl4V — ANI (@ANI) August 17, 2018 Several foreign dignitaries likeKing of Bhutan Jigme Khesar Namgyel Wangchuck, former Afghanistan president Hamid Karzai, Pakistan acting law minister Syed Ali Zafar, Nepal foreign minister Pradip Kumar Gyawali were present on the banks of the Yamuna, the BJP patriarch's final resting place. \"We are here to share your grief and pay our condolences on the behalf of people of Pakistan and the Government of Pakistan,\" Pakistan law minister Ali Zafar told . The Tricolour that was wrapped around Vajpayee's bodywas handed over to his foster granddaughter Niharika, after which the body was given to the family for last rites. Delhi: Tricolour wrapped around mortal remains of #AtalBihariVajpayee handed over to his granddaughter Niharika. pic.twitter.com/Ela6rD3PWG — ANI (@ANI) August 17, 2018 Earlier, thousands of mourners joined Modi, Shah, and other BJP leaders in the funeral procession. The chief ministers who were a part of the procession included Vijay Rupani, Shivraj Chouhan, Yogi Adityanath and Devendra Fadnavis.Heavy security was deployed along the route. India pays tributes to our beloved Atal Ji. #AtaljiAmarRahen pic.twitter.com/HzJWb1UQtk — BJP (@BJP4India) August 17, 2018 People spilled over barricades and jostled to get a glimpse of the former prime minister. During the procession, people chanted slogans like \"Atal Bihari Amar Rahe\" as Vajpayee's cortege made its way from the BJP headquarters to the cremation ground. Prime Minister @narendramodi joined other dignitaries and citizens from all walks of life to pay tributes to the former Prime Minister of India Shri Atal Bihari Vajpayee at the @BJP4India headquarters in Delhi. pic.twitter.com/CoeKx53VV8 — PMO India (@PMOIndia) August 17, 2018 The decorated gun carriage carrying his mortal remains left the BJP headquarters on Deen Dayal Upadhyay Marg around 2 pm. On Thursday night, Vajpayee's body was taken to his official residence on Krishna Menon Marg from AIIMS where he was admitted on June. On Friday morning, Rahul Gandhi, Andhra Pradesh chief minister N Chandrababu Naidu, National Security Advisor Ajit Doval, Army chief General Bipin Rawat, Chief of Naval Staff Admiral Sunil Lanba and RSS chief Mohan Bhagwat paid homage to the former prime minister at his official residence. Vajpayee passed away at the All India Institute of Medical Sciences (AIIMS) in Delhi on Thursday evening after a prolonged illness. The country is observing a seven-day state mourning as a mark of respect for the leader. SAARC, France condole death; Union Jack flies half-mast at British High Commission The South Asian Association for Regional Cooperation (SAARC) on Friday condoled Vajpayee's death, describing him as a strong advocate of cooperation within the South Asian region. Thousands joined the funeral procession to bid farewell to former prime minister Atal Bihari Vajpayee on Friday. Twitter@BJP4India In a message to Foreign Secretary Vijay Gokhale, SAARC secretary general Amjad Hussain B Sial said: \"We have lost a great statesman, politician, writer, poet, and above all a humane person committed to peace.\" Sial, who is from Pakistan and assumed office as SAARC secretary general in March 2017, recalled Vajpayee's statements at the 10th SAARC Summit in Colombo in 1998, in Kathmandu in 2002 and in Islamabad in 2004 and said: \"His vision for a self-reliant and fully integrated South Asia continues to guide the Saarc process even today.\" TheSAARC secretary general also recalled Vajpayee's \"grand diplomatic gesture\" of taking bus rides to Lahore and Dhaka during his prime ministership. \"Besides, as the three-time prime minister of India, Vajpayee's leadership greatly contributed to the prosperity and stability of India, and the country attained steady economic growth and became a leader in information technology,\" Sial said. France also condoled the death of Vajpayee, saying his name will remain linked to India-French friendship as he shaped the strategic partnership that the two countries share. \"It was with deep grief that we learnt of the demise of former Indian Prime Minister Atal Bihari Vajpayee,\" the French foreign ministry said in a statement. \"France offers its condolences to his family as well as the Indian authorities and people,\" it said. \"Poet, politician, visionary, he left his mark on India's history. His name remains linked to the Indo-French friendship, which he shaped by launching the strategic partnership that has united our two countries since 1998.\" Meanwhile, the British High Commission in Delhi flew its national flag, the Union Jack, at half mast in honour of Vajpayee. Union Flag flies half-mast at the British High Commission in New Delhi as mark of respect to Shri #AtalBehariVajpayee . UK stands with people of India. #AtalJiAmarRahen pic.twitter.com/F3k0xyaSGI — UK in India🇬🇧🇮🇳 (@UKinIndia) August 17, 2018 Mourning Vajpayee's demise, British High Commissioner to India Dominic Asquith said: \"He (Vajpayee) was an enormously important person who we have great respect for and it's a great loss for India. I wanted to pay my respects to a man of that stature.\" The Dalai Lama, the Tibetan spiritual leader, sent a condolence message to Namita, saying India had lost an eminent national leader who had eloquently supported the Tibetan people. Vajpayee served three times as India's prime minister; for 13 days in 1996, for 13 months from 1998 to 1999, and then from 1999 to 2004.",
"description": "The mortal remains of former prime minister Atal Bihari Vajpayee were cremated with full State honours in Delhi on Friday. Before the last rites were performed, Prime Minister Narendra Modi, BJP chief Amit Shah, several Union ministers and chief ministers of many states walked the entire 3.6-kilometre stretch of the funeral procession. Former prime minister Manmohan Singh, Lok Sabha Speaker Sumitra Mahajan, veteran BJP leaders and Vajpayee's long-time associates LK Advani and Murli Manohar Joshi, RSS chief Mohan Bhagwat, Home Minister Rajnath Singh, External Affairs Minister Sushma Swaraj, Defence Minister Nirmala Sitharaman and Congress president Rahul Gandhi were present at the funeral. Others attending the ceremony were, Delhi chief minister Arvind Kejriwal, his deputy Manish Sisodia, Chhattisgarh chief minister Raman Singh, and Congress leaders Ghulam Nabi Azad, Anand Sharma, Ashok Gehlot and Raj Babbar. Former Prime Minister Dr Manmohan Singh and Congress President @RahulGandhi arrive to attend the funeral of former Prime Minister Atal Bihari Vajpayee.",
"time_scraped": "2018-08-19 01:02:42.992180",
"article_id": "4986461",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/vajpayeee_twitteratbjp4india.jpg",
"path": "full/bec411642ba120ea827d0bdbee6c85d029ce59f9.jpg",
"checksum": "fc6ce4580e9a90a26be84afcd00b3c0a"
}
]
}