{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-state-was-not-only-late-in-waking-up-to-the-calamity-but-is-also-ill-equipped-to-deal-with-it-4987091.html",
"title": "Kerala floods: State was not only late in waking up to the calamity but is also ill-equipped to deal with it",
"date_published": "2018-08-17T19:55:32+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala_Floods_101Reporters.jpg"
],
"article_body": "A splendid network of rivers, backwaters and hills makes Kerala a dream state, but this dream can also quickly turn into a nightmare when disaster strikes. The 44 rivers, their 30 tributaries, 55 dams and 1,500 km of backwater canals can potentially flood the state. And when that happens, the magnificent landscapecan also become a bewildering topography for rescuers to navigate and save lives. That’s when the famed God’s Own Country turns into a dreadful God’s Own Curse. And that’s what the floods now ravaging the state, the worst in 94 years, have proved. If inaccessibility of the terrain makes rescue effort a tough job, the state’s Left government made it even tougher for itself by not reacting to the calamity till it assumed catastrophic proportions. Even as more and more rescue teams are trying to save marooned people, a feeling is slowly gaining ground in the state that the government failed to take note of the mega disaster while it was still in the making in the past one month or even earlier. And even when it began to see the signs of a tragedy, the state began to haggle with the Centre over flood relief it should get by way of money, instead of demanding and ensuring the deployment of central forces well in time. The Kerala floods have claimed the lives of over 320 people so far. Image courtesy: Coovercolly Indresh/101Reporters The intensity and spread of the floods, affecting almost the entire state, are truly mind-boggling. Since 29 May, over 320 people have died. The toll is certain to go up as rescue teams continue to discover bodies across the state. About two lakh people have been shifted to some 1,500 relief camps. Since 1 June, the state has received 21 cm of rain instead of the normal quantity of 16 cm, and there is sign of any respite in the downpour. The precise magnitude of nature’s fury can seldom be predicted, but rising water levels in rivers and reservoirs and ominous rainfall forecasts, coupled with Kerala’s terrain that is notoriously tough to navigate even at normal times, should have sounded alarm bells loud and clear even before the big deluge came. The kind of response to weather warnings and the ensuing preparedness, which you would see from Odisha’s Naveen Patnaik or Andhra Pradesh's Chandrababu Naidu or the late J Jayalalithaa of Tamil Nadu (though she fell woefully short of expectations in the year before her death) in dealing with cyclones was missing in Kerala just when the threat of floods was beginning to loom. On the face of it, this comparison mayseem unfair for three reasons. One: cyclones are usually intensive but not extensive, making it easier to put in place rescue and relief plans in advance. Two: cyclones typically last fewer days than the current Kerala floods. Three: these states are prone to cyclones and the drill of what to do has become fairly routine there. Warning signs ignored But the absence of immediate precedents of big disasters is no excuse for not being on the defensive when a big one threatens to strike, especially if there were hints of it. Floods haven’t submerged Kerala overnight. There is no denying that Kerala has not seen a disaster of this scale since July 1924 when 33.7 cm of torrential rain over three weeks sent the Periyar river flooding most parts of what is now called Kerala. The 1924 deluge, which even submerged the famed 5,000-feet high hill station Munnar, is part of Kerala’s folklore and literature. The calamities the state has seen since then have been relatively low-intensity affairs, localised to smaller regions. But the early hints of the current disaster drew only a routine reaction from the Left government. When Kerala chief minister Pinarayi Vijayan met Narendra Modi on 19 July, flood relief was only one of his many demands and the only one the prime minister agreed to. This only led to an unseemly war of words about many projects that Centre refused to clear in Kerala and those which had been cleared but the state had failed to execute. As days went by and the situation worsened, the state found itself ill-equipped to deal with it. Vijayan spoke to central leaders several times and the result was the 12 August aerial survey of affected areas by Union Home Minister Rajnath Singh. After this tour, Singh said : “...the situation in Kerala is very serious...Both the Centre and the state will work together to meet the challenge.” CPM-BJP bonhomie? Luckily, the indications are that the Centre and the state are indeed working together. Vijayan said in a letter to Singh the very next day: “We are grateful for the special care and consideration being given by the Union Government during these difficult times.” There are as many as 80 teams from the army, navy, air force and the National Disaster Response Force (NDRF) engaged in rescue operations. It does immense credit to the Left Front government of Kerala as well the NDA government at the Centre that the crisis was not allowed to degenerate into a major confrontation, considering the CPM-BJP hostilities which even result in murders in the state. The people of Kerala must hope that this bonhomie lasts at least till normalcy is restored in the state. It's safe to presume that Kerala will take a while before it completely returns to normalcy. Even after the rains stop and water levels recede, the state will face a mammoth task of rehabilitation of victims. It needs a collective and coordinated effort by all parties to bring the state back to normal.",
"description": "A splendid network of rivers, backwaters and hills makes Kerala a dream state, but this dream can also quickly turn into a nightmare when disaster strikes. The 44 rivers, their 30 tributaries, 55 dams and 1,500 km of backwater canals can potentially flood the state. And when that happens, the magnificent landscapecan also become a bewildering topography for rescuers to navigate and save lives. That’s when the famed God’s Own Country turns into a dreadful God’s Own Curse. And that’s what the floods now ravaging the state, the worst in 94 years, have proved. If inaccessibility of the terrain makes rescue effort a tough job, the state’s Left government made it even tougher for itself by not reacting to the calamity till it assumed catastrophic proportions. Even as more and more rescue teams are trying to save marooned people, a feeling is slowly gaining ground in the state that the government failed to take note of the mega disaster while it was still in the making in the past one month or even earlier. And even when it began to see the signs of a tragedy, the state began to haggle with the Centre over flood relief it should get by way of money, instead of demanding and ensuring the deployment of central forces well in time. The Kerala floods have claimed the lives of over 320 people so far. Image courtesy: Coovercolly Indresh/101Reporters The intensity and spread of the floods, affecting almost the entire state, are truly mind-boggling. Since 29 May, over 320 people",
"time_scraped": "2018-08-19 01:02:29.804537",
"article_id": "4987091",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala_Floods_101Reporters.jpg",
"path": "full/4fd6b9af20548de8bb0df37fb5a2346db2162af1.jpg",
"checksum": "f48e7ed24de67b4ec28c0817b53dded3"
}
]
}