{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-icici-bank-contributes-rs-10-crore-towards-relief-work-waives-penalties-on-late-payment-of-emi-on-loans-4987001.html",
"title": "Kerala floods: ICICI Bank contributes Rs 10 crore towards relief work, waives penalties on late payment of EMI on loans",
"date_published": "2018-08-17T19:30:55+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-floods_PTI_380.jpg"
],
"article_body": "ICICI Bank on Friday announced that it will contribute Rs 10 crore for rehabilitation work in flood-hit Kerala, where over 300 people have died because of the floods. Kerala government announced that another 250 boats and 23 helicopters will be added to rescue operations on Friday. PTI A press release issued by the bank says, \"The majority of the contribution will be extended to the Chief Minister’s Distress Relief Fund. The bank will also contribute to the District Collectors’ efforts in all the 14 districts of the state to help in the supply of essential commodities like clothes, food items, medicines, sanitation and hygiene products and others. In addition, ICICI Bank has announced a slew of measures to help the flood-hit customers of the state. The bank will waive off penalties on late payment of EMI for all retail loans—home, car and personal—for its customers in Kerala in the month of August. Also, there will be no penalty for late payment of credit card dues, as well as no cheque bouncing charges for the bank’s customers in Kerala this month. Tom Jose, chief secretary of the government of Kerala said, “We thank ICICI Bank for coming forward and supporting the state of Kerala in this time of need. ICICI Bank has promised to donate Rs 10 crore for the relief and rehabilitation work in the state. Of this, Rs 8 crore will be donated to the Chief Minister’s Distress Relief Fund while Rs 2 crore will be provided to all the 14 district administrations to help them buy relief material. In this hour of need, it is important that we all stand together to help the people of Kerala.” The deadliest deluge in the state in close to a century has claimed 324 lives since 8 August and 2,23,139 people are in about 1500+ relief camps. The state is ravaged by unprecedented rains, which forced the authorities to open gates of 80 dams in southern India.",
"description": "ICICI Bank on Friday announced that it will contribute Rs 10 crore for rehabilitation work in flood-hit Kerala, where over 300 people have died because of the floods. Kerala government announced that another 250 boats and 23 helicopters will be added to rescue operations on Friday. PTI A press release issued by the bank says, \"The majority of the contribution will be extended to the Chief Minister’s Distress Relief Fund. The bank will also contribute to the District Collectors’ efforts in all the 14 districts of the state to help in the supply of essential commodities like clothes, food items, medicines, sanitation and hygiene products and others.",
"time_scraped": "2018-08-19 01:02:35.288842",
"article_id": "4987001",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-floods_PTI_380.jpg",
"path": "full/c9f5c1a6a52b88801db4124a4eff6d531afdd782.jpg",
"checksum": "3c4de565c269411c0c48b4ff96eb7d55"
}
]
}