{
"source_article_link": "https://www.firstpost.com/india/bengalurus-bus-system-loses-least-money-thanks-to-better-supply-chain-strategies-lower-staff-costs-4988221.html",
"title": "Bengaluru's bus system loses least money, thanks to better supply chain strategies, lower staff costs",
"date_published": "2018-08-18T11:54:34+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/BMTC_-380.jpg",
"https://public.tableau.com/static/images/Bu/Buses_Staff_Cost_Desktop/Dashboard1/1_rss.png",
"https://public.tableau.com/static/images/Bu/Buses_Fuel_Cost_Desktop/Dashboard1/1_rss.png",
"https://public.tableau.com/static/images/Bu/Buses_Interests_Desktop/Dashboard1/1_rss.png",
"https://images.firstpost.com/wp-content/uploads/2016/12/IndiaSpend-Logo114.jpg"
],
"article_body": "By Sravan Pallapothu Mumbai: Bengaluru is India’s third most-populous city, but its bus system is not only India’s largest with 6,448 buses (in 2015-16), it also lost the least money (Rs 101 crore) over six years to 2016 among eight metropolitan bus systems, according to an analysis of transit data. Buses tend to be the mass transit option of choice for a city’s poorest inhabitants. For instance, the cheapest bus ticket in Delhi is Rs 5 for non AC buses and Rs 10 for AC buses, according to the Delhi Transport Corporation (DTC) website, compared to Rs 10 for the cheapest metro ticket; in Bengaluru, the minimum fare on the metro is Rs 10, compared to Rs 5 for the bus (general service). Managed better than its metropolitan counterparts, the Bangalore Metropolitan Transport Corporation (BMTC) lost money in 2013-14 and 2014-15, the only Indian metropolitan bus-transit system to make profits over the six years we considered. Mumbai’s Brihanmumbai Electric Supply and Transport (BEST) with 4,094 buses and Delhi’s DTC with 4,564 buses, in 2015-16, made the largest net losses over six years to 2016: Rs 4,037 crore and Rs 14,950 crore, respectively. Cumulative losses of Mumbai’s BEST and Delhi’s DTC are enough to buy 34,521 low-floor buses of the kind the DTC uses (each bus costs Rs 55 lakh) or 30,138 Certia buses, a model operated by the BEST, Rs 63 lakh each (at 2007-08 prices). On average, between 2010 and 2016, the BMTC spent 35 percent of its budget on fuel, compared to 19 percent in Mumbai and 11 percent in Delhi, indicating that it was using its money on its core function–keeping buses running; of the eight metropolitan bus-transit systems, BMTC used its fleet best with 91 percent of the buses in use across the six years. A BMTC bus in Bengaluru. File image. Image courtesy: Wikimedia Commons. Chennai’s public bus system, the Metro Chennai Transport Corporation Limited, was next in spending the largest proportion of its budget (29 percent) on fuel, also indicating that it was better at keeping its buses on the road than the other six metropolitan systems. Chennai’s average fleet utilisation rate was 86 percent, behind Bengaluru (91 percent) and Chandigarh (89 percent). Chennai and Bengaluru also reported the best fuel efficiency (4.7 km/litre and 3.9 km/litre, respectively). This could perhaps explain why they are more profitable than others despite the cost of fuel, which tends to be higher in the south than the north. Bengaluru depends on buses With 8.4 million people living over 709 sq km, Bengaluru still depends overwhelmingly on its buses, although some pressure has been relieved by a seven-year-old 41-station, two line 42.3-km metro-rail system. In 2015-16, the metro carried 16.8 million people–about 46,000 people a day–whereas the BMTC carried 144 million–about 365,000 a day–almost eight times more, that year. Mumbai’s 12.4 million people–more than 20 million in the larger urban agglomeration, some of which are independent municipal corporations, such as Thane and Navi Mumbai–live across 4,355 sq km (Greater Mumbai, including Thane and Navi Mumbai) and depend primarily on a 135-station, 465-km suburban commuter-rail system, supplemented by a four-year-old 12-station, 11.4-km metro rail line; four more metro lines are under construction. The city’s suburban lines carry close to 8 million passengers every day, compared to the BEST, which carried 1.06 million, according to 2015-16 government data. The only working metro line carried 335,000 passengers every day in 2017-18. Delhi’s 11 million people–16.3 million in the National Capital Territory, which sprawls across 1,484 sq km–rely on a 16-year-old, 214-station, 296-km metro network with six fully operational and two partially operational lines. In 2015-16, the Delhi metro ferried around 2.6 million passengers whereas the DTC ferried around 3 million passengers per day Where do bus-transit systems spend their money? We found that the biggest contributors to bus-transit system’s costs were staff and fuel/lubricant-related expenditure–ranging, on average, from 27-61% and 13-27%, respectively, between 2010-16. Despite being the least profitable system, the DTC, on average, had the lowest percentage of staff costs as well as the lowest percentage of fuel/ lubricant costs, 27.78% and 10.32%, respectively BEST and the Calcutta State Transport Corporation (CSTC) had the highest proportion of staff costs–60% and 62% respectively–whereas, on average, BMTC and MCTC had the highest proportion of fuel costs– 35 percent and 28 percent–respectively. In 2015-16, BEST was the second-largest employer with 35,705 employees (after BMTC with 36,474); the CSTC stood at 7th with 4,998 employed. However, in 2015-16, BEST and DTC had higher staff costs–Rs 1,689 crore and Rs 1,475 crore, respectively–than BMTC (Rs 1,096 crore), even though BMTC employed 769 more people than BEST and 3,610 more than DTC. This could indicate that the DTC (established in 1948) and BEST (established in 1947) are facing legacy costs, as they are almost 70 years old; BMTC (established in 1997) is 20 years old, in its current avataar (its forerunner, the Bangalore Transport Service, started operations in 1962 after the nationalisation of the Bangalore Transport Corporation, which had been running buses since 1940). Mumbai’s overstaffed BEST decided in December 2017 to scrap 4,894 posts of conductors, bus drivers, mechanics and cleaners to cut staff costs and dispense with redundant posts. BEST employed 34,174 people in 2015-16, second only to BMTC that employed 35,554 people over the same year but with 2,354 more buses. DTC is the biggest borrower The DTC may save on fuel and staff–fuel saving, as we said, is not an indicator of efficiency–but it more than compensates through spending the largest proportion of its budget on interest payments, an indication that it borrows money to keep running. Over the six years to 2016, the DTC’s interest payments as a percentage of its expenditure ranged from 46% to 74%, compared to single digits for other bus-transit system. The DTC has been subsidised by the Delhi government for 20 years with its last-known cumulative debt at Rs 11,676 crore for the financial year 2014-15, according to a 2016 Comptroller Auditor General (CAG) report. DTC’s revenue the same year was Rs 1,113 crore, approximately 10% of its debt. “Despite getting bailout packages since 1996, DTC is unable to repay its debts,” Amit Bhatt, director of Integrated Urban Transport, at the World Resources Institute, a think-tank, told in October 2017. “An alternative source of finance needs to be found (for the DTC).” The need to increase fares and rationalise routes Buses are, as we said, the transit system of choice for the poorest commuters in Indian cities, but the losses they incur stem from a failure to raise fares. In Delhi, for instance, the fare is supposed to be revised twice a year in line with the consumer price index, but that is often delayed due to political pressures. DTC had the lowest fares among all metropolitan bus transit services, with tickets starting from Rs 5. The DTC last witnessed a fare hike in 2009, the cost of the cheapest ticket rising from Rs 3 for the first 4 km to Rs 5 for the first 3 km. This hike came at time when the cost of compressed natural gas (CNG) was Rs 19 per kg and outstanding debt was Rs 6,500 crore. The CNG price was Rs 42 per kg in May 2018. In other words, DTC ticket prices rose 166% from while fuel costs rose 221% in nine years. The Delhi metro, in comparison, witnessed two fare hikes in 2017 itself. In Mumbai, none of the BEST’s 18 new routes since 2013 make profits and accumulated Rs 52 crore in losses over five years to 2018, reported on June 15, 2018. Bus-transit systems also require periodic “route rationalisation”, the process of reassessing routes and stops. The DTC’s last route-rationalisation study was nine years ago in 2009. Since then, new roads and routes have been added, so the lack of reassessing routes pushes up costs and requires fare hikes. Many routes are not inherently profit-making, since they are supposed to serve underserved communities but as BMTC’s example shows, laying out a route that covers both profitable and unprofitable areas can make a difference. “Some (BMTC) routes even go as far as connecting peri urban areas and adjoining suburbs; something which BEST could not do,” Madhav Pai, India Director for the Ross Centre for Sustainable Cities, a think-tank told , because Thane and Navi Mumbai have their own bus services. How BMTC does better than the rest “BMTC is a more modern organisation and has fewer legacy costs to deal with, as opposed to BEST and DTC, which have been around for decades,” said Pai. BMTC has “superior marketing and supply chain strategies” than the other seven bus-transit systems in our analysis, said the Ross Centre’s Pai. For instance, its depots offer advertising and its top-end buses are brought in cheaper, bulk rates from Swedish bus-maker Volvo, which has a factory outside Bengaluru. “Furthermore BMTC has low staff costs because a lot of work is outsourced, which means that there is less scope for redundant labour,” said Pai. “Another area BMTC really stood out was depots; they are in accessible locations with more facilities, such as rest houses for drivers.” The DTC also wants more depot space to acquire more CNG buses but is unable to do so due to a lack of land adds Pai Delhi needs 460 acres of land to accommodate its 5,583 buses but no more than 257 acres are available, according to a May 2016 environment pollution control authority report.",
"description": "By Sravan Pallapothu Mumbai: Bengaluru is India’s third most-populous city, but its bus system is not only India’s largest with 6,448 buses (in 2015-16), it also lost the least money (Rs 101 crore) over six years to 2016 among eight metropolitan bus systems, according to an analysis of transit data. Buses tend to be the mass transit option of choice for a city’s poorest inhabitants. For instance, the cheapest bus ticket in Delhi is Rs 5 for non AC buses and Rs 10 for AC buses, according to the Delhi Transport Corporation (DTC) website, compared to Rs 10 for the cheapest metro ticket; in Bengaluru, the minimum fare on the metro is Rs 10, compared to Rs 5 for the bus (general service).",
"time_scraped": "2018-08-20 03:51:38.281571",
"article_id": "4988221",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/BMTC_-380.jpg",
"path": "full/00fb785c428fd61a297c5077d86596d5986b54eb.jpg",
"checksum": "564fb39d79ba5ca5e45ced2902824228"
},
{
"url": "https://public.tableau.com/static/images/Bu/Buses_Staff_Cost_Desktop/Dashboard1/1_rss.png",
"path": "full/e91334ada14c0a8ddf37f612babccd4b2b43a4ef.jpg",
"checksum": "14ddd3f4ad2326e7f14bd8ac54d378d4"
},
{
"url": "https://public.tableau.com/static/images/Bu/Buses_Fuel_Cost_Desktop/Dashboard1/1_rss.png",
"path": "full/58f4ab6f80aed4aac7a8c07c42a75f3aae24cb57.jpg",
"checksum": "1b46987f6093c084a794f8159a21d740"
},
{
"url": "https://public.tableau.com/static/images/Bu/Buses_Interests_Desktop/Dashboard1/1_rss.png",
"path": "full/28d19401f71aebece909a0cedb3522a2aed8303f.jpg",
"checksum": "5d7ae977c023f35deb0d7163b1e3c877"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2016/12/IndiaSpend-Logo114.jpg",
"path": "full/a5979996c5cdd66a84e4694b8552f0d4319fcc3b.jpg",
"checksum": "7c2f0191e23d1ea32f9e0b5e250e69c2"
}
]
}