{
"source_article_link": "https://www.firstpost.com/india/up-police-officials-barge-into-urdu-journalists-home-in-lucknow-call-him-terrorist-issue-apology-later-4988241.html",
"title": "UP Police officials barge into Urdu journalist's home in Lucknow, call him terrorist; issue apology later",
"date_published": "2018-08-18T13:40:52+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/sahid_khan_380.jpg"
],
"article_body": "Lucknow: In what appears to be the case of mistaken identity, the Lucknow police on the eve of India's 72nd Independence Day barged into the home of a senior Urdu journalist, Mohammad Sahid Khan, and called him and his entire family terrorists. The police later apologised to the journalist and his family verbally after having probed his documents and other details. This was after the intervention of other accredited scribes of Lucknow who took this matter to the senior administrative officials of the state. However, the police have not given a written apology. File image of Sahid Khan. Image courtesy: Saurabh Sharma/101Reporters The police told Khan and his family that they hadreceived a tip off about two suspects passing through their lane and hence, they acted on it. “I don't even have any FIRs or a police complaint against me in my career span of 26 years. And all of a sudden, the Lucknow police has dubbed me as a terrorist. My whole family is traumatisedbecause of this,” said Khan. Khan added that if he would not have been a journalist, the police would have held a press briefing the very next day declaring they arrested a terrorist in Lucknow. Khan, who works as an editor for Urdu language with the in Lucknow and , said the police barged into his home at around 1 pm on 14 August. “They came during the afternoon. There were many policemen in civil dress along with Cantonment station house officer, Ranjana Sachan, and a sub-inspector. They dubbed me as a terrorist in front of the entire locality,” said Sahid. The senior Urdu scribe claimed that the following allegations were leveled against him by Sachan: “ (You people are terrorists and this is where terrorists roam about. You even look like a terrorist. This morning, there were two terrorists who had come here).” “After listening to this, I tried to tell the police that I am an accredited journalist and there has been some misunderstanding but the police was not ready to listen to us and the SHO Ranjana Sachan said that I do not believe in government accredited press cards,” said Khan, adding that the police later called his nephew from his workplace. The police took a group photograph of his family members as they stood in front of the house just before leaving their home. The police also took photocopies of documents like Aadhaar card from the family. After this incident, Mohammad Sahid reached out to fellow journalists and explained the incident to them. Later, accredited journalists from Lucknow state headquarters raised this matter with senior authorities like Principal Secretary, Information, Awanish Awasthi, Home Secretary Bhagwaan Swaroop, and Additional Director General (Police) Praveen Kumar. Senior Urdu journalist Syed Husain Afsar demanded a high-level inquiry into this matter. \"This is very wrong policing. How can police dub anyone a 'terrorist' and that too, a journalist? Though the police have apologised for this, this is not done. An inquiry should be ordered against the policemen who entered his house on such a weak and misleading input,\" demanded Afsar. The Lucknow Senior Superintendent of Police (SSP) Kalanidhi Naithani later told mediapersons that the action taken by the police was the result of a misunderstanding. Siddharth Kalhans, a former colleague of Khan, called the series of events that unfolded \"very unfortunate\". “He is such an honest and punctual scribe that we used to give his example to our colleagues. This act of police is not acceptable by the journalist fraternity in Lucknow and across the state. We condemn this and demand strict action by the senior government officials,” Kalhans said. 101reporters.com",
"description": "Lucknow: In what appears to be the case of mistaken identity, the Lucknow police on the eve of India's 72nd Independence Day barged into the home of a senior Urdu journalist, Mohammad Sahid Khan, and called him and his entire family terrorists. The police later apologised to the journalist and his family verbally after having probed his documents and other details. This was after the intervention of other accredited scribes of Lucknow who took this matter to the senior administrative officials of the state. However, the police have not given a written apology. File image of Sahid Khan. Image courtesy: Saurabh Sharma/101Reporters The police told Khan and his family that they hadreceived a tip off about two suspects passing through their lane and hence, they acted on it.",
"time_scraped": "2018-08-19 01:02:28.390507",
"article_id": "4988241",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/sahid_khan_380.jpg",
"path": "full/45997287b3712029d908957fbd6793d4fcb73e54.jpg",
"checksum": "7993683f4d58626e3e43a6e514f0c369"
}
]
}