{
"source_article_link": "https://www.firstpost.com/india/pti-chairman-imran-khan-to-be-sworn-in-as-22nd-prime-minister-of-pakistan-today-mamnoon-hussain-to-administer-oath-4989451.html",
"title": "PTI chairman Imran Khan to be sworn-in as 22nd prime minister of Pakistan today; Mamnoon Hussain to administer oath",
"date_published": "2018-08-18T07:56:48+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/imran_khan_ap1.jpg"
],
"article_body": "Islamabad: Pakistan Tehreek-e-Insaf (PTI) chairman Imran Khan will sworn-in as the 22nd prime minister of the country at the President Housein Islamabad on Saturday. The oath-taking ceremony is scheduled to take place at 9.30 am (local time) and Pakistan president Mamnoon Hussain would administer the oath to Khan. Before the ceremony takes place, Pakistan’s national anthem will be played out, reported. Following the oath-taking ceremony, the signing of documents will take place. Khan, who led the Pakistan cricket team to their only World Cup victory in 1992, would assume the prime ministerial post after more than two decades, since joining politics in 1996. The members of the 1992 winning squad are slated to attend the swearing-in ceremony. File photo of PTI chief Imran Khan. AP From India, former cricketer and Congress leader Navjot Singh Sidhu, who arrived in Pakistan on Friday, will grace the ceremony. Other cricketers such as Kapil Dev and Sunil Gavaskar, who was also invited by Khan, earlier confirmed that they would not be participating in the event. While Dev cited ‘personal reasons’, Gavaskar also declined the invitation owing to his commentary commitments for the ongoing Test series between India and England, the report said. On Friday, Khan was elected as the new Prime Minister of Pakistan, defeating his rival Pakistan Muslim League-Nawaz (PML-N) candidate Shehbaz Sharif. While the 65-year-old cricketer-turned-politician bagged 176 seats, Sharif, the PML-N president and the brother of jailed former Pakistan prime minister Nawaz Sharif, managed to secure just 96 seats, reported. The newly-elected Speaker of the House, Asad Qaiser announced the results amid the chants of ‘na manzoor’ (unacceptable) and “Wazir-e-azam Nawaz Sharif” (former Pakistan prime minister Nawaz Sharif). The Pakistan People’s Party (PPP), which is the third largest party in the National Assembly (NA), the lower house of Pakistan’s Parliament, withdrew its support for the PML-N and abstained from voting in the House. In the 25 July general elections, the PTI had emerged as the single largest party with 116 seats. The number increased to 158 in the NA after the Election Commission of Pakistan (ECP) issued notifications of the successful candidates on the reserved seats for women and the minority community on 11 August. After being elected as the prime minister, Khan pledged to bring a change which according to him “the country was awaiting for last 70 years”. He assured to identify the people accountable for “looting the country”, as per the report. “Those who stole this nation’s money and stashed it abroad, I will bring them all to accountability. We will together debate and think on how to generate our own revenues so that we never have to be dependent on another country,” he said while thanking the youth of Pakistan for supporting him. Recounting his journey of 22 years from a cricketer to a politician, Khan asserted that no “military dictator nurtured” him and he has reached this height with his own “struggle and accord.”",
"description": "Islamabad: Pakistan Tehreek-e-Insaf (PTI) chairman Imran Khan will sworn-in as the 22nd prime minister of the country at the President Housein Islamabad on Saturday. The oath-taking ceremony is scheduled to take place at 9.30 am (local time) and Pakistan president Mamnoon Hussain would administer the oath to Khan. Before the ceremony takes place, Pakistan’s national anthem will be played out, reported. Following the oath-taking ceremony, the signing of documents will take place. Khan, who led the Pakistan cricket team to their only World Cup victory in 1992, would assume the prime ministerial post after more than two decades, since joining politics in 1996. The members of the 1992 winning squad are slated to attend the swearing-in ceremony. File photo of PTI chief Imran Khan. AP",
"time_scraped": "2018-08-20 03:51:32.813611",
"article_id": "4989451",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/imran_khan_ap1.jpg",
"path": "full/fa6223823cfb6a63de61ae936886ed7c6641e027.jpg",
"checksum": "ae8015d80801e8e4658b916e8b1a49e0"
}
]
}