{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-live-updates-kerala-floods-live-updates-imd-withdraws-red-alert-for-sunday-pinarayi-vijayan-says-58506-people-rescued-today-4989471.html",
"title": "Kerala floods updates: IMD withdraws red alert for Sunday; Pinarayi Vijayan says 58,506 people rescued today",
"date_published": "2018-08-18T21:25:18+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/kerla-flood1.jpg"
],
"article_body": "Kerala floods latest updates: The IMD has withdrawn the red alert in the state for Sunday, but an orange alert still stands for three districts. Chief MinisterPinarayi Vijayan said 58,506 people were rescuedon Saturday, but around a lakh were still stranded. The official toll in the last 10 days stands at 206. Padanad in Chengannur district in central Kerala has emerged as the epicentre of the calamity. Over 300 people have been rescued from the district so far, and more than 1,500 families are reported to be stranded here on rooftops. At least 100 families in Thiruvanmandoor. Edanad, Pandanad and Mangalam are stranded in the worst-affected areas of Chengannur. According to the IMD, the state received 619.5 mm rainfall this month till 16 August. This is usually 244.1 mm. \"The intensity of rainfall has decreased now. There won't be extremely heavy rains anymore but heavy rains will continue for two days,\" IMD scientist S Devi told ANI. Speaking to reporters, Vijayan said that Kerala was facing an \"unprecedented disaster\". \"The situation is grave in Kerala. We must stand together. The prime minister has understood the situation very well,\" he said, adding thatthis was the \"worst floods in Kerala in 100 years\". At least 324 people have died so far. People being rescued from a flood-affected region following heavy monsoon rainfall, in Kochi on Thursday. PTI Prime Minister Narendra Modi conducted an aerial survey to assess damage caused by flooding, and joined a review meeting to take stock of the situation. \"The nation stands firmly with Kerala in this hour,\" he said on Twitter. Kerala has so far incurred a loss of Rs 19,512 crore as damage to life and property, said Vijayan. Prime Minister Narendra Modi has offered Rs 500 crore as interim relief. Personnel of the three services, besides the National Disaster Response Force (NDRF) resumed the gigantic task of evacuating people stranded on rooftops, highlands where hills came crashing down blocking roads and cutting them off from the rest of the world, and those marooned in villages that have turned into islands. Many persons, including women, children and the elderly trapped in places inaccessible by boats were winched up by defence helicopters and shifted to safety. TV channels telecast disturbing visuals of a woman in labour being pulled up with the help of a rope dropped down from a navy chopper, swinging violently in the air. The woman, whose amniotic sac was ruptured, was shifted to a navy hospital where she gave birth to a baby boy.Both the mother and the child are doing fine, officials said. Desperate non-resident Keralites from Australia, the US and the UK were making fervent pleas to authorities through television channels seeking help for their dear ones. Soumya from Australia said her parents and their relatives were stranded in Aluva for the past two days. Another said an elderly relative Mary Varghese was badly in need of an oxygen cylinder and her condition was worsening. Although the rain let up in a few places on Saturday, four districts of Pathanamthitta, Alappuzha, Ernakulam and Thrissur remained in the throes of the monsoon fury. Officials said many private hospitals in Ernakulam district are running out of oxygen, forcing the authorities to shift patients to nearby facilities. Many had to be evacuated after flood water entered hospitals.People in relief shelters also complained about dearth of food and drinking water. Quite a few petrol pumps, even in places like the state capital Thiruvananthapuram, which has escaped the monsoon fury to some extent, have run dry.Long queues of motorists were seen at several fuel stations in Thiruvananthapuram district.Authorities have directed each of these fuel bunks to keep in reserve 3,000 litres of diesel and 1,000 litres of petrol at all times for relief operations. Local fishermen have also joined in the rescue mission with their boats and could be seen evacuating those marooned in places like Aluva, Kalady, Perumbavoor, Muvattupuzha and Chalakudy. Several roads in the hill district of Idukki, including in picturesque Munnar, have been badly damaged from a string of landslides.Wayanad, among the worst-hit by the floods, is cut off from the rest of Kerala. The Kochi airport is still shut with rain water flooding the runways.Several trains were either cancelled or rescheduled.Services on the Kochi Metro are, however, unaffected.",
"description": "Kerala floods latest updates: The IMD has withdrawn the red alert in the state for Sunday, but an orange alert still stands for three districts. Chief MinisterPinarayi Vijayan said 58,506 people were rescuedon Saturday, but around a lakh were still stranded. The official toll in the last 10 days stands at 206. Padanad in Chengannur district in central Kerala has emerged as the epicentre of the calamity. Over 300 people have been rescued from the district so far, and more than 1,500 families are reported to be stranded here on rooftops. At least 100 families in Thiruvanmandoor. Edanad, Pandanad and Mangalam are stranded in the worst-affected areas of Chengannur. According to the IMD, the state received 619.5 mm rainfall this month till 16 August. This is usually 244.1 mm. \"The intensity of rainfall has decreased now. There won't be extremely heavy rains anymore but heavy rains will continue for two days,\" IMD scientist S Devi told ANI. Speaking to reporters, Vijayan said that Kerala was facing an \"unprecedented disaster\". \"The situation is grave in Kerala. We must stand together. The prime minister has understood the situation very well,\" he said, adding thatthis was the \"worst floods in Kerala in 100 years\". At least 324 people have died so far.",
"time_scraped": "2018-08-19 01:02:46.650133",
"article_id": "4989471",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/kerla-flood1.jpg",
"path": "full/0ac3064a8f49e9a85afece9be504f8dc3afdfb28.jpg",
"checksum": "fd0a6a87930b8e182d61ea7f1316bacd"
}
]
}