{
"source_article_link": "https://www.firstpost.com/india/five-karnataka-districts-put-on-high-alert-as-heavy-rainfall-lashes-state-cm-kumaraswamy-to-review-relief-efforts-in-worst-hit-kodagu-today-4989831.html",
"title": "Five Karnataka districts put on high alert as heavy rainfall lashes state; CM Kumaraswamy to review relief efforts in worst-hit Kodagu today",
"date_published": "2018-08-18T10:54:29+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/HD-Kumaraswamy-oath_AP2.jpg"
],
"article_body": "Bengaluru: In the wake of heavy rainfall in the state, Karnataka chief minister HD Kumaraswamy will on Saturday visit Kodagu to review relief operations in the district. He will also chair a high-level meeting regarding the same at around 10.30 am on Saturday in Krishna, his home office before leaving for Kodagu district. He will pay a visit to rain-affected areas in Nanjangood and Kabini on 19 August. File photo of Karnataka chief minister HD Kumaraswamy. ANI Kumaraswamy also directed Kodagu district in-charge minister Sara Mahesh to get the supply of relief materials from Mysuru, said a press release from the Chief Minister's office. With heavy rains expected in many parts of the state, Kumaraswamy had earlier directed collectors of various districts to remain on their toes to combat any untoward situation. Out of 30 districts, as many as five districts namely, Kodagu, Dakshina Kannada, Hassan, Chikkamagaluru, and Shivamogga have been kept on high alert. The chief minister had also urged the concerned officials in the said districts to review the situation in their vicinities and update the authorities in case of emergency. Torrential rains, which lashed the state since 14 August, caused landslides and disrupted the normal life in the state.",
"description": "Bengaluru: In the wake of heavy rainfall in the state, Karnataka chief minister HD Kumaraswamy will on Saturday visit Kodagu to review relief operations in the district. He will also chair a high-level meeting regarding the same at around 10.30 am on Saturday in Krishna, his home office before leaving for Kodagu district. He will pay a visit to rain-affected areas in Nanjangood and Kabini on 19 August. File photo of Karnataka chief minister HD Kumaraswamy. ANI Kumaraswamy also directed Kodagu district in-charge minister Sara Mahesh to get the supply of relief materials from Mysuru, said a press release from the Chief Minister's office.",
"time_scraped": "2018-08-19 01:02:49.545156",
"article_id": "4989831",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/HD-Kumaraswamy-oath_AP2.jpg",
"path": "full/341ddbfcaa8bfca3cd400459743f552f99519bad.jpg",
"checksum": "a4ef8583e1cc13e7082e830c7183fac1"
}
]
}