{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-prime-minister-narendra-modi-begins-aerial-survey-to-gauge-damage-after-meeting-top-government-officials-4990531.html",
"title": "Kerala floods: Narendra Modi announces Rs 500 crore relief package after conducting aerial survey, says 'nation is with Kerala'",
"date_published": "2018-08-18T11:47:22+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [],
"article_body": "Prime Minister Narendra Modi announced a financial assistance of Rs 500 crore as a relief measure to rain-battered Kerala, after conducting an aerial survey of the massive loss and destruction triggered by the torrential rains in the state. The Rs 500 crore relief package is in addition to Rs 100 crore that was announced by the Home Minister on 12 August. Modi also announced ex gratia of Rs 2 lakh per person to the next kin of the deceased, and Rs 50,000 to those seriously injured from the Prime Minister’s National Relief Funds (PMNRF). The prime minister, who arrived in Kerala on Friday to take stock of the situation, also chaired a meeting with Governor P Sathasivam, Chief Minister Pinarayi Vijayan and other officials and witnessed a video presentation of the widespread destruction across the state. The Prime Minister's first attempt for aerial survey was cancelled due to rains prevailing at the Kochi Naval airbase. Prime Minister Narendra Modi has also announced Rs 500 crore as immediate aid for Kerala, in addition to the 100 crore announced earlier #Keralafloods https://t.co/lvqRnlcEuu — ANI (@ANI) August 18, 2018 Sources said that the prime minister has directed the National Highways Authority of India (NHAI) to repair main national highways damaged due to floods on priority. Modi also assured the state government that relief materials including foodgrains, medicines will be provided, as requested. Modi expressed his grief and sorrow over the unfortunate deaths and damage caused to lives and property due to floods. The prime minister also complimented the state government for the efforts made in meeting the challenges of the unprecedented situation. In a tweet, he also said: I salute the people of Kerala for their fighting spirit. I compliment the authorities for their efforts in this adverse situation. I would also like to appreciate the wide support and solidarity from people across India towards Kerala during this unprecedented situation. — Narendra Modi (@narendramodi) August 18, 2018 He observed that rescue of people who are still marooned remains the topmost priority. Villagers, whose kutcha houses have been destroyed in the floods, will be provided Pradhan Mantri Awas Yojana-Gramin houses on priority irrespective of their priority in the Permanent Wait List of PMAY-G, sources said. Modi, who arrived in the state capital on Friday night, flew to Kochi on Saturday morning. He will return to Delhi later today. Overflowing rivers and a series of landslides have resulted in the death of 324 people as of Saturday morning, with over 3 lakh others forced to move to some 2,000 relief camps.",
"description": "Prime Minister Narendra Modi announced a financial assistance of Rs 500 crore as a relief measure to rain-battered Kerala, after conducting an aerial survey of the massive loss and destruction triggered by the torrential rains in the state. The Rs 500 crore relief package is in addition to Rs 100 crore that was announced by the Home Minister on 12 August. Modi also announced ex gratia of Rs 2 lakh per person to the next kin of the deceased, and Rs 50,000 to those seriously injured from the Prime Minister’s National Relief Funds (PMNRF). The prime minister, who arrived in Kerala on Friday to take stock of the situation, also chaired a meeting with Governor P Sathasivam, Chief Minister Pinarayi Vijayan and other officials and witnessed a video presentation of the widespread destruction across the state. The Prime Minister's first attempt for aerial survey was cancelled due to rains prevailing at the Kochi Naval airbase.",
"time_scraped": "2018-08-19 01:02:28.950681",
"article_id": "4990531",
"article_category": "India",
"image_details": []
}