{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-real-test-begins-once-waters-recede-as-state-would-have-to-battle-ravaged-economy-threat-of-epidemics-4990081.html",
"title": "Kerala floods: Real test begins once waters recede as state would have to battle ravaged economy, threat of epidemics",
"date_published": "2018-08-18T23:37:35+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/kerala-flood-PTI1.jpg"
],
"article_body": "Editor's note multi-part series The damage caused to human lives, property and crops by the monsoons in Kerala this year has been of an unprecedented magnitude. The state government and the people at large, therefore, expect an unconventional response from the Central government to compensate the massive loss the state has suffered. Following Home Minister Rajnath Singh and a central team's visit to the flood-ravaged state, an interim relief of Rs 100 crore was promised as against Rs 1,220 crore demanded by the state. The loss at that time was pegged at Rs 8,316 crore. The first spell of resurgent monsoon killed 37 people, while 30,000 were displaced and the area of devastation covered only half of the state's 14 districts by 12 August, when Rajnath and his team took stock of the situation. Since then, however, the floods have ravaged almost the entire state, the toll rising to 174, and the number of displaced people being 3,15,000 today. Former chief secretary CR Ramachandran Nair said that Prime Minister Narendra Modi will realise the gravity of the situation and offer a package beyond the conventional yardsticks to help the state to tide over the situation following his visit on Friday. \"People across the country have understood the situation and are generously contributing to the Chief Minister's Relief Fund. The entire state is devastated. The state needs huge funds to help bring the affected people back to their normal lives and reconstruct the damaged infrastructure,\" Nair said. People being rescued from flood-affected regions in Kerala. PTI He said the resources that the tiny state can mobilise were very limited. The flood will also impact the tax revenue as it has affected all sectors of the economy, including tourism and plantation, the main drivers of the economy. Farmers and small traders who have suffered huge losses will not be able to pay any taxes unless they recover their losses first. \"The government may not be able to force them to pay taxes at the time of grave calamity like this. The finance ministry may not be able to impose fresh taxes at a time when the people need the government's support to come out of the unexpected tragedy,\" he added. Governments usually offer compensations based on the loss suffered by people in any calamity. In this situation, however, the damage caused by the floods aren't confined to material losses alone. Thousands of people marooned in the floods for days together without food, water and medicines are mentally shattered. Doctors feel that they may need huge psychological support to rebuild their lives. Apart from this, the nature and extent of damage that the flood will inflict on the physical health of people is also yet to be known. Health activists fear that the water that flooded the homes and surroundings of thousands of people may trigger a massive epidemic of water-borne and air-borne diseases. \"This may be another war-like situation that the government may have to face post-flooding. The state has already been witnessing a huge outbreak of epidemics during the monsoons for some time now. The present flood is both intensive and extensive, and nobody knows the sorts of health issues it may trigger,\" says Dr Arun Oommen. There has been a big mismatch between the funds that the state seeks to face a calamity and the assistance that the Centre finally sanctions. In the case of cyclone Ockhi that hit thousands of fisherfolk, Kerala had sought Rs 742 crore for providing relief to the victims and to reconstruct the ravaged coasts, but the Centre gave only Rs 194 crore. This has been the case with natural calamities in the past too. The former chief secretary said that the mismatch between the demand and actual sanction was because the states normally exaggerate losses while demanding assistance. The Centre knows this, and they, accordingly grant assistance according to their own estimate of losses and norms, Nair said. The Centre has been giving assistance to the states to face calamities according the norms it has established for 2015-2020. This provides for constitution of a separate State Disaster Response Fund (SDRF) for each state. This consists of central government contribution to the extent of 75 percent for general category states, and 90 percent for special category states, while the rest is paid by the state governments. A statement issued by the Union home ministry in response to Kerala government's demand for assistance said that the first charge of relief expenditure is on SDRF, and in cases of calamities of a severe nature, it is supplemented from the National Disaster Relief Fund (NDRF) as per established procedure. Financial assistance under SDRF/NDRF in the wake of natural calamities is by way of relief, and not for compensation of loss as suffered or claimed. Additional expenditures, if any, incurred over and above or on other than approved items/norms, is required to be met by the states from their own resources. A sum of Rs 320 crore was released by the Centre to the Kerala government as calamity relief fund for 2018-19. The allocation of the SDRF for 2018-19 was Rs 214 crore, of which the central government's share was Rs 160.50 crore and the state government's share was Rs 53.50 crore. The first installment of the Centre's share of the SDRF for 2018-19, released on July 20 this year was Rs 80.25 crore, while the corresponding state share was Rs 26.75 crore. The second instalment of the central share of SDRF for 2018-19, released on August 10, 2018 was Rs 80.25 crore and the corresponding state share was Rs 26.75 crore. Financial assistance under the SDRF/NDRF in the wake of natural calamities is by way of relief and not for compensation of loss as suffered/claimed, the ministry said, adding that additional expenditure, if any, incurred over and above or on other than approved items/norms, is required to be met by the states from their own resources. However, in the case of notified natural calamities, as per the established procedure, the state government is required to submit a detailed memorandum, indicating the sector-wise details of damage and requirement of funds for relief operations of immediate nature. On receipt of a memorandum, an inter-ministerial central team (IMCT) is deputed for an on-the-spot assessment of damages and additional requirement of funds. The IMCT report is considered by the sub-committee of National Executive Committee (SC-NEC) headed by the Union home secretary and then by a high-level committee (HLC) chaired by the Union home minister for approving the quantum of additional assistance from the NDRF. The ministry statement said that in the instant case, based on a preliminary memorandum submitted by the Kerala government for additional assistance of Rs 831.10 crore the IMCT was constituted immediately on 25 July. The IMCT have visited flood/landslides affected areas in the state from 7-12 August this year. Upon receipt of report from the IMCT, it will be processed for placing before the SC-NEC and HLC for consideration, as per the established procedure. Though enough funds were available in the SDRF, the Union home minister has announced release of Rs 100 crore in advance from the NDRF to help the state in providing relief measures to the affected people, the ministry claimed. \"In the instant case, the central government has been providing full support to the Kerala government by mobilising and providing timely logistics and financial resources to supplement the efforts of the state government to deal with the situation effectively in the wake of floods/landslides,\" the statement added. Both the government and the Opposition parties feel that the assistance available from the Centre under the established norms will not be sufficient to overcome the tragedy and its grave aftermath. Nair said the floods that the state is currently facing is the worst of this century, and the Centre will rise to the occasion and help the state to face it. Follow Kerala floods LIVE updates here",
"description": "Editor's note multi-part series The damage caused to human lives, property and crops by the monsoons in Kerala this year has been of an unprecedented magnitude. The state government and the people at large, therefore, expect an unconventional response from the Central government to compensate the massive loss the state has suffered. Following Home Minister Rajnath Singh and a central team's visit to the flood-ravaged state, an interim relief of Rs 100 crore was promised as against Rs 1,220 crore demanded by the state. The loss at that time was pegged at Rs 8,316 crore. The first spell of resurgent monsoon killed 37 people, while 30,000 were displaced and the area of devastation covered only half of the state's 14 districts by 12 August, when Rajnath and his team took stock of the situation. Since then, however, the floods have ravaged almost the entire state, the toll rising to 174, and the number of displaced people being 3,15,000 today.",
"time_scraped": "2018-08-19 01:02:29.444332",
"article_id": "4990081",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/kerala-flood-PTI1.jpg",
"path": "full/ff7dcaa17a465b2233df4f27906c311524fa2f2e.jpg",
"checksum": "443d544ea10c936aa35efd07df0b0d8d"
}
]
}