{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-dgca-asks-airlines-to-run-additional-flights-after-kochi-airport-closure-advises-them-to-cap-fares-4991051.html",
"title": "Kerala floods: DGCA asks airlines to run additional flights after Kochi airport closure, advises them to cap fares",
"date_published": "2018-08-18T17:04:21+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2014/03/Plane_DGCA_AFP.gif"
],
"article_body": "Thiruvananthapuram: To avoid any inconvenience in travelling, Directorate General of Civil Aviation (DGCA) has asked scheduled domestic airlines to mount additional flights to Kerala after the closure of the Kochi airport. Representational image. AFP \"Out of 71 arrivals and 74 departures of scheduled domestic airlines to or from Cochin, 23 arrival and 24 departures have been rescheduled and additional 19 arrival and departures have been mounted to or from Trivandrum, Calicut and Coimbatore airports. Nine foreign carriers operating to Cochin have also rescheduled their flights to or from Trivandrum,\" read a statement from Ministry of Civil Aviation (MoCA). Scheduled domestic airlines have also been advised to ensure that airfares for flights to or from Trivandrum and Calicut airports in Kerala and nearby airports — Mangalore and Coimbatore — are kept at an optimal level proportionate to sector distance. Accordingly, airlines have been requested to cap the maximum fare around Rs 10,000 on longer routes and around Rs 8000 on shorter routes to or from Kerala and nearby airports. In addition to that, DGCA is also constantly monitoring airfares on 32 direct routes operating to or from Trivandrum, Calicut, Coimbatore and Mangalore. Spike in airfare on a few routes has been observed. Concerned airlines have been advised to cap the airfare on these flights. DGCA had also convened a meeting with the higher management of domestic airlines on Friday in this regard. As per the statement, Control Room set up by DGCA is working 24x7. Passenger-related issues pertaining to the refund of air ticket, rescheduling of flight, alternate options available to them are being addressed. Kerala has been witnessing incessant rainfall over the last few days, causing unprecedented flooding and landslides in several parts of the state. So far, 324 people have lost their lives due to flood, Chief Minister Officer (CMO) of Kerala said.",
"description": "Thiruvananthapuram: To avoid any inconvenience in travelling, Directorate General of Civil Aviation (DGCA) has asked scheduled domestic airlines to mount additional flights to Kerala after the closure of the Kochi airport. Representational image. AFP \"Out of 71 arrivals and 74 departures of scheduled domestic airlines to or from Cochin, 23 arrival and 24 departures have been rescheduled and additional 19 arrival and departures have been mounted to or from Trivandrum, Calicut and Coimbatore airports. Nine foreign carriers operating to Cochin have also rescheduled their flights to or from Trivandrum,\" read a statement from Ministry of Civil Aviation (MoCA). Scheduled domestic airlines have also been advised to ensure that airfares for flights to or from Trivandrum and Calicut airports in Kerala and nearby airports — Mangalore and Coimbatore — are kept at an optimal level proportionate to sector distance. Accordingly, airlines have been requested to cap the maximum fare around Rs 10,000 on longer routes and around Rs 8000 on shorter routes to or from Kerala and nearby airports.",
"time_scraped": "2018-08-19 01:02:50.401962",
"article_id": "4991051",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2014/03/Plane_DGCA_AFP.gif",
"path": "full/353c697927ec7036d03969c6f00cd45b31416fc7.jpg",
"checksum": "305533bdb121b6845e49ca1726a608a2"
}
]
}