{
"source_article_link": "https://www.firstpost.com/india/karnataka-rains-rescue-operations-in-flood-hit-kodagu-to-be-completed-by-evening-chief-minister-to-review-state-of-district-4991401.html",
"title": "Karnataka rains: Rescue operations in flood-hit Kodagu to be completed by evening; chief minister to review state of district",
"date_published": "2018-08-18T16:13:50+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/05/karnataka-floods-PTI.jpg"
],
"article_body": "Kodagu (Karnataka): Rescue operations in the rain-battered Kodagu district will be over by evening, informed district in-charge minister Sa Ra Mahesh on Saturday. He also informed that Karnataka Chief Minister HD Kumaraswamy will visit Kodagu on Saturday to review the flood situation in the district. \"Rescue operations will be over by evening. Chief Minister will visit Kodagu today to review flood situation. Relief camps have been set up for people. Food, water, doctors and all facilities have been made available to them in relief camps,\" Mahesh told Representational image. PTI Kumaraswamy will also chair a high-level meeting regarding the same in Krishna (his home office) before leaving for Kodagu district. He will pay a visit to rain-affected areas in Nanjangood and Kabini on 19 August. Kumaraswamy also directed Mahesh to get the supply of relief materials from Mysuru, said a press release from the Chief Minister's office. With heavy rains expected in many parts of the state, Kumaraswamy had earlier directed collectors of various districts to remain on their toes to combat any untoward situation. Out of 30 districts, as many as five districts namely, Kodagu, Dakshina Kannada, Hassan, Chikkamagaluru, and Shivamogga were kept on high alert. The Chief Minister had also urged the concerned officials in the said districts to review the situation in their vicinity and update the authorities in case of emergency. Torrential rains, which lashed the state since 14 August, caused landslides and disrupted the normal life in the state.",
"description": "Kodagu (Karnataka): Rescue operations in the rain-battered Kodagu district will be over by evening, informed district in-charge minister Sa Ra Mahesh on Saturday. He also informed that Karnataka Chief Minister HD Kumaraswamy will visit Kodagu on Saturday to review the flood situation in the district. \"Rescue operations will be over by evening. Chief Minister will visit Kodagu today to review flood situation. Relief camps have been set up for people. Food, water, doctors and all facilities have been made available to them in relief camps,\" Mahesh told Representational image. PTI",
"time_scraped": "2018-08-19 01:02:46.611833",
"article_id": "4991401",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/05/karnataka-floods-PTI.jpg",
"path": "full/f9b399c426f2f3b75d626faea503f7411e2cceff.jpg",
"checksum": "a824b3418d76a85ef329ac2ee2f10d0f"
}
]
}