{
"source_article_link": "https://www.firstpost.com/india/man-dies-after-mob-thrashes-him-in-jharkhands-dumka-district-on-suspicion-of-murdering-7-year-old-girl-4991631.html",
"title": "Man dies after mob thrashes him in Jharkhand's Dumka district on suspicion of murdering 7-year-old girl",
"date_published": "2018-08-18T16:39:32+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/jharkhand-police-reuters-380.jpg"
],
"article_body": "An unidentified man died in Jharkhand's Dumka district on Thursday, a day aftera mob brutally thrashed himover suspicion of murdering aseven-year-old girl.Relatives of the girl beat him up at the Barapalasi Railway Station after they found her body. He succumbed to his injuries at Patliputra Medical College and Hospital inDhanbad, the police said. Representational image. Reuters The girl went missing on Wednesday, after which her family and others began to look for her at the Barapalasi station. according to The Indian Express . They found her body at the women's toilet on the platform around 6 pm, The Telegraph reported. The villagers then thrashed the man, believed to be differently-abled, over suspicion of murdering the child. The man, in his mid 40s, had reportedly been living at the station for a while. After being informed about the mob violence, police from the Jama Police Station went to the spot and admitted the man to the hospital.Station House Officer Sanjay Kumar Malviya was quoted as saying by : \"He begged for a living and wasn't mentally stable. We have yet to establish his identity and whether he had anything to do with the dead child.\" Malviya added that an autopsy had establishedstrangulation as the cause of death of the child and had also ruled out sexual assault. The police have registered two FIRs over the incident — one against the unidentified man on thebasis of thecomplaint filed by the girl's grandmother, and the second against the unidentified villagers who thrashed the man. No arrests have been made so far. Three policemen were also injured in an altercation with the enraged relatives of the girl after they found her body on Wednesday, said Superintendent of Police Kaushal Kishore. They received treatment at a hospital.",
"description": "An unidentified man died in Jharkhand's Dumka district on Thursday, a day aftera mob brutally thrashed himover suspicion of murdering aseven-year-old girl.Relatives of the girl beat him up at the Barapalasi Railway Station after they found her body. He succumbed to his injuries at Patliputra Medical College and Hospital inDhanbad, the police said. Representational image. Reuters The girl went missing on Wednesday, after which her family and others began to look for her at the Barapalasi station. according to The Indian Express . They found her body at the women's toilet on the platform around 6 pm,",
"time_scraped": "2018-08-19 01:02:50.447429",
"article_id": "4991631",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/jharkhand-police-reuters-380.jpg",
"path": "full/86e26d0502375e0e0b10d80c82530eab5784fac0.jpg",
"checksum": "8927b1d727ee0b25a9a4d565a5b3a2c9"
}
]
}