{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-warnings-issued-for-all-14-districts-rescue-ops-continue-on-war-footing-to-battle-worst-deluge-in-a-century-4991381.html",
"title": "Kerala floods: As toll since 29 May climbs to 357, IMD says rainfall intensity in state will reduce from 20 August",
"date_published": "2018-08-18T16:45:57+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/kerala-flood-TKDevasia1.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Manjul.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Rescue-Ops_Navy-PRO.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Floods-Relief_VS-Prashant.jpg"
],
"article_body": "Kerala is facing the deadliest deluge in close to a century, withover 350 lives lost and over 3.5 lakh peopleaffectedsince the monsoons began. Chief Minister Pinarayi Vijayan told the media on Friday that the situation arising out of unprecedented floods and the subsequent havoc caused by turgid rivers and gushing waters in Kerala continues to be \"grave\". The Indian Armed Forces, with directions from Defence Minister Nirmala Sitharaman, swung into action on 9 August, a day after the heavy rainfall started. The Centre and the state government are working in tandem with armed forces across Kerala to rescue the thousands stranded in their homes. Toll now at 357 Vijayan told Prime Minister Narendra Modi at a review meeting in Kochi that the death toll since 29 May has climbed to 357. Over 3.53 lakh affected persons have been lodged in over 2,000 relief camps, he said. The 22 deaths reported during the day were in Ernakulam, Thrissur, Idukki, Pathanamthitta and Alappuzha districts. Food Minister P Thilothaman, camping at Chengannur, told the media: \"The need of the hour is to provide food packets and drinking water to the people. About 15 small boats of the navy are expected to join rescue and relief work. But, after dusk, no rescues are possible. Helicopters are also needed for faster evacuation.\" IMD withdraws red alert for Sunday, rainfall intensity to reduce from 20 August News reports said that the India Meteorological Department (IMD) has withdrawn red alert for the state for Sunday. further said that only three districts (Pathanamthitta, Idukki and Ernakulam) were warned of an orange alert. IMD also said that the rainfall intensity in the state will reduce in the next two to three days. Kerala is not expected to receive heavy rainfall from 20 August, Mritunjay Mohapatra, IMD Additional Director General, said. \"Day before yesterday, there was heavy rainfall in almost all districts of Kerala. Yesterday, there was heavy rainfall in 3-4 districts. Today, we were expecting heavy rainfall in isolated places, but not very heavy rainfall.\" \"Tomorrow, we are expecting heavy rainfall in only 1-2 districts and remaining places of the state will only witness moderate rainfall. From 20 August, we are not expecting any heavy rainfall. Gradually, the rainfall intensity is decreasing,\" Mohapatra said. Unprecedented rain in Kerala According to the IndianMeteorologicaldepartment(IMD), Kerala received 2,227.26 milimetres of rain between 1 June and 16 August, 37.4 percent more than the season's average. Idukki district is one of the districts to receive maximum rainfall in the state, at 3,211.06 milimetres(83.59 percent in excess), reported . Six other districts — Ernakulam, Palakkad, Thiruvananthapuram, Kollam, Kottayam and Malappuram — all recorded excess rainfall of over 40 percent than usual. The heavy and persistent rains, combined with the opening of several dams like Idukki, into rivers like the Periyar and Chalakudy, have contributed to the flood situation in the state. Reports said adequate warnings were given by the district administrations to those living along river banks and low lying areas. Floods have ravaged Kerala, as 14 districts continue to be on red alert. Firstpost/TK Devasia Modi meets Pinarayi Vijayan Modi announced a financial assistance of Rs 500 crore as a relief measure on Saturday, after conducting an aerial survey of the massive loss and destruction in the state. The Rs 500 crore relief package is in addition to the Rs 100 crore package that was announced by the home minister on 12 August. Modi, who arrived in Kerala on Friday to take stock of the situation, also chaired a meeting with Governor P Sathasivam, Chief Minister Pinarayi Vijayan and other officials. They also witnessed a video presentation of the widespread destruction. Sources said that the prime minister has directed the National Highways Authority of India (NHAI) to repair main national highways damaged due to floods on priority. Modi also assured the state government that relief material, including foodgrains and medicines will be provided as requested. Modi expressed his grief and sorrow over the unfortunate deaths and damage caused to life and property. The prime minister also complimented the state government for efforts made in meeting the challenges of the unprecedented situation. IMD issues warnings in 14 districts IMD issued 'red alert' warnings for Ernakulam and Idukki districts on Friday. While Ernakulam is to expected to receive heavy rainfall, Idukki is said to receive heavy to very heavy rainfall. Fishermen have been advised against venturing out into the sea in northern Kerala, as also Karnataka and Lakshwadeep. Prior to this, nine out of the state's 14 districts were already under a 'red alert'. Armed forces and NDRF personnel conduct combined rescue operations in Wayanad on Friday. Courtesy: Navy PRO quoted Dr S Devi of the IMD saying that \"regular rainfall\" for the month of August is 244.1 milimetres, whereas the rainfall this year was 619.5 milimetres. \"The intensity of rainfall has decreased now, and there won't be extremely heavy rains anymore, but heavy rains will continue for two more days,\" she said. Public transport affected Railway services between Ernakulam and Thrissur continued to be suspended on Saturday, while long distance trains were diverted via the Nagercoil route. Traffic was stopped on parts of the Thrissur-Palakkad highway. Operations carried out by the armed forces resulted in partial clearing of Munnar-bound roads. NDRF and armed forces in action 'Operation Madad' and 'Operation Sahyog' were launched to facilitate rescue and relief efforts in Kerala. According to multiple statements released by the defence ministry, the Indian Navy and the Indian Army jointly saved 6,600 people since they launched Operation Madad (navy) and Operation Sahyog (army) over a week ago. The National Disaster Relief Force (NDRF) also mobilised sources to help with the rescue. Update: Rescue operations are progressing well even in an inclement weather. A total of 82,442 rescues were made today. 3,14,391 people from 70,085 families are safe in 2094 camps across the State. #KeralaFloods pic.twitter.com/puHkqQ94UQ — CMO Kerala (@CMOKerala) August 17, 2018 However, rescue operations did fall short in some areas, as people who are stranded were struggling for ways to reach out for relief materials and rescue. On Friday, rescue operations in Chalakudy, Thrissur continued for the second day, reported . Around 1,500 people were stuck in the area for three days, and only 100 people had been rescued. A dearth of medical supplies has been an issue throughout the state, with stranded residents unable to access medicines for physical ailments or mental health issues. A relief material collection centr operated by Thiruvananthapuram Corporation. Courtesy: VS Prashant InThiruvalla in Pathanamthitta district, a rescue boat went missing on Saturday morning. The rescue boat was from the Karthikappalli tehsildar. Sources said that around eight fishermen and two firefighters were in the boat. Constant rains worsen rescue operations Rescue operations began in Alappuzha's Chengannur town early onSaturday morning, but constant heavy rain and rapid water due to heavy turbulence slowed rescue efforts. Sources said that more than 1,500 families were stranded on rooftops in the area. Thiruvanmandoor, Edanad, Pandanad and Mangalam areas of Chengannur were the worst affected, and attempts were being made to reach those stranded in order to ensure they have access to food, water, and medicines. According to sources,Saturday was the fourth day that people in Chengannur went without sufficient food and water. However, the Indian Railways extended a helping hand to Kerala on Friday by supplying bottled water to flood-affected people. Around 2,740 cartons were dispatched from Parassala's Rail Neer plant earlier on Friday, while six trucks loaded with drinking water were already pressed into service. In a similar move, the Southern Railways has dispatched seven BRN Wagons, carrying 2.8 lakh litres of water, from Erode junction on Friday afternoon. Indian Air Force Commodore PK Sreekumar, who is engaged in rescue operations in Mannar, Alappuzha onSaturday told that there is a lack of understanding about ground realities in places that need urgent attention. \"It has resulted in chaos instead of coordination. No government agency is seen in Pandanad region where hundreds are stranded. We need more boats. Not a single boat has come from the administrative side,\" he said. Sources said that boats used for rescue operations inPathanamthitta in the Travancore were facing difficulties in negotiating areas with a strong flow of water. Several boats had dashed against walls and been damaged. In Pandanad town, boats were not able to reach a school which many people had used as a shelter. People in the area had not been able to contact government authorities, sources told An emergency helpline number (9946992995) has been set up by the Ernakulam government general hospital. Sources said that around 300 doctors have been deployed to provide medical assistance in the district. Additional units of the NDRF and Engineering Task Force (ETF) wing of the Indian Army were airlifted from Pune on Saturday. Sources said that they were airlifted into two AN 32 aircarfts and one IL-76 aircraft, which is one of the biggest in the Indian Air Force. They have been deployed toPathanamthitta and Alappuzha and morewere to be airlifted from Jodhpur, Bhopal and Pune. Follow LIVE updates on the Kerala floods",
"description": "Kerala is facing the deadliest deluge in close to a century, withover 350 lives lost and over 3.5 lakh peopleaffectedsince the monsoons began. Chief Minister Pinarayi Vijayan told the media on Friday that the situation arising out of unprecedented floods and the subsequent havoc caused by turgid rivers and gushing waters in Kerala continues to be \"grave\". The Indian Armed Forces, with directions from Defence Minister Nirmala Sitharaman, swung into action on 9 August, a day after the heavy rainfall started. The Centre and the state government are working in tandem with armed forces across Kerala to rescue the thousands stranded in their homes. Toll now at 357 Vijayan told Prime Minister Narendra Modi at a review meeting in Kochi that the death toll since 29 May has climbed to 357. Over 3.53 lakh affected persons have been lodged in over 2,000 relief camps, he said. The 22 deaths reported during the day were in Ernakulam, Thrissur, Idukki, Pathanamthitta and Alappuzha districts.",
"time_scraped": "2018-08-19 01:02:37.209523",
"article_id": "4991381",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/kerala-flood-TKDevasia1.jpg",
"path": "full/8b5415162a3f38c503fc633eee299aa93457a421.jpg",
"checksum": "7218c54c65f5677238d1312c88cf1da8"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Manjul.jpg",
"path": "full/8fd9ffbb7ae6d150ada9f7b8dd74a04abe9986fe.jpg",
"checksum": "24408e86baffb0f60f69f48e347a7448"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Rescue-Ops_Navy-PRO.jpg",
"path": "full/783ded820579dc8c242fcd6edd6580a61c660ce6.jpg",
"checksum": "d515eebf3d948174e596e5c2c03289d7"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Floods-Relief_VS-Prashant.jpg",
"path": "full/43d92fa76d37b6f6b66152d174f2c1ee600124ab.jpg",
"checksum": "4419e1078ec04783d55bca9d8e8276b4"
}
]
}