{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayee-passes-away-border-residents-in-jammu-and-kashmir-mourn-death-of-ex-pm-who-oversaw-2003-ceasefire-4991961.html",
"title": "Atal Bihari Vajpayee passes away: Border residents in Jammu and Kashmir mourn death of ex-PM who oversaw 2003 ceasefire",
"date_published": "2018-08-18T17:18:56+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/border-resident-2.jpg"
],
"article_body": "Lal Din Ahmad, the sarpanch of Churunda village near the Line of Control in Uri, remembers the day when a shell fired from across the border tore through the rooftop of his home. The explosion had destroyed the first floor. “It was after a gap of nearly ten years — on 5 January, 2013 — that shells started landing in our village,\" 62-year-old Ahmad said on Friday morning. He added, \"In the last 67 years, our family has seen peace for just ten years.\" Ahmad said that when he heard the news of Atal Bihari Vajpayee’s death , he felt sad. He said, “I have never felt bad due to the death of a politician, but his death saddened me.\" Ahmad’s sadness has a reason. Ajit Singh, a resident of Bera village near the border, stands outside his house in Jammu. Image procured by Sameer Yasir This year alone, there have been over 1,000 incidents of ceasefire violations till now. Last year, there were 970 incidents of such violations. In this context, residents say a semblance of peace and stability had come into their lives due to the 'visionary' policies of Vajpayee. The former prime minister had overseen the implementation of the ceasefire between India and Pakistan, which became effective from 26 November, 2013. It had changed the lives of millions of people living along the LoC and the International Border in Jammu and Kashmir. The landmark ceasefire agreement was an outcome of a fresh dialogue process between India and Pakistan. Before this, talks between the two countries had suffered several setbacks. The seeds of the ceasefire were sown in July 2000, when Hizbul Mujahideen’s commander Abdul Majid Dar announced a cessation of hostilities in the hinterland for three months. Track II diplomats had helped New Delhi to ferry Dar to Srinagar from a west Asian country where he had flown from Pakistan, kickstarting the historic India-Pakistan dialogue process. The peace that set in following the ceasefire led to lakhs of people returning to their villages along the LoC and the International Border. “That ceasefire allowed us to return home after years. Earlier, residents had fled their villages and moved towards the plains,\"said Mukhtar Ahmad Khan, a resident of Gowhalan village in Uri district. India and Pakistan also started fencing along the LoC at many locations to stop infiltration. New Delhi fenced close to 600 kilometers along the border between 2003 and 2004 to prevent infiltration of militants. Amir Din Khatana, also a resident of Gowhalan, said, “Before the ceasefire, living at home had only been something we dreamed about. Camps had become our permanent addresses. Vajpayee ’s talks with Pakistan changed our lives.” “We cherish those years of peace, when we would go to our farms without worrying that a shell might land right in front of us and kill us. Those were the best years for us,” Jeevan Ram, the sarpanch of Samba district's Charlyare village, said on Friday. However, in more recent times, hostilities have again grown, and have heightened concerns of people living in border areas. “In recent years, there has been intense cross-border firing, almost on a daily basis. For five months this year, we stayed in a school. This has made us realise the worth of peace. If Vajpayee had been the prime minister, our lives would have changed for good,\"Vijay Singh, a resident of Bera village along the border in Jammu said.",
"description": "Lal Din Ahmad, the sarpanch of Churunda village near the Line of Control in Uri, remembers the day when a shell fired from across the border tore through the rooftop of his home. The explosion had destroyed the first floor. “It was after a gap of nearly ten years — on 5 January, 2013 — that shells started landing in our village,\" 62-year-old Ahmad said on Friday morning. He added, \"In the last 67 years, our family has seen peace for just ten years.\" Ahmad said that when he heard the news of Atal Bihari Vajpayee’s death , he felt sad. He said, “I have never felt bad due to the death of a politician, but his death saddened me.\"",
"time_scraped": "2018-08-19 01:02:50.424944",
"article_id": "4991961",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/border-resident-2.jpg",
"path": "full/c815128cacfc6e5d7733b77e9a2ccf2d6cdeeed5.jpg",
"checksum": "3d55aacb541fd461d98bd3528ec19f3b"
}
]
}