{
"source_article_link": "https://www.firstpost.com/india/kerala-rains-sbi-donates-rs-2-crore-for-flood-relief-waives-fees-for-new-atm-cards-passbooks-4991171.html",
"title": "Kerala rains: SBI donates Rs 2 crore for flood relief, waives fees for new ATM cards, passbooks",
"date_published": "2018-08-18T16:01:40+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-floods_PTI_3802.jpg"
],
"article_body": "Mumbai: The State Bank of India (SBI) has donated Rs 2 crore for the Kerala flood victims and initiated several other ground-level measures in the deluged state, an official said on Saturday. The SBI has encouraged all its 270,000 staffers to contribute to the Chief Minister's Distress Relief Fund (CMDRF), and the bank would contribute an equivalent amount. Representational image. PTI It also announced a waiver of fees and charges on services like loans for flood relief, duplicate passbooks, ATM cards, cheque books and EMI delays, besides making attempts to restore the working of branches and ATMs in the flood affected regions of the state. Besides, the SBI has decided to waive all charges on remittance to the CMDRF, penalty on non-maintenance of minimum account balance from proceeds of relief fund provided by the government and agencies and if already recovered, such charges would be refunded for customers in the state. The bank has extended Xpress Credit to existing customers with relaxed norms for a month, deployed cash at PoS (Point of Sale) to enable people avail Rs 2,000 to meet daily cash requirements across the state. Persons who have lost or displaced personal documents can open small accounts with only photos and signature or thumb impressions and all employees of SBI deployed to address requirements of the customers and ensure best possible service. At least 180 persons have lost their lives, thousands displaced or stranded as incessant rains pounded Kerala since the past 10 days, causing havoc in 12 districts.",
"description": "Mumbai: The State Bank of India (SBI) has donated Rs 2 crore for the Kerala flood victims and initiated several other ground-level measures in the deluged state, an official said on Saturday. The SBI has encouraged all its 270,000 staffers to contribute to the Chief Minister's Distress Relief Fund (CMDRF), and the bank would contribute an equivalent amount. Representational image. PTI It also announced a waiver of fees and charges on services like loans for flood relief, duplicate passbooks, ATM cards, cheque books and EMI delays, besides making attempts to restore the working of branches and ATMs in the flood affected regions of the state.",
"time_scraped": "2018-08-19 01:02:37.267608",
"article_id": "4991171",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-floods_PTI_3802.jpg",
"path": "full/f772610d2f888f3d2ad1c72b37fa3a4e0d9660d0.jpg",
"checksum": "3c4de565c269411c0c48b4ff96eb7d55"
}
]
}