{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-with-thousands-stranded-on-rooftops-and-rescue-efforts-lacking-humanitarian-crisis-looms-large-in-chengannur-4992991.html",
"title": "Kerala floods: With thousands stranded and rescue efforts lacking, humanitarian crisis looms large in Chengannur",
"date_published": "2018-08-18T19:08:39+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Rains_PTI.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/SOS.png"
],
"article_body": "multi-part series *** Pandanad in Kerala's Chengannur town could turn into the epicenter of the worst calamity to hit the state since it was formed. For the fourth day in a row, thousands of families in this central Kerala village are stranded on rooftops without food, water, medicine and electricity Local fishermen on boats are battling rough waters to save as much as they can, but with the Pampa river still in spate, flowing with rapid ferocity, most of the areas in Pandanad village are still inaccessible for rescue workers. On Friday night, there was an SOS cry from one of the most unlikely sources — Saji Cherian, theruling party's MLA from Chengannur, broke down on prime time news on a regional channel, expressing his fear that thousands might lose their lives if helicopters do not airlift them to safety. \"Thousands are stranded in Pandanad even now without help,\" he said. \"It has been three nights. They have no food or water. If they are not airlifted urgently, we could have huge casualties in this area. It would be an unthinkable human tragedy.\" An aeriel view of the floods in Aluva after heavy rains, in Kerala. PTI Cherian's words should have sent a shiver down the spine of the relief and rescue apparatus that has been working tirelessly over the past week to salvage thousands from the raving floodwaters in Kerala. However, when this reportertried to reach ground zero on Saturday morning, there was hardly any change in the situation. Neither is the district administration equipped to deal with the situation, nor has it coordinated with the air force or navy, which is in operation in other areas. The district administration seems to have forgotten Padanad altogether and is now paying the price. Four deaths were confirmed in the region, and nearly 7,000 people were stranded when the reports last came in. Thomas Chacko, 65, and his family were perhaps the very few who made it out of Pandanad before it was too late. Now at a relative's house on higher ground, Chacko said he and his family of five could escape because his brother-in-law, who stays out of the village, had reached them in time with a country boat. \"We were lucky to come out of it,\" he said. \"The water level was rising by the minute, and by the time we got out, it had reached the second floor of our house. We have no idea what happened to our neighbours.\" Other regions adversely affected are Thiruvanmandoor, Edanad, Mangalam, Manaar, Budhanoor, Aala, Venmony, Cheriyanad and Mulakuzha. Joseph C Mathew, who was an adviser to former chief minister VS Achuthananthan and hails from Chengannur, said his aged parents are still trapped on a neighbour's rooftop in Puthencavu. \"The problem in Chengannur is not about the rising water level. It is about the thousands stranded for four days in a row with no food, water, medicines or electricity. A majority of them are aged parents of NRIs. If you don't reach them on time, most of them, who are either highly diabetic or suffering from age-related illnesses, will die,\" Mathew said. Stranded elderly This is exactly what Cherian meant when he said casualties could be high as Pandanad, like many other regions of Chengannur and the rest of central Kerala, have a huge number of households with aged parents and single old women. They have been living in these houses for years, with their children and grandchildren settled abroad in either the Gulf nations, Europe or the United States. It is this very lonely and vulnerable group that has now been subjected to a fourth straight day of misery . With no electricity since Wednesday night to keep their phones charged, most of them have been cut off from the rest of the world. By Thursday morning, the NRI community was in panic mode. Unable to reach their dear ones, many began to share frenzied messages over social media , even including Google drop pins. This reporter has shared at least two hundred such messages over the last two days. has not been able toindependently verify whether they have been rescued yet. Image Courtesy: Naveen Nair Although the chief minister had promised an early rescue by first light at 5.30 am on Saturday, this reporters has learnt from people on the ground that apart from a few fishing boats brought in from Alapuzha and Kollam districts, no other help was sent till well into the first half of the day. By 2 pm, some of the first survivors from Pandanad were rescued in fishermen's country-made boats. Exhausted and starved, a few of them recollected their horror from the last 72 hours. \"We were saved by fishermen from Kollam, otherwise we would have surely died tonight,\"said Saroja from Pandanad. \"Till we had charge on our phones, we kept calling everyone in the district administration. Some of them promised help, but no one came. We have been surviving on water for four days.\" An elderly man said: \"There are still so many people (in Pandanad) with food and water. The flow of water on one side of the Pampa river is such that no one can get close to the houses there. God knows what will happen to them.\" Tough terrain By noon on Saturday, rescue operations were reportedly on in full swing, though its effects have yet to be seen on the ground. The biggest challenge for rescue teams, including the navy and air force, is the terrain in Pandanad and the rest of Chengannur. What makes it tough is that the area is close to the confluence of the Papma river and the Vembanad lake. The rapid flow of water and turbulence in the Papma had literally cut off Pandanad from other regions in Chengannur. Devakumar, a fisherman from Kollam whose team said it had saved nearly 60 people in the last two days, summed up the challenge: \"We tried our best to save a lot of people, but whatever we could do was only in the periphery. On the other side, the Pampa river is in spate, and the flow is so tremendous that we could not reach that side. Only navy boats can reach those places.\" By Saturday afternoon, three Indian Air Force helicopters and 15 naval teams were pressed into service, but airlifting people has been a challenge as most houses in this area have makeshift roofs with no open and water-less space from where the choppers can lift people. These helicopters have also been dropping food packets for those who refused to leave their homes even in the face of grave danger. But the question now is whether all this help came a day too late for Pandanad and Chengannur. Lack of coordination costing those affected dearly The lack of coordination between the central forces and the district administration has made matters worse In most cases, rescue teams have had to wait for hours to get clearance from the district administration to move in to affected areas, thereby losing valuable time. Reports say that a 150-member team of the National Disaster Response Force had reached Adoor, a town near Chengannur, by Friday night, but it had not received any orders from the district administration on where to go. Meanwhile, all quarters have now raised ademand to have all rescue operations handed over to the defence forces. The Opposition leader in Kerala, Chennithala, made a written request to the prime minister when he landed in Thiruvananthapuram on Saturday morning. Follow LIVE updates on the Kerala floods here.",
"description": "multi-part series *** Pandanad in Kerala's Chengannur town could turn into the epicenter of the worst calamity to hit the state since it was formed. For the fourth day in a row, thousands of families in this central Kerala village are stranded on rooftops without food, water, medicine and electricity Local fishermen on boats are battling rough waters to save as much as they can, but with the Pampa river still in spate, flowing with rapid ferocity, most of the areas in Pandanad village are still inaccessible for rescue workers.",
"time_scraped": "2018-08-19 01:02:44.894816",
"article_id": "4992991",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala-Rains_PTI.jpg",
"path": "full/486edb84b8810fceeb4145060c61d8b00231645a.jpg",
"checksum": "80fb91c53b7d8880bc3237c182b0be8e"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/SOS.png",
"path": "full/ad77b2d1deb475ed3cf549df17d4821ad95ab8eb.jpg",
"checksum": "56bd0f5876f72b440d7f4317e5368789"
}
]
}