{
"source_article_link": "https://www.firstpost.com/india/in-rajasthan-villages-a-couples-initiative-to-introduce-free-bus-service-for-girls-drives-change-boosts-school-enrolment-4992801.html",
"title": "In Rajasthan villages, a couple's initiative to introduce free bus service for girls drives change, boosts school enrolment",
"date_published": "2018-08-18T20:13:30+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/rajasthan-380.jpg"
],
"article_body": "Editor's Note: National Crime Records Bureau Read the series here. *** Jaipur: One rainy day in 2016, five students of the Government PDM Girls College, Kotputli, in Rajasthan, were returning home after college. Monsoon showers had brought relief from the scorching heat, but negotiating the narrow road off NH-8, leading to their village Choori, was more challenging than the examination they were preparing for. Choori is situated 25 kilometres from the main Sikar Road link, on the Delhi-Jaipur highway. Some years ago, the terrain was home to lush green forests and the picturesque Aravali hills. Sadly, it is now a grim picture of a beauty ravaged by the unscrupulous quarrying mafia. It teems with stone crushers and heavy-duty dumpers and trucks that carry crushed stone to construction sites in the Delhi-NCR region. Their constant movement has left roads full of potholes. To add to the people's misery, just one bus serves not just Kotputli but several other villages along the route. Those not lucky enough to squeeze into the crowded bus, trek, but that too is fraught with risks. Stone crushers and trucks move menacingly, without regard for pedestrian safety, and women have to endure obscene remarks and, at times, physical advances by contractors and their cronies. Due to the lack of proper public transport and frequent harassment by men, many parents hesitate to send their daughters to schools and colleges. Girls, too, refrain from travelling, with the nearest college 25 kilometres away in Kotputli. A few take risks, but eventually give up the daily commute and attend college once a fortnight or month, or visit institutions only to write examinations. The free bus service for girls. Image: Mahendra Saini/101Reporters Smart Initiative On that wet afternoon when the five girls were negotiating potholes, avoiding getting splashed by passing vehicles, and the men's lecherous remarks, Dr Rameshwar Prasad Yadav from Choori, Kotputli, who works in the government hospital in Neem Ka Thana, offered them a lift in his car. During the ride, the girls shared their bitter experiences with Dr Yadav. At home, Dr Yadav narrated their problems to his wife. Without a second thought, the couple decided to launch (free bus for girls). The couple bought a bus, for which Yadav withdrew Rs 19 lakh from his provident fund account. He spends Rs 40,000 on operational costs each month from their hard-earned money. The bus ferries nearly 60 girls from at least six villages, including Choori, Qayampura, Bhotpura, Pawana Ahir and Banethi, to school and back. The provident fund and pension are savings that sustain government employees in their old age, but Yadav has already spent a huge amount. Didn’t his wife and children object? “There was no question of any objection,” says Yadav. “Due to introduction of GST last year, the delivery of the bus was delayed, and colleges reopened. My wife Tarawati pressured me to arrange an alternative bus because she felt the girls would be disheartened. So I hired a bus for Rs 1,700 per day to ferry the girls.\" Yadav has three sons who are well-settled. Does his affection and sympathy for the village girls stem from the fact that he doesn’t have a daughter? Yadav’s eyes turn moist. “I lost my six-month-old daughter 20 years ago,” he says. “I couldn’t save her though I'm a paediatrician. The loss was a turning point in my life. I decided that the money I would have spent on my daughter’s education and marriage, I would now spend on underprivileged girl children. So I didn't hesitate to use my PF savings, and my family didn’t object.” Parents on board Yadav got the girls’ parents together and formed a committee for maintenance of the bus, and to ensure the girls' safety. Former teacher Vishnu Dutt, the committee’s organiser, says girls had faced many problems, but all efforts to get a bus service started by the district administration proved futile. Local politicians, too, were of no help. “Now, with the free bus service available, Yadav has made parents of girls in Class 12 sign affidavits promising not to discontinue their education,\" he says. Prof Kanta Kamra, former principal of Government PDM Girls College in Kotputli, says the bus ensures safe travel. “Previously, absenteeism and dropout ratio were quite high. But after the free bus was launched, the situation has improved,” she says, pointing out that some panchayats are making similar efforts. “This is an excellent example of putting the slogan ‘Beti Padhao, Beti Bachao’ into practice,” the professor says. The girls, too, feel safe. Second year students Puja Verma, Ekta Dahiya and Manju Gurjar say, “We avoided going to college or would go once a month. To cover such a long distance, especially during monsoons, was a big problem. We had to face harassment on the way. Now, parents are not reluctant to send us to college. They have even stopped talking of marrying us off early.” Yadav’s wife Tarawati stands by him like a pillar. Married while still a minor, and unlettered, she not only learned to read and write but now supports her husband in his social service ventures. The Yadav couple plants 150 saplings every year, doing their bit to fight global warming. Future Plans Due to retire on 31 July, 2018, Yadav has his future roadmap planned. He is in touch with government schools around his village to ensure free education and plans free health checks in schools. He has been attempting to build toilets in schools and improve infrastructure in his alma mater. In this area, close to Rajasthan's border with Haryana, till recently, people had a biased approach to education: while daughters were sent to government schools, sons went to private schools with better facilities. Only a few could dream of higher education. According to a 2016 Human Resources Development ministry report, while nearly 8,00,000 boys enrolled in undergraduate courses, less than 5,00,000 girls did. Rajasthan’s performance in human development and overall development has not been noteworthy. Child marriage, early motherhood, high fertility ratio and anemia are worryingly rampa­nt. The main reason is disruption of girls' education. In this area of Jaipur district, 40 percent of the girls reportedly suffer from anemia, while the total fertility ratio is 2.6, against the national average of 2.3. In such a scenario, Dr Rameshwar Yadav's free bus service comes as a silver lining, driving the hope that others join in to promote literacy among girls. 101Reporters.com",
"description": "Editor's Note: National Crime Records Bureau Read the series here. *** Jaipur:",
"time_scraped": "2018-08-19 01:02:28.332665",
"article_id": "4992801",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/rajasthan-380.jpg",
"path": "full/15ae8e0f10b9341dd2e855245d51719c272f5e2d.jpg",
"checksum": "3987fd999719930c52772840242011a9"
}
]
}