{
"source_article_link": "https://www.firstpost.com/india/praising-the-executive-not-an-immediate-indicator-of-judiciarys-partiality-judges-have-right-to-free-speech-too-4992471.html",
"title": "Praising the executive not an immediate indicator of judiciary's partiality; judges have right to free speech too",
"date_published": "2018-08-18T17:58:45+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/01/hammer-court-IBNLive1.jpg"
],
"article_body": "The newly-appointed Chief Justice of the Patna High Court Mukesh Rasik Bhai Shah on Wednesday praisedPrime Minister Narendra Modi as a \"model and hero\". This was in response to being asked why he was beinglinked with the prime minister. This is not the first time that a member of the judiciary has praised the executive. In 2015, according to an article in ,the then Chief Justice of India, HL Dattu, had described Modi as a \"good leader\" with \"foresight\". He made the statement during an informal interaction with reporters. He had also said that in the four months of his tenure at that point, his interactions with the prime minister had been very positive. Representational image. News18 The Bangalore Principles of Judicial Conduct, 2002,govern the conduct of India's judiciary, though they are not binding.They listan array of values that judges should inculcate, includingindependence, impartiality, integrity, propriety, equality, competence and diligence. Rule 2.2 is of particular importance here. It states: \"A judge shall ensure that his or her conduct, both in and out of court, maintains and enhances the confidence of the public, the legal profession and litigants in the impartiality of the judge and of the judiciary.\" The third schedule of the Constitution of India includes theoath a judge takes before assuming office in a high court. In this oath, the judge affirms that he or she will perform the duties of his or her office without fear or favour, affection or ill will. This emphasises that justice should be dispersed impartially. One might ask why statements like the one made by the Patna High Court chief justice, though not sweeping, trigger an uneasiness in an individual's conscience. Looking at it from a constitutional point of view, there is no problem with any judge exercising his right to freedom of speech and expression.Article 19(1)(a) of the Constitution of India guarantees this right to all citizens, with restrictions stipulated in Article 19(2). But the problem here lies in the impartial status of judges and the faith we put in them to pronouncefair and just verdicts. A citizen approaches courts hoping for a neutral party to adjudicate the matter. But if there are even whispers of the judge being inclined towards the cause or having a certain interest in the case, the masses question the sanctity of the judiciary — the same judiciary that is considered sacrosanct in a democracy like ours. Historically, there have been times when the judiciary'ssubservience to the executive has left democracy under threat. Such instances force citizens to recall these memories. However, it must be made clear that in the current scenario, the impartiality of judges is being questioned and not their independence, unlike the past incidents. Furthermore, no judge can be considered completely objective. Everyone has their ideological inclinations and personalities they idolise. Judges are no exceptions. Therefore, it would be reasonable to assume that when a case related to the government comes up before a judge, he will adjudicate the matter abiding by the rule of law and not as per his preferences,despite his like ordislike for any personality.",
"description": "The newly-appointed Chief Justice of the Patna High Court Mukesh Rasik Bhai Shah on Wednesday praisedPrime Minister Narendra Modi as a \"model and hero\". This was in response to being asked why he was beinglinked with the prime minister. This is not the first time that a member of the judiciary has praised the executive. In 2015, according to an article in ,the then Chief Justice of India, HL Dattu, had described Modi as a \"good leader\" with \"foresight\". He made the statement during an informal interaction with reporters. He had also said that in the four months of his tenure at that point, his interactions with the prime minister had been very positive. Representational image. News18 The Bangalore Principles of Judicial Conduct, 2002,govern the conduct of India's judiciary, though they are not binding.They listan array of values that judges should inculcate, includingindependence, impartiality, integrity, propriety, equality, competence and diligence. Rule 2.2 is of particular importance here. It states: \"A judge shall ensure that his or her conduct, both in and out of court, maintains and enhances the confidence of the public, the legal profession and litigants in the impartiality of the judge and of the judiciary.\"",
"time_scraped": "2018-08-19 01:02:28.878194",
"article_id": "4992471",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/01/hammer-court-IBNLive1.jpg",
"path": "full/133f17fd2b15de4dd8c67b42f6ba6cf490c3e99f.jpg",
"checksum": "10bf3f3e1f12e32153f702f5c094e177"
}
]
}