{
"source_article_link": "https://www.firstpost.com/india/of-no-fixed-abode-proving-citizenship-under-nrc-tougher-than-breaking-gender-stereotypes-for-1964-riots-survivor-lakshmi-4992061.html",
"title": "Of no fixed abode: Proving citizenship under NRC tougher than breaking gender stereotypes for a 1964 riots survivor",
"date_published": "2018-08-18T16:47:35+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Lakshmi-Rani-Burman_825.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Of-no-fixed-abode-profile_.jpg"
],
"article_body": "Editor's Note: 30 profiles in 30 *** Guwahati: Lakhshmi Rani Barman, 48, from Choudhury Para, about 70 kilometres from Guwahati, has had a rather difficult past. She was barely 27 when her husband left her without any notice, for another woman. Left with two sons, aged 12 and 14, she chose the unconventional option of picking up the pieces and standing up on her feet. Racing past gender stereotypes, Barman chose to start her journey as an autorickshaw driver, perhaps the only female to do so in Assam, then. When pried about her choice of this particular profession, she says, “This empowered me. I don't have to depend on anyone to travel to Guwahati.\" Barman had started a small-scale business, which involved frequent travel to Guwahati from Choudhury Para. She would take passengers along, too, if she was travelling alone. Of course, the risk of travelling alone at odd hours of the day were plenty. Yet, the plucky character that she was, Barman braved through it all. Her daily journey was full of ups and downs, until she found some semblance of stability over the years. Today, 20 years later, both her sons have settled down. At a time when one would expect relaxation and peace, the NRC verdict came out. Lakshmi Rani Barman, 48, a refugee of the 1964 East Pakistan (now Bangladesh) riots, and rickshaw driver by profession, has been left out of the NRF final draft. 101Reporters.com It was a complete surprise to Barman that neither her nor her sons’ names showed up on the list. This, she says, after submitting a complete set of legitimate documents that were mandatory. The entire village has been enveloped in a state of panic, with most of their names being left out, following rumours that people would be labelled foreigners and dumped either in detention camps or elsewhere. Those who would be spared, would have to live a chaotic life full of uncertainty with almost no hope for a decent future. Barman, like most people in the Choudhury Para locality, is a refugee from the 1964 riots in Bangladesh (then East Pakistan). Under rehabilitation programmes, these refugees were issued certificates by the then government. Families who migrated were given spaces to stay, under a land exchange programme between India and East Pakistan. This is not the first time tragedy has struck citizens of Choudhury Para. According to the residents of this locality, the year 1988 saw mass evictions. As Barman recalls, “I was barely 16 then and had just given birth to my elder son. One day without any notice, men barged into our houses, threw out our belongings, got elephants to rampage around our locality, break houses and throw us away.\" \"The local MLA, Dr Kamala Kanta Kalita, stood unmoved as the eviction went on,\" she added, still rattled as she recalled flashes of the incident. The eviction happened during the time of the Asom Gana Parishad-led government, headed by then chief minister Dr Prafulla Kumar Mahanta. The residents of Choudhury Para say that a majority of individuals and their families have been left out of the NRC, reigniting panic and scars from 1988. The residents ask as to why, despite having an official refugee certificate and having provided legal documentation, all names from this particular locality are missing in the NRC draft. Majority of residents from Choudhury Para, about 70 kilometres from Guwahati have been left out in the final draft of NRC. 101Reporters.com The villagers claim that the residents of Lamgaon, a locality at the other side of the road, are all registered with the NRC. \"We have given our voter's ID card, ration card, land lease agreements and what not. What else do we give now?” rued Digen Das, Barman's neighbour. His wife and two sons’ have also not made it to the NRC final draft. Shakti Burma, another resident of the locality says, “We really work hard and earn a living by making small bamboo seats. It is a huge struggle to spend so much money running around. We have given as much documents as anyone else. Where have they kept our documents? If others are registered, why not us?” The NRC's key spokesperson and state coordinator, Prateek Hajela, has repeatedly assured that ample opportunities would be given to those who are not mentioned in the final draft to get their names included and rectified through the 'Claims and Objections' process till 30 September, 2018. But this seems to provide no assurance to the residents, since they do not have any extra documentation to provide. \"What to clarify in the claims and objections? It is the same set of documents they would ask, and these documents are all we have, which is enough according to what they asked,” says Barman. Despite words of comfort from the circle officer that no one would go to detention camps or jail, nothing seems to counter the anxiety in the minds of the entire population of Choudhury Para locality who have a strong fear of being either dumped into detention camps or spending the rest of their lives in Foreigner's Tribunal or the Gauhati High Court for a respectable identity in the state. \"I have struggled all my life. Earned my bread through hard work and respect. This is not the future I waited for,\" laments Barman. 101Reporters.com",
"description": "Editor's Note: 30 profiles in 30 *** Guwahati: Lakhshmi Rani Barman, 48, from Choudhury Para, about 70 kilometres from Guwahati, has had a rather difficult past. She was barely 27 when her husband left her without any notice, for another woman. Left with two sons, aged 12 and 14, she chose the unconventional option of picking up the pieces and standing up on her feet.",
"time_scraped": "2018-08-19 01:02:29.791830",
"article_id": "4992061",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Lakshmi-Rani-Burman_825.jpg",
"path": "full/e771ff05d4a296228d1ff7ff5564b5289096f166.jpg",
"checksum": "209314f76df47b9d649353d4e854a8f3"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Of-no-fixed-abode-profile_.jpg",
"path": "full/af6b75246a5d8b78df7e4ad29e960a4410dd3a15.jpg",
"checksum": "12d2a5e7539cb21d55c9082ffb07bcd1"
}
]
}