{
"source_article_link": "https://www.firstpost.com/india/imd-predicts-relief-for-kerala-rains-to-ease-from-monday-heavy-showers-expected-only-in-isolated-places-4993371.html",
"title": "IMD predicts relief for Kerala: Rains to ease from Monday; heavy showers expected only in isolated places",
"date_published": "2018-08-18T21:18:28+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/kerala2.jpg"
],
"article_body": "New Delhi: In a much-needed respite to rain-battered Kerala, the India Meteorological Department (IMD) on Saturday said the rainfall intensity in the state will reduce in the next two to three days. Kerala is not expected to receive heavy rainfall from 20 August, Mritunjay Mohapatra, IMD additional director general, said.He added that the southern state received 170 percent more precipitation than is normal from 1 August 1 to 17 August. Representational image. PTI \"Day before yesterday, there was heavy rainfall in almost all districts of Kerala. Yesterday (Friday), there was heavy rainfall in three to four districts. Today (Saturday), we were expecting heavy rainfall in isolated places, but not very heavy rainfall. Tomorrow (Sunday), we are expecting heavy rainfall in only one or two districts and remaining places of the state will only witness moderate rainfall. From 20 August, we are not expecting any heavy rainfall. Gradually, the rainfall intensity is decreasing.\" M Rajeevan, secretary of the Ministry of Earth Sciences, said there was a low pressure area in the Bay of Bengal, but it would not have any effect on Kerala. As many as 194 people have lost their lives and 36 are missing in Kerala since 8 August due to rains and landslides, while over 3.14 lakh people have been moved to relief camps. Kerala is facing its worst flood in 100 years, with 80 dams opened and all rivers in spate. A body blow has been dealt to the scenic state, with its infrastructure, standing crops and tourism facilities severely hit. Follow LIVE updates on the Kerala floods here.",
"description": "New Delhi: In a much-needed respite to rain-battered Kerala, the India Meteorological Department (IMD) on Saturday said the rainfall intensity in the state will reduce in the next two to three days. Kerala is not expected to receive heavy rainfall from 20 August, Mritunjay Mohapatra, IMD additional director general, said.He added that the southern state received 170 percent more precipitation than is normal from 1 August 1 to 17 August. Representational image. PTI \"Day before yesterday, there was heavy rainfall in almost all districts of Kerala. Yesterday (Friday), there was heavy rainfall in three to four districts. Today (Saturday), we were expecting heavy rainfall in isolated places, but not very heavy rainfall. Tomorrow (Sunday), we are expecting heavy rainfall in only one or two districts and remaining places of the state will only witness moderate rainfall. From 20 August, we are not expecting any heavy rainfall. Gradually, the rainfall intensity is decreasing.\"",
"time_scraped": "2018-08-19 01:02:28.649023",
"article_id": "4993371",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/kerala2.jpg",
"path": "full/e56fdfc43977c7af6886cb7a23665d73f116c284.jpg",
"checksum": "8c3b4deaf6e494813e810ef50cf6c3b4"
}
]
}