{
"source_article_link": "https://www.firstpost.com/india/karnataka-rains-six-killed-in-kodagu-govt-steps-up-rescue-ops-in-district-announces-rs-5-lakh-for-kin-of-victims-4993421.html",
"title": "Karnataka rains: Six killed in Kodagu; govt steps up rescue ops in district, announces Rs 5 lakh for kin of victims",
"date_published": "2018-08-18T21:42:23+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/karnataka-380.jpg"
],
"article_body": "Bengaluru: Bolstered by the army, navyand air force, the Karnataka government on Saturday intensified relief operations in Kodagu district, where six people were killed inrain-related incidents in the past 24 hours. Chief Minister HD Kumaraswamy undertook an aerialsurvey of the district which has been experiencing heavy rain for the past three days. Deputy Chief Minister Parameshwara tweeted that sixpeople have been killed in Kodagu due to floods and landslides during the past 24 hours. Rescue efforts are on in Kodagu district in Karnataka. Image Courtesy: Twitter/Cm of Karnataka The government has announced a compensation of Rs 5 lakhto the next of kin of each of the deceased, he said, adding that the government would take care of the treatment of the injured. Landslides were reported from some places in thedistrict and authorities have stepped up efforts to rescue stranded people, officials said. \"There is a severe situation for the past three days. Now central and state rescue teams are working on a warfooting,\" Kumaraswamy told reporters. An M17 air force helicopter has been deployed toprovide food packets to the marooned and to airlift them, the chief minister said. The government has deployed as many as 948 personnel from the army engineering task force, Dogra regiment, Indian Navy, National Disaster Response Force, fire and emergencyservices, home guards and civil defence, Kumaraswamy said.In addition to this, 200 NCC cadets have also been deployed. About 50 earthmovers have also been working round theclock to clear debris caused by the landslips. Boats are alsobeing used in the rescue operations. \"More than 2,500 people have been rescued.. in Jodupalvillage alone, 348 people have been rescued,\" he said. The state government has sanctioned Rs 100 crore for undertaking relief work in Kodagu district. A sum of Rs 200 crore was announced as grant-in-aidto the affected districts for relief work a few days ago. A committee, comprising senior administrative officers led by Chief Secretary TM Vijay Bhaskar, has beenconstituted to monitor relief operations, Kumaraswamy said. \"In Jodupal village, we have lost around 300 acres of landin landslides. As many as 39 relief camps have been set up in the state, of which 30 are in Kodagu alone and the rest are inDakshina Kannada district,\" he said. Revenue officers and doctors from Mysuru, Ramanagar, Mandya, Hassan and Chamarajnagar have been deployed in large numbers in Kodagu district. The government has supplied 2.5 lakh litres drinking water for Kodagu district and efforts are also on to restore power supply in rain-hit areas, he said. Kumaraswamy said he has directed officials toidentify those who have lost their houses.\"At least 800 houses have been completely damaged in Kodagu due to rain..I have directed district authorities toidentify those who have lost their houses and prepare a list.Considering them as special cases, Rs 2 lakh to Rs 2.5lakh will be given as compensation to them,\" he said.",
"description": "Bengaluru: Bolstered by the army, navyand air force, the Karnataka government on Saturday intensified relief operations in Kodagu district, where six people were killed inrain-related incidents in the past 24 hours. Chief Minister HD Kumaraswamy undertook an aerialsurvey of the district which has been experiencing heavy rain for the past three days. Deputy Chief Minister Parameshwara tweeted that sixpeople have been killed in Kodagu due to floods and landslides during the past 24 hours. Rescue efforts are on in Kodagu district in Karnataka. Image Courtesy: Twitter/Cm of Karnataka The government has announced a compensation of Rs 5 lakhto the next of kin of each of the deceased, he said, adding that the government would take care of the treatment of the injured.",
"time_scraped": "2018-08-19 01:02:29.120822",
"article_id": "4993421",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/karnataka-380.jpg",
"path": "full/f46152363539a771464cdd200ef4d55c45fe6af9.jpg",
"checksum": "6e6aa9ba9a7041aba847b2c4ddb4da1d"
}
]
}