{
"source_article_link": "https://www.firstpost.com/india/minimum-support-price-centres-move-to-hike-msps-makes-industries-dependent-on-agrarian-produce-vulnerable-4993281.html",
"title": "Minimum Support Price: Centre's move to hike MSPs makes industries dependent on agrarian produce vulnerable",
"date_published": "2018-08-18T21:10:08+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/cotton-industry-380.jpg"
],
"article_body": "Editor's Note: Ludhiana: The hike in the minimum support prices (MSP) of 14 agriculturally significant commodities may benefit the Bharatiya Janata Party-led government in the next general election, but presents a very real problem for industries dependent on those crops. The textiles, garment, hosiery and food processing industries are particularly vulnerable as these raw materials comprise half their total input cost. This will increase the domestic and export prices of their products, making them less affordable to consumers and hurting their competitiveness in overseas markets. The knock-on effect of higher food prices in the consumer basket add to inflationary pressures and depress demand. Says Vinod Thapar, chairman of the Knitwear Club, \"Due to the increase in the cost of inputs, the finished product will be costlier by about 25-30 percent, and it will adversely affect both export and domestic sales in the garments and hosiery industry.\" On 4 July, 2018, the Cabinet Committee on Economic Affairs (CCEA) approved an MSP hike for 14 kharif crops. The MSP of medium staple-length fibre cotton was increased by Rs 1,130 per quintal to Rs 5,150 per quintal from last year's Rs 4,020 per quintal. Long staple-length fibre is now Rs 5,450 per quintal as compared to Rs 4,320 per quintal last year. Earlier increases in the MSP were meagre by comparison. In 2016-17, the hike across both types of cotton crops was Rs 160 per quintal, while in 2015-16, it was raised by Rs 60 per quintal, and by Rs 50 per quintal in 2014-15. A cotton processing industry. The hike in MSPs has adversely affected industries which depend on agricultural produce. Image: KG Sharma The steep hike of Rs 1,130 per quintal of cotton will have an immediate and adverse impact on the textile industry, where raw material constitutes between 50-60 percent of total input costs. This will affect the price of the final products, yarn and sewing thread. With their increase, it is expected that market prices of garments and hosiery products will also increase by 25-30 percent by the coming winter season. Mukesh Bansal, senior vice president, Vardhman Textile Ltd, says, \"In fabric manufacturing, cotton-blended yarn constitutes 35-45 percent of the total input. Prices of cotton affects 25 to 30 percent of the total cost of the finished products,\" he says. G Balasubramaniam, secretary general of the Northern Textile Mills Association, says that the MSP hike in cotton will affect the market mechanism in both the domestic and export sectors of all industries relying on cotton. \"Increase in cost will affect turnover volumes of these industries, also lowering overall sales. Cotton prices in the world market will also be affected,\" he predicts. Food processing industry hit too The MSP of common-grade paddy was increased by Rs 200 per quintal to Rs 1,750 per quintal as compared to last year's Rs 1,550 per quintal. The MSP of jowar (maldandi) has been increased by Rs 725 per quintal to Rs 2,450 per quintal as against last year's MSP of Rs 1,725 per quintal. The MSP of ragi was increased by nearly Rs 1,000 per quintal to Rs 2,897 per quintal as against last year's Rs 1,900. The MSP of maize has increased by Rs 275 per quintal to Rs 1,700 per quintal as against Rs 1,425 last year. In past years, the MSP for these crops increased on average only by 3-7 percent a year, ranging from Rs 15 to 75 per quintal. As with the textile industry, there are fears of turnover volumes of the food processing industry suffering. Says RK Thukral, president, Food Processing Industries Association, Punjab, \"In some food processing industries, 70-80 percent of the total cost comes from purchasing raw materials. So, this extraordinary MSP hike in agricultural products by around 15 to 50 percent, will increase the total cost of manufacturing, affecting sales in both domestic and export markets. The MSP hike of kharif crops ranging between 15 and 50 percent on various agricultural products will have a direct impact on input cost in bread and biscuit industry, says Sudeep Ahuja, managing director, Milkmade Foods India, and vice-president for the North Region of All India Bread Manufacturers Association. \"There will be an increase in input cost by 20 percent on an average in bread & biscuit industry. It will effect the turnover and industry will try to cover up by increasing (market) prices.\" The impact of such a large MSP hike will not be limited to industries in Punjab, but will be felt by food processing units across the country. According to Ramesh Mago, president, All India Bread Manufacturers Association, the combined impact of MSP hikes of 18-20 percent on kharif crops and 10-12 percent on rabi crops will blow up the input cost in bread and biscuit industry by 28 to 30 percent. “Expected rise in input cost will also have adverse effects on domestic as well as export sales. In export, the continuous rise in dollar rate is compensating the decreasing margins, but in domestic market, it will cut both, sales volume as well as margins,” Mago explains. Also Read Minimum support price: Poll gimmicks cannot alleviate farm distress, government steps woefully inadequate Minimum support price: Unkept promises on cost mitigation, bad formula to determine MSP compound farm woes",
"description": "Editor's Note: Ludhiana: The hike in the minimum support prices (MSP) of 14 agriculturally significant commodities may benefit the Bharatiya Janata Party-led government in the next general election, but presents a very real problem for industries dependent on those crops. The textiles, garment, hosiery and food processing industries are particularly vulnerable as these raw materials comprise half their total input cost.",
"time_scraped": "2018-08-19 01:02:29.235273",
"article_id": "4993281",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/cotton-industry-380.jpg",
"path": "full/d03567561f8dc302e5bb377a6bc8ce41578679fc.jpg",
"checksum": "4e3c627f54637068e001925213288046"
}
]
}