{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayees-ashes-to-be-immersed-at-haridwar-on-sunday-rajnath-singh-to-attend-ceremony-4993561.html",
"title": "Atal Bihari Vajpayee's ashes to be immersed at Haridwar on Sunday; Rajnath Singh to attend ceremony",
"date_published": "2018-08-18T23:11:25+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal_Bihari_Vajpayee_Reuters11.jpg"
],
"article_body": "New Delhi: Former prime minister Atal Bihari Vajpayee's ashes will be immersed in various rivers across the country, starting with the Ganga at Haridwar on Sunday, the BJP said on Saturday. The immersion ceremony at the holy city on Sunday will be attended by Union Home Minister Rajnath Singh, Uttar Pradesh chief minister Yogi Adityanath, his Uttarakhand counterpart Trivendra Singh Rawat among others, BJP leader Bhupender Yadav told reporters in New Delhi. File image of Atal Bihari Vajpayee. Reuters One of the most charismatic leaders in independent India, Vajpayee passed away in New Delhi on Thursday at the age of 93. He was cremated with full State honours at the Rashtriya Smriti Sthal in the national capital on Friday. Yadav said an all-party prayer meeting for the BJP stalwart will be held in New Delhi on 20 August and another such meeting will be organised in Lucknow on 23 August since Vajpayee's appeal cut across political divide. Apart from the home minister and Uttar Pradesh chief minister, Vajpayee's relatives will attend the Lucknow prayer meeting, he said, adding that the former prime minister's ashes will also be immersed in the Gomati river there. The prayer meeting in Delhi will be attended by leaders from different political parties and noted citizens, Yadav said. \"His (Vajpayee's) ashes will be immersed in various sacred rivers across the country and the ' ' taken to all the districts headquarters and state capitals. Prayer meetings will take place in the state capitals, district headquarters and at the panchayat level,\" he added. Meanwhile, the saffron party also expressed solidarity with the people of Karala, who are bearing the brunt of torrential rains and floods, and said its workers will visit every household in the affected areas of the southern states as a part of the rehabilitation measures. BJP national secretary P Muralidhar Rao said the state units of the party were collecting relief materials from across the country, while the units in the neighbouring states of Kerala were planning to send doctors' teams to the flood-hit state. \"The BJP is with the people of Karala,\" he said, adding that Prime Minister Narendra Modi and the home minister had already announced an assistance of Rs 500 crore and Rs 100 crore respectively. The prime minister, Rao said, had also appealed to the insurance companies to expedite the disbursement of compensations, including those towards crop insurance.",
"description": "New Delhi: Former prime minister Atal Bihari Vajpayee's ashes will be immersed in various rivers across the country, starting with the Ganga at Haridwar on Sunday, the BJP said on Saturday. The immersion ceremony at the holy city on Sunday will be attended by Union Home Minister Rajnath Singh, Uttar Pradesh chief minister Yogi Adityanath, his Uttarakhand counterpart Trivendra Singh Rawat among others, BJP leader Bhupender Yadav told reporters in New Delhi. File image of Atal Bihari Vajpayee. Reuters One of the most charismatic leaders in independent India, Vajpayee passed away in New Delhi on Thursday at the age of 93. He was cremated with full State honours at the Rashtriya Smriti Sthal in the national capital on Friday.",
"time_scraped": "2018-08-19 01:02:29.815857",
"article_id": "4993561",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal_Bihari_Vajpayee_Reuters11.jpg",
"path": "full/1a849e6f780e269d233ec885d2dc77dad8b63e75.jpg",
"checksum": "b883613a61009cd10a9fb781d7859906"
}
]
}