{
"source_article_link": "https://www.firstpost.com/india/disruptor-realist-optimist-atal-bihari-vajpayees-foreign-policy-both-carried-forward-and-departed-from-nehruvian-legacy-4993601.html",
"title": "Disruptor, realist, optimist: Atal Bihari Vajpayee's foreign policy both carried forward and departed from Nehruvian legacy",
"date_published": "2018-08-19T08:55:55+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee_Twitter-380.jpg"
],
"article_body": "The tenets that defined former prime minister Atal Bihari Vajpayee's politics also shaped his foreign policy. As a true democrat, he stood for building consensus and reflexively chose the reconciliatory approach. However, even in his policy of seeking solutions through engagement, his belief never suffered from a doctrinaire rigidity. As a result, the former prime minister, whose ideas were widely shaped through his long parliamentary career and during his formative years as the external affairs minister in the Morarji Desai Cabinet, could be a foreign policy disruptor, an adherer, a realist and an optimist all at the same time. As the external affairs minister in the Janata Party government in 1977, Vajpayee — backed by the then prime minister Morarji Desai— worked towards recalibrating bilateral ties with the former Soviet Union, which was a perceptible swing towards \"proper non-alignment\" away from India's status as a de facto Soviet ally. This \"shift\" mirrored — perhaps inadvertently —the change that had already taken place in the final years of the Indira Gandhi government, as Brookings Institution fellow and director of The India Project Tanvi Madan pointed out on Twitter. It reflected \"continuity\" in foreign policy, despite the deep antagonism that marked the Congress-Janata Party relationship in the domestic arena. As EAM in the Morarji Desai govt, #AtalBihariVajpayee & the PM doubled down on a shift that had taken place in last yr of IG’s regime: improving rels w/ neighbors (incl China), trying to move away from overdependence on USSR & twd “a better balance” or “genuine nonalignment” (3) — Tanvi Madan (@tanvi_madan) August 17, 2018 During his visit to New Delhi in April 1977, the then Soviet foreign minister Andrei Gromkyo had told Vajpayee, his Indian counterpart, that Moscow had no problem if India seeks to improve its relationship with China or the United States. \"It is not in our policy and it will not be,\" Gromkyo was quoted as saying by The Caglary Herald . For his part, Vajpayee described the ties as a \"permanent factor in a changing world\", while his prime minister, Desai, was busy announcing an end to India's \"special relationship\" with any nation, which he believed was Indira's legacy. Desai's statecraft seemingly suffered from reactionary impulses — he also put paid to the Indian intelligence sector by completely dismantling the structure built by Indira— and was shaped by temporal considerations. Vajpayee, however, never lost sight of the big picture. Remember that those were the early days of his career. If this indicated Vajpayee's belief in India's strategic culture, he was not averse to act as the disruptor either, upending axiomatic notions of Indian foreign policy and rescuing it from Cold War dogmatism, an ideological straitjacket and bureaucratic dowdiness. File image of former prime minister Atal Bihari Vajpayee. Twitter @rajahulideepu11 As the prime minister in September 1998 — a few months after the Pokhran II tests in May that put India in the league of nuclear powers and angered the US and its allies — Vajpayee stunned audiences when he declared during a lecture in New York that India and the US were \"natural allies\" due to their common interests. This might be the watchword of the India-US relationship in recent times, but in 1998, in the aftermath of Cold War and at the height of US outrage and antagonism towards India for daring to conduct the nuclear tests in secrecy, it was a jaw-dropping announcement. Vajpayee's audacious, prescient statement reset bilateral ties and paved the way for an immediate uptick in India's relationship with the US — former president Bill Clinton visited India in 2000 — and a gradual strategic embrace. Vajpayee stance wasn't a punt but a pitch backed by the belief that for all their differences, which appeared insurmountable at that point in history, India and the US have more in common and a lot to offer the world. \"…on all these major challenges facing mankind today, my belief is that progressive people all over the world have convergent views. I see this convergence, especially among the forward-looking leaders, policy-makers and intellectuals of India and America,\"Vajpayee said during a speech organised by Asia Society , an American think tank. \"It is this convergence. It is this commonality of concerns and cognition, which reinforces my belief that India and the United States are natural allies in the quest for a better future for the world in the 21st century.\" This speech became the backbone for a policy that has gained relevance, and his words find increasing resonance even two decades later in the current milieu. US Secretary of State Mike Pompeo, in his recent comments to members of the powerful Senate Foreign Relations Committee, held that \"for scores of reasons, India needs to be central to what we do. Specific issues — South Central Asia issues, Southeast Asia issues. They ought to be one of our closest partners, and we ought to do everything we can to make sure that we achieve that.\" This ranks Vajpayee among the rare statesmen who \"have the capacity or opportunity to alter the basic direction of their nation's foreign policies. The weight of geography, historical precedent, ideological baggage and bureaucratic inertia prevent leaders from a significant reorientation of external relations… Atal Bihari Vajpayee is among the few to have successfully changed the worldview of a large nation\", C Raja Mohan of National University of Singapore wrote in his column for In his policy disruptions, calibrations, continuations, hard-nosed negotiations and leaps of faith, the one thing that distinguished Vajpayee from the rest was the belief in Indian exceptionalism. Nearly all the decisions that he made in his six-year tenure as India's prime minister were rooted in the understanding that India as a power is unique, and itscolonial experience and civilisational ethos, which areat the core of its nationalism, shaped itsexceptionalism. Here, Vajpayee is the flag-bearer of the Nehruvian legacy but also the author of a departure. While Jawaharlal Nehru placed India's exceptionalism within an internationalist structure, for Vajpayee, the calling lied in the civilisational underpinnings. For instance, by delivering his address at the United Nations General Assembly in Hindi in 1977, Vajpayee had carved out a place for India's civilisational ethos on the world stage, a baton that Prime Minister Narendra Modi picked up. These departures, however, stayed congruent with India's need to become an example before the world. As Hudson Institute fellow Aparna Pande writes in her book , \"There is a strong belief that not only India is destined for great power status but also that India is an example for the world, especially the developed countries.\" This exceptionalism is evident in the way Vajpayee felt that it was India's burden to resolve the vexatious power imbalance in Asia and took upon himself the task of normalising relations with Pakistan at a great risk to his political capital and credibility. In a second Asia Society address in New York in 2000, two years after the first speech, Vajpayee— now a prime minister with a stable National Democratic Alliance government at the Centre— laid out his reasons behind repeated rapprochement with Pakistan, despite its many betrayals. \"As the largest country in South Asia and the only one that shares borders with all other countries in the region, we are mindful of our special responsibility in taking the leadership in fostering co-operation… In pursuit of this approach, we have displayed a generosity of spirit that few countries can match. We have shown this in our dealings with all our neighbours,\" he said in his address.\"All these have been an integral part of our approach to Pakistan, as well. From the time of the Shimla Agreement— a generous agreement if ever there was one — we have sought to build friendly relations. Those of you who were present when I last addressed the Asia Society in 1998, will recall my emphasising India's faith in bilateral dialogue and accords in building peaceful relations with Pakistan.\" This formed the core of Vajpayee's policy towards Pakistan, fashioned by his belief that one can choose one's friends but not one's neighbours. In his overtures towards Pakistan, however, Vajpayee also revealed his optimistic side, even though that optimism might have appeared thoroughly misplaced. However, there is a case to be made that in Vajpayee and Nawaz Sharif, India and Pakistan had the best chance till date of normalising relationsbetween the neighbours. Both leaders understood that neither can focus on nation-building with the necessary intensity if the relationship was ruled by animosity.Both leaders gave it their best shot. As Shakti Sinha, director of the Nehru Memorial Museum and Library, who had served as private secretary to Vajpayee and was a joint secretary in his Prime Minister's Office, writes in the Hindustan Times :\"He (Vajpayee) and Nawaz Sharif staked their personal reputation and political equity on moving ahead, but Pakistan's Deep State quickly realised that if the two succeeded, its bluff that India wanted to dismember Pakistan would be called. It had to strike back and ensure that till it controlled the narrative and power in Pakistan, there would be no movement ahead on the road to peace.\" Vajpayee eventually came around to this realisation. His second Asia Society speech also carries this lament. \"In the spring of last year, I travelled to Lahore in search of a new quality of relations in the sub-continent and a new age of regional co-operation,\" he had said. \"That our initiative was not merely a gesture is reflected in the Lahore Declaration and the resumption of composite dialogue. The rulers of Pakistan responded through Kargil in the summer of 1999… Unfortunately, Pakistan misread our generosity of spirit and our desire for friendly relations as a weakness.\" Vajpayee was able to give structural stability to India's relationship with China by setting off a quid pro quo in Tibet and Sikkim and formalising the boundary dispute within a \"special representative\" mechanism. That structure still forms the backbone of India's ties with China, though it has come under severe strain in recent past. To summrise, Vajpayee's foreign policy legacy would be both continuity and change, guided by the light of realism, tempered through optimism and placed within the context of Indian exceptionalism. By following his path, Vajpayee's successors have highlighted his vision.",
"description": "The tenets that defined former prime minister Atal Bihari Vajpayee's politics also shaped his foreign policy. As a true democrat, he stood for building consensus and reflexively chose the reconciliatory approach. However, even in his policy of seeking solutions through engagement, his belief never suffered from a doctrinaire rigidity. As a result, the former prime minister, whose ideas were widely shaped through his long parliamentary career and during his formative years as the external affairs minister in the Morarji Desai Cabinet, could be a foreign policy disruptor, an adherer, a realist and an optimist all at the same time. As the external affairs minister in the Janata Party government in 1977, Vajpayee — backed by the then prime minister Morarji Desai— worked towards recalibrating bilateral ties with the former Soviet Union, which was a perceptible swing towards \"proper non-alignment\" away from India's status as a de facto Soviet ally. This \"shift\" mirrored — perhaps inadvertently —the change that had already taken place in the final years of the Indira Gandhi government, as Brookings Institution fellow and director of The India Project Tanvi Madan pointed out on Twitter. It reflected \"continuity\" in foreign policy, despite the deep antagonism that marked the Congress-Janata Party relationship in the domestic arena. As EAM in the Morarji Desai govt, #AtalBihariVajpayee & the PM doubled down on a shift that had taken place in last yr of IG’s regime: improving rels w/ neighbors (incl China), trying to move away from overdependence on USSR & twd “a better balance” or “genuine nonalignment” (3)",
"time_scraped": "2018-08-20 03:51:24.898842",
"article_id": "4993601",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee_Twitter-380.jpg",
"path": "full/2dff5436b4b57204e75ea70ccfea3334198a3f67.jpg",
"checksum": "924e41a1787172ff1ce50b337f25b95f"
}
]
}