{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-live-updates-imd-says-no-heavy-rain-warning-for-next-four-days-22034-more-rescued-today-4993611.html",
"title": "Kerala floods LIVE updates: IMD says no heavy rain warning for next four days; 22,034 more rescued today",
"date_published": "2018-08-19T18:04:13+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala_Flood_Reuters1.jpg"
],
"article_body": "Kerala floods latest updates: Chief minister Pinarayi Vijayan says only one phase of the calamity is over and rehabilitation is the next big challenge before us.\"The spirit that we showed in rescue work needs to be replicated in rehabilitation efforts also,\" the chief minister said.Around 8 lakh have been displaced in the deluge so far; Vijayan says rescue operations are in the last leg. Further, train services between Thiruvananthapuram - Ernakulam have been reinstated, and passenger services are on. In a tweet, the defence ministry said that approximately 23,213 people were rescued by the armed forces on Sunday. More than 2,000 people were provided with medical aid. Twenty-two landslides were cleared and connectivity restored at 42 locations. Fifteen temporary bridges were also constructed by the Indian Army. Thousands of people in flood-hit areas in Kerala are battling all odds to survive as the death toll has touched 197 in the past 10 days in the second spell of monsoon fury since 8 August. Many are still stranded in their homes with no food and sheaths of water around them at various places in Alapuzha, Thrissur and Ernakulam districts. Alappuzha District Collector S Suhas claimed that 97 percent of the people marooned in the flooded Kuttanad region have been evacuated and efforts are on to rescue the remaining. Acknowledging the commendable job of the Indian Armed forces, the KJ Alphons said, \"The NDRF and the paramilitary forces are working day and night. We have close to one million people in relief camps and we need to feed them. We have the armed forces, NDRF, paramilitary Forces at work.\" As of 10 am on Sunday, the water level in the Idukki reservoir was 2,402.28 feet. The water flow into Periyar river is 913 cusecs per hour. Two shutters of the dam have been closed.The Alappuzha police have arrested five people, who have refused to lend their houseboats for rescue operations in the Kuttanad region, where a massive evacuation is on following flood in the Pampa river. In the wake of massive floods in Kerala, the Centre on Friday decided to open Kochi Naval airstrip for use by commercial aircraft by Monday and deploy five more choppers, taking the total number of aircraft used for rescue and relief to 96. An official from the Disaster Management Authority control room said 409 houses were fully and 4,680 houses were partially destroyed in the floods since 8 August. The crop loss estimated till Saturday was worth Rs 224.21 crores. With mass evacuation from Kuttanad region in Kerala beginning, the number of people shifted to relief camps across Kerala has crossed 8.45 lakh. Meanwhile, Cases of chicken pox infection has been reported from a relief camp in Ernakulam district. According to information three people at Aluva UCC college camp have been diagnosed with the air-borne disease. In one of the biggest rescue operations carried out in India, officials said that 67 helicopters, 24 aeroplanes and 548 motorboats have been deployed for rescue and relief operations across flood-ravaged Kerala. The death toll due to rains and floods in Kerala has gone up to368 this monsoon season, as33 more deaths were reported on Saturday even as around 58,000 people were rescued in different parts of the state, and red alert continued in 11 districts following prediction of more rains. The India Meteorological Department forecast on Saturday afternoon that widespread rains, with heavy rains at isolated places, is likely to continue over Kerala following low pressure area developing over northwest Bay of Bengal and neighbourhood during the next 24 hours. While around 60,000 people were rescued in districts like Ernakulam, Chengannur, Pathanamthitta and Thrissur, there are still many more waiting to be rescued. Barring Thiruvananthapuram, Kollam and Kasargod, the remaining 11 districts of Kerala were on red alert on Saturday. The worst affected places include Aluva, Chalakudy, Chengannur, Alappuzha and Pathanamthitta, where massive rescue operations were on as scores of persons were rescued. Media houses continued to be flooded with requests from friends and relatives of those stranded in affected areas. Representational image. Reuters Chief Minister Pinarayi Vijayan told Prime Minister Narendra Modi at a review meeting in Kochi that the death toll since 29 May had climbed to 357. Over 3.53 lakh affected persons had been lodged in over 2,000 relief camps, he said. Modi sanctioned Rs 500 crore to the flood-battered state, apart from Rs 100 crore announced earlier by the Centre on 12 August, before returning to Delhi after an aerial survey of the affected areas. The 33 deaths reported during the day were in Ernakulam, Thrissur, Idukki, Pathanamthitta and Alappuzha districts. Vijayan told the media here the situation is \"very serious and grave\". \"The death toll would have been higher, but for the work we did. Things are under control,\" said Vijayan, whose government was flayed by Congress leader Ramesh Chennithala for failing to take up rescue and relief work effectively. Food Minister P Thilothaman, camping at Chengannur, told the media: \"The need of the hour is to provide food packets and drinking water to the people. About 15 small boats of the Navy are expected to join rescue and relief work. But, after dusk, no rescues are possible. Helicopters are also needed for faster evacuation.\" Meanwhile, anger mounted across Kerala as coordination of rescue work went haywire due to the magnitude of the calamity. \"There are several people who are waiting to be rescued in areas like Pandanad (near Chengannur) and I saw two bodies floating in the water. If there is anymore delay in, things will taken a turn for the worse. We are drinking rain water to keep us going...,\" said a resident of Pandanad. On late Saturday evening, a 150-member National Disaster Response Force (NDRF) team started rescue operations in and around affected areas of Chengannur. Congress legislator VD Sateeshan, who was spearheading the rescue operations in Paravur in Ernakulam district, said that he stood before a rescue boat team with folded hands and they obliged and rescued several people. \"In the camp at my place, there are 7,000 people and despite passionate pleas this camp has not received any government help at all. Several people have to take medicines for lifestyle diseases, but no medical kits have come. I have spoken to the Chief Minister down to all...All I got is assurances,\" said Sateeshan. National award winning actor Salimkumar, after remaining holed up in his house along with 45 others for three days, was finally rescued by a fishing boat on Saturday evening. \"I was receiving daily calls from NDRF officials even from Delhi that rescue will happen very soon, but help came after three days,\" said Salimkumar. Flaying the state for \"failing in the endeavour\", Leader of Opposition Chennithala said: \"I have been flooded with calls from the affected persons. Even now, thousands of people are stranded. The Chief Minister dismissed with contempt when I said this week that rescue and relief should be handed over to the Army. I do not want to blame anyone but it has been proved beyond doubt that the state government has failed.\" Alappuzha Superintendent of Police AP Surendran said: \"Things are moving fast on Saturday. Helicopters and more boats have been pressed into service. We are confident we will be able to rescue more stranded people.\" More fishing boats from various places reached the affected areas during the day. Alappuzha District Collector S Suhas said since morning 150 boats including house boats have been engaged in rescuing people and \"today (Saturday) we have by now evacuated about 75 per cent of people who were waiting to be rescued\". \"Around two lakhs people are now in various camps. This could well be the biggest rescue operation. At some places the water is very rough and various types of boats are rescuing people,\" Suhas said. Journalist-turned-CPM legislator Veena George on Saturday turned critical \"due to the way the government machinery in Pathanamthitta has been working\". \"None has a clue of how many people have been rescued and how many are left to be rescued. There seems to be disconnect in coordination of the operations,\" said George. The situation in Kozhikode, Malappuram, Palakkad and Wayanad inched towards comparative normalcy as rains slowed and water level receded, with many living in crowded relief camps awaiting to return home. But a landslide near Nelliyampathy in Palakkad district has left around 1,000 people cut off from the mainland and the Army is working to clear the debris. At several places in waterlogged areas, banks could not function normally since staff failed to report for the duty due to flooding. Railway services between Ernakulam and Thrissur remained suspended on Saturday with long-distance trains diverted via the Nagercoil route. A trial run on the Kottayam sector took place later in the day, as all services on this route were suspended for the past two days. Certain blockades on the Thrissur-Palakkad-Aluva highway was cleared for traffic. Army personnel worked hard to clear the roads to Munnar. Kerala is facing the heaviest rains and consequent widespread floods and destruction since 1924, which the state estimates has caused a loss of over Rs 19,500 crore.",
"description": "Kerala floods latest updates: Chief minister Pinarayi Vijayan says only one phase of the calamity is over and rehabilitation is the next big challenge before us.\"The spirit that we showed in rescue work needs to be replicated in rehabilitation efforts also,\" the chief minister said.Around 8 lakh have been displaced in the deluge so far; Vijayan says rescue operations are in the last leg. Further, train services between Thiruvananthapuram - Ernakulam have been reinstated, and passenger services are on. In a tweet, the defence ministry said that approximately 23,213 people were rescued by the armed forces on Sunday. More than 2,000 people were provided with medical aid. Twenty-two landslides were cleared and connectivity restored at 42 locations. Fifteen temporary bridges were also constructed by the Indian Army. Thousands of people in flood-hit areas in Kerala are battling all odds to survive as the death toll has touched 197 in the past 10 days in the second spell of monsoon fury since 8 August. Many are still stranded in their homes with no food and sheaths of water around them at various places in Alapuzha, Thrissur and Ernakulam districts. Alappuzha District Collector S Suhas claimed that 97 percent of the people marooned in the flooded Kuttanad region have been evacuated and efforts are on to rescue the remaining.",
"time_scraped": "2018-08-20 03:51:32.737476",
"article_id": "4993611",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala_Flood_Reuters1.jpg",
"path": "full/0816f99b045fd12787e790feed92dc9b53063017.jpg",
"checksum": "d0e781b4b9b2a22e34120e93a12353ad"
}
]
}