{
"source_article_link": "https://www.firstpost.com/india/narendra-dabholkar-murder-hope-real-perpetrators-nabbed-soon-says-activists-son-hamid-after-cbi-arrests-gunman-4994041.html",
"title": "Narendra Dabholkar murder: Hope real perpetrators nabbed soon, says activist's son Hamid after CBI arrests gunman",
"date_published": "2018-08-19T11:38:27+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Untitled-design-163.jpg"
],
"article_body": "Pune: The son of slain Maharashtra rationalist Narendra Dabholkar hoped that the real perpetrators behind the murder of his father are nabbed soon. According to media reports, the Central Bureau of Investigation (CBI) on Saturday arrested one of the two gunmen who allegedly killed Narendra Dabholkar in 2013. Sachin Prakasrao Andure, who is believed to be one of the shooters who shot dead the MANS founder in Pune, was arrested by the central probe agency from Maharashtra's Aurangabad. Hamid Dabholkar. ANI Narendra Dabholkar's son Hamid Dabholkar, told , \"The CBI has arrested a person in connection with the case. I think it is an important development in the case which will help in the further probe. We hope that with this arrest, investigating agencies will get to the mastermind who was involved in the killing of my father Dr Dabholkar. The Bombay High Court is supervising and monitoring the case. I hope soon the accused in murder cases of Govind Pansare, MM Kalburgi and Gauri Lankesh will also get arrested by the police.\" Meanwhile, DCP Anti-Terror Squad (ATS) of Maharashtra D Kulkarni underscored that following a tip-off from Thane's ATS team Andure was arrested. \"Thane ATS team, had recently arrested three persons from Nalasopara and Pune in an alleged case of explosives seizure. During custodial interrogation, one of the arrested people revealed about Andure's direct involvement in the Dabholkar killing,\" said Kulkarni. \"One more person was summoned and he also revealed identical information, following which the CBI arrested one more person and now is further investigating the case,\" Kulkarni said. The arrest comes few days ahead of the fifth death anniversary of Dabholkar, who was murdered by unknown bike-borne assailants from point-blank range on 20 August, 2013, in Pune, while he was returning home from a morning walk. The Bombay High Court on 2 August had pulled up Maharashtra's Special Investigation Agency (SIT) and CBI probing the case. The court cracked a whip on the investigative agencies directing them to adopt the same degree of seriousness and promptness like Karnataka Police which is probing the Gauri Lankesh murder case. \"Is there a lack of coordination, or are the authorities before us restricting their probe to merely pursuing mobile phone records,\" the court had said. Following a demand by members of Dabholkar's family, the case was handed over to the CBI for investigation. On a related note, the Karnataka police while probing the killing of journalist Gauri Lankesh found out that suspects in Lankesh's murder had links with the conspirators in the murders of Dabholkar, Karburgi and Pansare.",
"description": "Pune: The son of slain Maharashtra rationalist Narendra Dabholkar hoped that the real perpetrators behind the murder of his father are nabbed soon. According to media reports, the Central Bureau of Investigation (CBI) on Saturday arrested one of the two gunmen who allegedly killed Narendra Dabholkar in 2013. Sachin Prakasrao Andure, who is believed to be one of the shooters who shot dead the MANS founder in Pune, was arrested by the central probe agency from Maharashtra's Aurangabad. Hamid Dabholkar. ANI",
"time_scraped": "2018-08-20 03:51:38.200602",
"article_id": "4994041",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Untitled-design-163.jpg",
"path": "full/ded044225fd58e8f8f9a3d7213683b182c229399.jpg",
"checksum": "906bc41e9c74244923b9ef118914d0e6"
}
]
}