{
"source_article_link": "https://www.firstpost.com/mumbai/dawood-ibrahims-finance-manager-detained-in-london-jabir-moti-is-said-to-be-custodian-of-fugitive-dons-dark-secrets-4994221.html",
"title": "Dawood Ibrahim's finance manager detained in London; Jabir Moti is said to be custodian of fugitive don's dark secrets",
"date_published": "2018-08-19T12:04:28+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Jabir-Moti_ANI_380.jpg"
],
"article_body": "London: The law has moved a step closer to bringing Dawood Ibrahim to justice for the 1993 Mumbai Serial Bomb blasts with the detention of his finance manager and custodian of his dark secrets, Jabir Moti from London's Hilton Hotel. #FLASH : Key Dawood Ibrahim aide Jabir Moti detained by UK security agencies in London. Moti is a Pakistani National and is believed to be in charge of D-Company finances. pic.twitter.com/B0dXZUZ6Jw — ANI (@ANI) August 19, 2018 In what is clearly a major achievement for the London police Jabir was detained after meticulous work by the London Police on investigating the financial links leading from Jabir Moti to Dawood, his wife and other close members of his family in Karachi and Dubai. File image of Jabir Moti. ANI Jabir, a Pakistani national, holds a ten-year visa to the UK and shares common financial interest with Dawood's wife Mehajabeen, his son Moeen Nawaz and his daughters Mahrookh, Mehreen and his sons-in-law, Junaid (son of former Pakistan Cricketer Javed Miandad) and Aurangazeb. Dawood's youngest daughter Mazia is unmarried. Jabir is involved in investment in Dawood's businesses which spans across Pakistan and areas covering the Middle East, the UK and Europe, Africa and countries of Southeast Asia. Sources reveal that Dawood's earnings from these businesses and other unlawful activities like illegal arms business, narcotics trade, extortion rackets and real estate business are used for financing terrorists to carry out anti-India operations. Jabir is playing a key role in actively exploring the option of movement of Dawood Ibrahim's family to the UK. He himself owns property in the residential compound owned by Dawood's family in Karachi. Of late, Jabir was also looking for dual nationality status in Barbados and Antigua and Dominican Republic and a Permanent Resident status in Hungary. Dawood is a Specially Designated International Terrorist (SDGT), who have masterminded the March 1993 bombings in Mumbai, killings some 250 people. He is wanted on the charges of murder, extortion, targeted killing, drug trafficking, terrorism and various other cases. The present round of detention of his close aide, Jabir Moti in the UK for questioning is expected to yield vital information on the activities of the D Company members in the UK hither to kept under wraps, and the imminent danger the 'D Company' poses to the UK, in particular and Europe in General.",
"description": "London: The law has moved a step closer to bringing Dawood Ibrahim to justice for the 1993 Mumbai Serial Bomb blasts with the detention of his finance manager and custodian of his dark secrets, Jabir Moti from London's Hilton Hotel. #FLASH : Key Dawood Ibrahim aide Jabir Moti detained by UK security agencies in London. Moti is a Pakistani National and is believed to be in charge of D-Company finances. pic.twitter.com/B0dXZUZ6Jw",
"time_scraped": "2018-08-20 03:51:40.399933",
"article_id": "4994221",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Jabir-Moti_ANI_380.jpg",
"path": "full/2316687ceb2c75abe431bc7575f7ec7ccab2d57d.jpg",
"checksum": "d93386fb64e41c6d455a6b12b769b187"
}
]
}