{
"source_article_link": "https://www.firstpost.com/india/rahul-gandhi-forms-six-member-congress-task-force-to-expose-rafale-deal-ahead-of-2019-general-elections-4994661.html",
"title": "Rahul Gandhi forms six-member Congress task force to 'expose' Rafale deal ahead of 2019 general elections",
"date_published": "2018-08-19T11:22:18+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/07/Rahul-Gandhi-in-Mysuru_380_Twitter-at-INCIndia.jpg"
],
"article_body": "New Delhi: Congress president Rahul Gandhi has constituted a six-member task force to look into the alleged Rafale scam, ahead of the 2019 general elections. The party has prepared a strategy to expose the 'scam'. File image of Congress president Rahul Gandhi. Twitter@INCIndia According to sources, the task force members have been personally selected by the party president. It will be headed by senior Congress leader Jaipal Reddy and supervised by national spokesperson Randeep Surjewala. Other members in the task force include Arjun Modhwadia, Shakti Singh Gohil, Priyanka Chaturvedi, Jaiveer Shergill and Pawan Khera. The task force will aim at building a narrative against the Bharatiya Janata Party (BJP) based on the allegations against the deal. Besides this, 50 Congress leaders will be assigned to hold conferences on the deal in 100 cities across the country. The Congress has repeatedly attacked the BJP on the Rafale deal on several occasions. At a rally in Hyderabad on 14 August, Rahul said that he was willing to engage in a debate with Prime Minister Narendra Modi on the alleged scam. The Centre has, however, rubbished the Congress' allegations saying that the party was only trying \"to malign the image of the ruling party\". \"All allegations being leveled in various press conferences are already answered on the floor of Parliament. A recent attempt, in the House, to malign the government through baseless charges collapsed. Today's was yet another attempt at repeating fabricated facts,\" defence minister Nirmala Sitharaman tweeted on 9 August. In 2008, India had signed a deal with France based to purchase 36 Rafale jets, which is slated to be one of the world's biggest military procurement in recent history and could cost the Indian government 15 billion dollars.",
"description": "New Delhi: Congress president Rahul Gandhi has constituted a six-member task force to look into the alleged Rafale scam, ahead of the 2019 general elections. The party has prepared a strategy to expose the 'scam'. File image of Congress president Rahul Gandhi. Twitter@INCIndia According to sources, the task force members have been personally selected by the party president. It will be headed by senior Congress leader Jaipal Reddy and supervised by national spokesperson Randeep Surjewala. Other members in the task force include Arjun Modhwadia, Shakti Singh Gohil, Priyanka Chaturvedi, Jaiveer Shergill and Pawan Khera. The task force will aim at building a narrative against the Bharatiya Janata Party (BJP) based on the allegations against the deal. Besides this, 50 Congress leaders will be assigned to hold conferences on the deal in 100 cities across the country.",
"time_scraped": "2018-08-20 03:51:29.706728",
"article_id": "4994661",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/07/Rahul-Gandhi-in-Mysuru_380_Twitter-at-INCIndia.jpg",
"path": "full/f9a117a6d5db72926886ca655e621b56f04515d8.jpg",
"checksum": "a6df4ad52981e9bc9440e2aa951b9cd4"
}
]
}