{
"source_article_link": "https://www.firstpost.com/india/on-world-photography-day-an-exhibition-of-vintage-cameras-and-portraits-offer-glimpse-into-a-life-in-exile-4994611.html",
"title": "On World Photography Day, an exhibition of vintage cameras and portraits offer glimpse into a life in exile",
"date_published": "2018-08-19T19:30:55+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-6.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-3.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-11.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-8.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-2.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Archive-Foundation-BKD-ARCHIVE-3.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-12.jpg"
],
"article_body": ": is an exhibition of photographs, postcards, records, letters and notes dating back over a century. How was all this material sourced? Isha: It belonged to family archives passed down through my great-grandmother Bhuban Kumari Devi. They were in disrepairuntil we joined forces with Aditya Arya of the India Photo Archive Foundation who helped us with the very tedious task of restoration and archiving. Bhuban Kumari Devi with her mother-in-law in a mid-19th-century gothic chair. All photos courtesy: India Photo Achive Foundation and BKD Archive What was the process of archiving, digitising, preserving, curating and documenting all this material for the exhibition? Aditya: Going through old albums and photography collections is very similar to an archeological dig… where you look for all the possible leads and clues to the photographic processes and materials used. Based on this information, the process of intervention for preservation is planned accompanied by archiving and digitising of the images and negatives. Princess Budhimati Can you tell us more about Dev Shumsher Rana and his life in exile? Isha: He was liberal compared to his contemporaries — he tried to abolish female slavery, started a newspaper to be the voice of the people, and tried to introduce a constitutional monarchy. How does the exhibition recreate some complexities of the time through narratives about costume, jewellery and entertainment customs? Isha: We have a variety of images of women dressed in clothes and jewellery of the time. You can see fabulous furniture, and in one section, a whole collection of images with people partying in fantastic costumes in the great ballrooms of the time. One can even see how clothes get less “costumey” as time passes. With each decade, some formality is lost and clothing becomes simpler, less ritualistic, less courtly. This to us really captures the idea of a life in exile, losing that connect with the demands of a life in a royal court. Dev Shumsher died a broken manbecause he wasn’t allowed back to the country of his birth. Indra Kumari Devi What are some of the anecdotes and idiosyncrasies about the people told through the exhibition? Isha: There aren’t really any. We aren’t telling any stories, we are just showcasing images — and the stories are for the viewer to make up as they move through the exhibition. The main story is of Dev Shumsher Rana and of his move to India, and then of his and his family’s life in exile. We hope with this exhibition more stories come out and we can collate them in one place. Bhuban Kumari Devi, daughter of Dev Shumsher Rana The exhibition will also have a special experiential photo studio to transport viewers to the studios of early 1920’s and 30’s. Tell us more about this. Aditya: A period daylight studio is being planned. Nineteenth-century photographic studios relied on daylight for illumination. To capture as much light as possible and keep exposure times to a minimum, they had glass roofs and walls. Moveable blinds and curtains allowed the photographer to control the amount and direction of light. Dev Shumsher Rana with his wife You have been collecting antique cameras for more than 35 years. Tell us more about this three-decade-long journey. Aditya: It’s been my great love for almost 40 years now — The art of photography, the science of image making, the endless possibilities that technological changes have brought (and taken away from) us. Many of my generation who started off as die-hard analogue buffs have had a long and exciting journey traversing from silver grains to storage devices, film rolls to memory cards, and formats measured in millimetres to images described in megapixels. Budhimati with her sister Can you talk about The Museo Camera and the wide variety of cameras displayed there? Aditya: The Museo Camera in Gurugram houses a rare collection of antique cameras that date back to the 19th century when photography was formally introduced. A rigorously modern museum that celebrates both, the art and science of photography, it exhibits antique cameras from over 100 countries (including England, France, Germany, Japan, America and Switzerland, to name a few), photographic equipment down the ages, historical archives, the works of legends and cutting-edge contemporary art based on photography. It is a centre where the young and the old, amateurs and aficionados, visitors and tourists have the rare opportunity to learn and experience the magic of photography, and through it, to explore the arts, ideas and issues of our time. The Museo Camera has grown out of my personal collection and is supported by the India Photo Archive Foundation, a public charitable trust. Since it was founded in 2009, it has already enthralled thousands of visitors from India and abroad at the modest basement where it has been housed so far, and at international events like the CEIF Photofair and the Delhi Photo Festival. It has even featured on the list of the in Gurugram. Today, it is poised to be up-scaled as a full-fledged museum for the photographic arts, at a brand new site granted by the government of Haryana. My vision is for it to be a unique, citizen-funded cultural institution like India has never seen before. Princess Padmini On the occasion of World Photography Day, what according to you, is the significance of vintage photographs in contemporary times? Aditya: Vintage photographic processes are all about slowness accompanied by lots of pre-visualisation and the art of seeing that it is important to slow down. I feel the born digital generation spends more time deleting than pre-planning for perfect moments. Three sisters: Budhimati, Bhuban and Madalshah What can the younger generation learn from old collections like these in this day and age of Facebook photos and Instagram feeds? Aditya: Heritage is explained in UNESCO documents as “our legacy from the past, what we live with today, and what we pass on to future generations.” A heritage is something that is, or should be, passed from generation to generation, because it is valued. Photographs are an essential part of our cultural heritage. They are to be treasured for what they tell us about our past, for their documentary and artistic value, and as a record of the history of photographic processes.",
"description": ": is an exhibition of photographs, postcards, records, letters and notes dating back over a century. How was all this material sourced? Isha: It belonged to family archives passed down through my great-grandmother Bhuban Kumari Devi. They were in disrepairuntil we joined forces with Aditya Arya of the India Photo Archive Foundation who helped us with the very tedious task of restoration and archiving. Bhuban Kumari Devi with her mother-in-law in a mid-19th-century gothic chair. All photos courtesy: India Photo Achive Foundation and BKD Archive",
"time_scraped": "2018-08-20 03:51:41.457553",
"article_id": "4994611",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-6.jpg",
"path": "full/d93b63922f2d443d691ce66d8c0e6aac23af43bc.jpg",
"checksum": "c06e4742be910739c2d6b42491f90318"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-.jpg",
"path": "full/7300e39c8a58a0828b7db5bf1e8df53b947b10ee.jpg",
"checksum": "17b5b11b369efbe984f9a9c665af5b22"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-3.jpg",
"path": "full/f0878ad2f8e90f20d98ebdf6ec16df8744e223f1.jpg",
"checksum": "c92175801c1fae6ca43335274347f7cb"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-11.jpg",
"path": "full/517dd4ce72cff213ab34a767c120564018f537cf.jpg",
"checksum": "113faf6ea7771aa7df68762a23b9514e"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-8.jpg",
"path": "full/ff81fbacd3e414f408e80031e11cfd9ff0f4915e.jpg",
"checksum": "e648aa0c7a805c7b7572dc013c3ceee3"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-2.jpg",
"path": "full/c68692cc045f6b0591eeb3a4e662e019c8b5043e.jpg",
"checksum": "fa2860adde51f21e4a99968636662b90"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Archive-Foundation-BKD-ARCHIVE-3.jpg",
"path": "full/df4f754a802d1c247414e0d56bc6c3fa48825a98.jpg",
"checksum": "6962a223d068d325f98b945b66047542"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Copyright-India-Photo-Achive-Foundation-BKD-ARCHIVE-12.jpg",
"path": "full/6b522ca74f092897ef73b0c5fa2b71e2e6b424f6.jpg",
"checksum": "e732ff8b328527fae5b65b8f372934c7"
}
]
}