{
"source_article_link": "https://www.firstpost.com/india/navjot-singh-sidhu-may-have-overreacted-by-hugging-pakistan-army-chief-but-not-all-controversies-were-his-own-making-4995471.html",
"title": "Navjot Singh Sidhu may have overreacted by hugging Pakistan army chief, but not all controversies were his own making",
"date_published": "2018-08-19T16:05:22+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2013/07/Sidhu-Reuters.jpg"
],
"article_body": "Cricketer-turned-politician Navjot Singh Sidhu loves to court controversies but the latest one, pertaining to his Pakistan visit to attend Imran Khan’s swearing-in ceremony as the Prime Minister of Pakistan, has more to do with actions beyond his control. Sidhu, now a Cabinet minister of Punjab, had duly sought clearance from the Centre to be present at the ceremony even though two other invitees, former cricket captains Sunil Gavaskar and Kapil Dev, refrained from accepting the invitation. For a government whose head, Prime Minister Narendra Modi had paid an impromptu visit to Pakistan to greet his then counterpart Nawaz Sharif, it didn’t seem a big deal. Yet Sidhu landed himself directly in a controversy by hugging Pakistan army chief General Qamar Javed Bajwa twice at the function. Later talking to the media the Congress leader said that while General Bajwa had walked to greet and hug him, he had reciprocated the gesture when he was informed by General Bajwa about a sentimental gesture proposed for the Sikhs. #WATCH : Navjot Singh Sidhu meets Pakistan Army Chief General Qamar Javed Bajwa at #ImranKhan 's oath-taking ceremony in Islamabad. pic.twitter.com/GU0wsSM56s — ANI (@ANI) August 18, 2018 The gesture was the proposal to provide free access to Sikh devotees to a historic gurdwara just three kilometres inside Pakistan. The gurdwara called Gurdwara Kartarpur Sahib near Gurdaspur, is one of the holiest of holy shrines for the Sikhs as Guru Nanak Dev, their first guru, had spent his last days in that particular Gurdwara. His 550th birth anniversary falls next year and Sikhs have been demanding a free corridor to enable them to pay obeisance. Navjot Singh Sidhu. Reuters Sidhu said he was not expecting the announcement of such a gesture and spontaneously hugged General Bajwa for it. He told Pakistan media: “Imran Khan, my dear friend, has said they will walk two steps if one step is taken by India. I will make efforts to convince authorities in India to take that first step. Both the Punjabs can earn great profit by opening borders,” he said. The BJP has, however, gone hammers and tongs after its former four-time Member of Parliament. Party spokesman Sambit Patra, demanding Sidhu’s suspension from Congress, said, :It is not an ordinary thing. Sidhu is not an ordinary man but a minister in the Punjab government. Every Indian has taken this issue very seriously.\" Patra also asked whether Sidhu had taken permission from his party chief Rahul Gandhi for the same. BJP's Punjab chief, Shwet Malik described his visit and gestures as \"anti-national\" and sought action against the Congress leader. Shiromani Akali Dal, which had been having a running battle with Sidhu, said his conduct was \"unbecoming of a minister\". In a statement, SAD spokesperson Dr Daljit Singh Cheema said Sidhu’s \"public gestures have not only hurt martyrs' families but also countrymen in general\". Even the Congress has sought to disassociate itself from the visit saying it was a personal visit by a friend of Imran Khan. Political observers, however, point out that condemnation from the BJP is uncalled for because Sidhu, as a legislator, was supposed to seek permission from the Union government and that he was duly given that permission. In fact, the permission is also seen as a gesture of willingness of the government to keep channels of communications open with Pakistan and to build bridges. It's pointed out that at the worst of crisis, like the Kargil War, the 2001 Indian Parliament Attack and the surgical strikes, channels of communication were kept open. Sidhu, given his history of being a child of controversies, perhaps over-reacted to the gesture of General Bajwa, but not all the controversies relating to his Pakistan visit were made of his own. Even as the BJP reacted violently to Sidhu hugging the Pakistan Army chief, what appears to be a deliberate slight to him and the country was to seat him next to the ‘president’ of the Pakistan Occupied Kashmir Masood Khan in the front row for the swearing-in ceremony. It is well known that India does not regard POK as a part of Pakistan and that it remains a disputed territory, the seating arrangement (which is done meticulously keeping in mind protocol and other considerations) does not appear above board. Critics have pointed out that Sidhu could have been seated with foreign dignitaries or with Imran's other cricket friends. Whether it was deliberate or not would be debated among the foreign policy experts, but the controversy was avoidable at the swearing-in of the new government which is a class apart from the recent political history of the country dominated by Pakistan People’s Party and Pakistan Muslim League — Nawaz.",
"description": "Cricketer-turned-politician Navjot Singh Sidhu loves to court controversies but the latest one, pertaining to his Pakistan visit to attend Imran Khan’s swearing-in ceremony as the Prime Minister of Pakistan, has more to do with actions beyond his control. Sidhu, now a Cabinet minister of Punjab, had duly sought clearance from the Centre to be present at the ceremony even though two other invitees, former cricket captains Sunil Gavaskar and Kapil Dev, refrained from accepting the invitation. For a government whose head, Prime Minister Narendra Modi had paid an impromptu visit to Pakistan to greet his then counterpart Nawaz Sharif, it didn’t seem a big deal. Yet Sidhu landed himself directly in a controversy by hugging Pakistan army chief General Qamar Javed Bajwa twice at the function. Later talking to the media the Congress leader said that while General Bajwa had walked to greet and hug him, he had reciprocated the gesture when he was informed by General Bajwa about a sentimental gesture proposed for the Sikhs. #WATCH : Navjot Singh Sidhu meets Pakistan Army Chief General Qamar Javed Bajwa at",
"time_scraped": "2018-08-20 03:51:23.125754",
"article_id": "4995471",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2013/07/Sidhu-Reuters.jpg",
"path": "full/e4941b9c5aa479f838eb2b482a9478a8fbbaf1a0.jpg",
"checksum": "3b12e73a6e44798f8ce4c6016828eb21"
}
]
}