{
"source_article_link": "https://www.firstpost.com/india/karnataka-floods-heavy-rains-cause-floods-landslides-in-kodagu-over-800-rescued-from-flood-hit-district-4995561.html",
"title": "Karnataka floods: Heavy rains cause floods, landslides in Kodagu; over 800 rescued from flood-hit district",
"date_published": "2018-08-19T14:39:25+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2017/08/Floods_Bihar_PTI5.jpg"
],
"article_body": "Bengaluru: Heavy rain leading to landslides and flooding continued to lash Karnataka's Kodagu district, chief minister HD Kumaraswamy said on Saturday. \"Rains have been causing massive damage in Kodagu. The state officials, along with Indian Army troops, Navy divers are carrying out rescue and relief operations on war-footing,\" Kumaraswamy told reporters in Bengaluru. Representational image PTI Kodagu is one of the districts in the southern state worst hit by the south-west monsoon rains since June first week. The landslides and heavy rain have claimed six lives in the district since Thursday, the Chief Minister's Office (CMO) said. According to the Karnataka State Natural Disaster Monitoring Centre (KSNDMC), the district received a maximum rainfall of up to 25.3 cm and an average rainfall of 11.9 cm over the past 24 hours. Located in the Western Ghats mountain ranges, the incessant rain has been causing landslips across the region, making rescue operations difficult. According to local media, hundreds of people remain stranded on various hills of the district. Telecom services, disrupted due to the rain and strong winds uprooting poles and snapping phone lines, are being restored on priority, Kumaraswamy said. \"About 60 Dogra Regiment soldiers and 12 expert naval divers rescued 873 marooned people in the flood-hit district, where overnight heavy rain caused landslides and inundated low-lying areas at Makkanduru,\" a statement from the CMO said on Friday night. The Army's engineering task force deployed 73 boats, equipment and rafts in rescuing the people and escorting them to safer places in the district. About 60 members of the national and state disaster relief forces and 45 members of the civil defence joined the rescue and relief operations with boats and equipment in Madikeri in the hilly district. The Indian Air Force, which could not airlift stranded people through chopper in the district due to inclement weather till Friday, is working to rescue people and transport relief materials, the CMO said. Kumaraswamy has also requested Union Defence Minister Nirmala Sitharaman to deploy additional military forces in Kodagu for rescue operations. So far, the district administration has housed 573 people in 17 relief camps. Schools and colleges have remained closed in the affected areas of Kodagu, Udupi, Dakshina Kannada, Chikkamagaluru and Hassan districts due to the rains. The South Western Railway (SWR) has cancelled its train services from Bengaluru towards Kannur and Ernakulam in flood-hit Kerala due to landslips and flooding. State-run Karnataka State Road Transport Corporation (KSRTC) has also suspended several of its inter-state and intra-state bus services towards Kerala, owing to the flooded roads. The Bengaluru division of the India Meteorological Department (IMD) predicts that heavy rain will continue over the next two days in the coastal and south interior districts of the state, including Kodagu.",
"description": "Bengaluru: Heavy rain leading to landslides and flooding continued to lash Karnataka's Kodagu district, chief minister HD Kumaraswamy said on Saturday. \"Rains have been causing massive damage in Kodagu. The state officials, along with Indian Army troops, Navy divers are carrying out rescue and relief operations on war-footing,\" Kumaraswamy told reporters in Bengaluru. Representational image PTI Kodagu is one of the districts in the southern state worst hit by the south-west monsoon rains since June first week. The landslides and heavy rain have claimed six lives in the district since Thursday, the Chief Minister's Office (CMO) said. According to the Karnataka State Natural Disaster Monitoring Centre (KSNDMC), the district received a maximum rainfall of up to 25.3 cm and an average rainfall of 11.9 cm over the past 24 hours.",
"time_scraped": "2018-08-20 03:51:34.869351",
"article_id": "4995561",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2017/08/Floods_Bihar_PTI5.jpg",
"path": "full/1839dd2dc1878de1f25c20b25acda13d48fff46d.jpg",
"checksum": "bfbef194c1ca0050ee68af2b969f706f"
}
]
}