{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-calicuts-kakkodi-is-a-story-of-resilience-survival-as-locals-help-each-other-get-back-on-their-feet-4995431.html",
"title": "Kerala floods: Calicut's Kakkodi is a story of resilience, survival as locals help each other get back on their feet",
"date_published": "2018-08-19T15:05:46+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Vijayan-House.png"
],
"article_body": "Editor's note multi-part series They say it takes a village. The saying deems fit for the survival story of Kakkodi panchayat in Calicut. While various parts of central Kerala are still battling the ongoing flood, Calicut has started seeing sunnier days. The water levels are coming down and people are gradually trying toresume their normal lives. With heavy rains and discharge from the Kakkeyam Dam in the last few days, Kakkodi panchayathas witnessed its share of flooding and chaos. But with the help of the local community, the situation was in control before things got out of hand. “The challenge now is cleaning up the mess,” said Mujeeb, a volunteer at Daya Centre, a charitable trust in Morikkara. Mujeeb was busy sending his boys off to various houses with clean drinking water. \"Drinking water is a major issue too as all the wells are contaminated and there is no electricity. There is still water in many houses, which will hopefully come down soon,\" Mujeeb said. Vijayan's house in Kakkodi is still in the process of being cleaned. Image courtesy: Ramees Abdurehim Mujeeb added thatcollective effortby the panchayat, local associations, organisations and clubs helped keep panic at bay. They were able to rescue everyone on time and help locals get back on their feet. Meanwhile, around 100 more volunteers are coming into Kakkodi to help with the cleaning and distribution of water and food. \"As soon as the water started reaching our front yard, we left our home, \" said Kakkodi resident Vijayan whowas using the stagnant water around his house to wash away the mud at home. \"We started cleaning at 6.00 am today, it has been 12 hours since and we are just finishing,\" Vijayan added. Safiya, who had just returned from the camp was waiting with a bucket and a broom forother people around her. \"I am all alone here, my husband was bittenby a snake when the water startedseeping in. We were stuck upstairs. The rescue boat came in the nick of time and they had to lower him down in a chair into the water,\" Safiya said. \"We had a lot of chicken and ducks, they all died. Now cleaning all this will be a week load of work,\" Safiya added. \"We never expected so much water to enter the houses, the people around had come in the beginning to put everythingat a higher level, but thewater was so much that everything was destroyed including our Aadhaar, passports and other documents. We will get another copy of it right?’ She asked. Unlike Safiya, Prabhija was calmer. \"We came back today morning. The cleaning is finallydone. Now once the waterlevel has gone down at the front yard, that also will be cleaned,\"Prabhija said. However, the relief did not come easy. \"We didn’t go to the relief camp, nine of us stayed for three days at a two-storey house nearby. On the first day, we were very hopeful, but the second day when the water level rose, we were terrified. The helplines we called asked us to stay calm and said that the water level is decreasing. We kept marking the level of water continuously and by night we realised that it was decreasing and decided to stay back,\" Prabhija said. Although the mudhas been away from most of the houses, there is no count on the losses the Kakkodi people incurred. Electronic goods, furniture, clothes were all carried off by the water. Many houses were completely destroyed by the gushing water and those near the river were severely hit. The panchayat is still calculating the exact losses. With enough help and resources collected from the local community, the panchayat was hopeful that they could provide a week worth of food and medical kit to the families hit by the flood. “There are around 600 people still in three relief camps in Kakkodi. There are no issues or problems here since the local people have extended their full support to help restore things back,” said panchayat president KK Choyikutty. Quick rescue, people leaving for camps as soon as the water started pouring in and the all-round help by the locals during the flood was the reason why Kakkodi did not witness a major disaster like the rest of Kerala. \"We tried our level best to stay here during the flood, but when the water kept rising, we saw that we had to leave. Now all our things are destroyed, but at least we have our life back, said Shobana who was locking up her now cleanbut empty home to return to the relief camp as the sun started setting.",
"description": "Editor's note multi-part series They say it takes a village. The saying deems fit for the survival story of Kakkodi panchayat in Calicut. While various parts of central Kerala are still battling the ongoing flood, Calicut has started seeing sunnier days. The water levels are coming down and people are gradually trying toresume their normal lives. With heavy rains and discharge from the Kakkeyam Dam in the last few days, Kakkodi panchayathas witnessed its share of flooding and chaos. But with the help of the local community, the situation was in control before things got out of hand. “The challenge now is cleaning up the mess,” said Mujeeb, a volunteer at Daya Centre, a charitable trust in Morikkara. Mujeeb was busy sending his boys off to various houses with clean drinking water. \"Drinking water is a major issue too as all the wells are contaminated and there is no electricity. There is still water in many houses, which will hopefully come down soon,\" Mujeeb said.",
"time_scraped": "2018-08-20 03:51:32.694212",
"article_id": "4995431",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Vijayan-House.png",
"path": "full/23cc6254b78be94a342c45faf9c105b4104425bb.jpg",
"checksum": "bf5a3da3ce7d6f9c90f0baffe384234a"
}
]
}