{
"source_article_link": "https://www.firstpost.com/india/winds-of-change-blow-in-uttar-pradeshs-nat-purwa-village-where-prostitution-is-tradition-source-of-income-for-families-4996551.html",
"title": "Winds of change blow in Uttar Pradesh's Nat Purwa village where prostitution is tradition, source of income for families",
"date_published": "2018-08-19T19:07:48+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Nat-Purwa.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/A-skill-development-centre-set-up-by-an-NGO-in-the-village.-By-Saurabh-Sharma..jpg"
],
"article_body": "Editor's Note: National Crime Records Bureau Read the series here. *** Nat Purwa, Hardoi: \" …,\"says Hariya, as he hagglesquite animatedly with two men, who appear to be in an inebriated state.This goes on for a while until one of the two men reluctantly takes out a crisp Rs 500 note from his pocket and hands it to Hariya, a man in his 30s seated at the entrance of his thatched hut. \"Don't you dare beat her or bite her. Else, I will break your legs,\" he says as he pockets the amount and glares at the duo. At this moment, Hariya's sister Mamta (name changed) steps out of the hut, gestures to the men to follow her and goes back inside. A few metres away, outside another hut, a similar deal is being struck. The other man is not as hard a bargainer as Hariya, since his efforts seemed to have earned him only Rs 300 from his customer. In the village of Nat Purwa in Uttar Pradesh's Hardoi district, it is business as usual. An activist is trying to get the name of the village changed from Nat Purwa to Om Purwa. Image Courtesy: 101Reporters/Saurabh Sharma A 400-yr-old tradition With a population of around 5,000, located 72 kilometres from Lucknow, Nat Purwa has a long history of prostitution. Here, prostitution is a hereditary occupation, passed down from one generation to the next. Residents of the villagesay that the practice dates back over 400 years and has now become an integral part of the family economy, with the men in the family acting as pimps. Hariya's sister, who is in her late 20s, says she was pushed into \"this abyss\"when she was barely 15. \"Young girls in the village are brought up to become prostitutes,\" Mamta says. \"They are the breadwinners of the family. I followed my mother and grandmother into the family trade. Initially, bringing money home seemed exciting, but there is a darkness in this profession that no one talks about.\" \"There were times when my customers abused me, some physically. There is barely anything or anybody to protect us except our menfolk, but people also know that the best they can do is give empty threats,\" she says. Like Mamta, many girls in the village are involved in sex work, but things are changing with the new generation. More girls, including Mamta's younger sister, have started attending a primary school in the area. \"My life may be ruined, but I won't let my sister endure what I had to,\" Mamta says. \"She is in primary school. I plan to send her away from the village soon. I'm secretly saving up for her.\" Turning over a new leaf Chandralekha, a former sex worker-turned-social worker from Nat Purwa who teaches at the primary school, says that many women are now resisting this practice as they have been getting help from NGOs and the administration for the past few years. \"NGOs and social activists are raising awareness against the ills of prostitution. They have tried to get girls married, and a few have even taken up tailoring,\" Chandralekha says. Social activist and Magsaysay Award-winner Sandeep Pandey opened NGO ASHA a decade ago to teach skill development to the women in Nat Purwa.\"Women are ready to abolish the trade if they have an alternative,\" he said. \"We had opened a tailoring centre in the village, which became a sort of community initiative. There was problem with space, so we ran the centre at homes on rotation. Later, the village (chief) offered us a hall to run the centre. Sessions were also conducted to encourage women to think of alternatives and get out of their regular trade.\" Pandey gives Chandralekha the credit of bringing about much of the change in the attitudes of people in the village. Chandralekha now has her heart set on giving the village a new identity by making efforts to get its name changed from Nat Purwa to Om Purwa. A skill development centre set up by an NGO in Nat Purwa. Image Courtesy: 101Reporters/Saurabh Sharma A village of \"bastards\" Nat Purwa takes its name from the Nat community. The Nats were once performers, including dancers, acrobats, jugglers and magicians. With the performing arts becoming less lucrative by the day, abject poverty forced them into prostitution. Residents say Nat Purwa has come to be known as a \"village of bastards\". \"In Nat Purwa, you will not find children carrying surnames because the mother does not know who the father is. So the village is known as the village of bastards,\" Chandralekha explains. NGO workers in the village often have to face stiff opposition from families unwilling to let go of a tradition entrenched in their customs and history.But more than that, flesh trade has become a means of survival for families in the region. While the village is surrounded by lush green fields, farming is not an option as the land is owned by a select few who do not live in the village. Children and women's rights activist Paras Naresh said that apart from the Nats, many other tribes have traditionally practised prostitution. \"Like the Nats in Utttar Pradesh, there are Bacchhdas and Bediyas in Madhya Pradesh. Prostitution is among the oldest professions in the world. Education and providing alternative employment can help women quit the trade,\" he said. Mamta says that some evenings, when women in the village gather, there is now talk of a future where their daughters are not part of the flesh trade. Many girls in Nat Purwa now dream of work that will give them respect and hopefully, a husband and family. \"I wanted to get married once, but who will marry me? These girls may still have a chance,\" she says. 101Reporters.com",
"description": "Editor's Note: National Crime Records Bureau Read the series here. *** Nat Purwa, Hardoi:",
"time_scraped": "2018-08-20 03:51:29.912070",
"article_id": "4996551",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Nat-Purwa.jpg",
"path": "full/c8022096eaa04c349b1e03f836f7067da134f665.jpg",
"checksum": "69db57bea56d2b593426db5468ae06d0"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/A-skill-development-centre-set-up-by-an-NGO-in-the-village.-By-Saurabh-Sharma..jpg",
"path": "full/21b7557db464afb706c10bd9e8eccfb0ba4d53af.jpg",
"checksum": "36cf78e57776795d3d16afa13228f047"
}
]
}