{
"source_article_link": "https://www.firstpost.com/india/narendra-dabholkar-murder-cbi-detains-ex-shiv-sena-corporator-shrikant-pangarkar-after-interrogating-key-accused-4996351.html",
"title": "Narendra Dabholkar murder: CBI detains ex-Shiv Sena corporator Shrikant Pangarkar after interrogating key accused",
"date_published": "2018-08-19T17:50:03+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2013/08/NarendraDabholkar_AP_NEW2.jpg"
],
"article_body": "Aurangabad: A former Shiv Sena corporator has been detained in connection with the killing of anti-superstition activist Narendra Dabholkar in Maharashtra's Jalna district,Central Bureau of Investigation (CBI) sources said on Sunday. File Image of Anti-superstition activist Narendra Dabholkar. AP Shrikant Pangarkar, a former member of the Jalna Municipal Corporation, was detained on Saturday night by the CBI after interrogation of Sachin Prakasrao Andure, the alleged main shooter in the Dabholkar murder case, they said. Andure, a resident of Aurangabad in central Maharashtra, was arrested in Pune on Saturday evening, said a CBI spokesperson on Saturday. Pangarkar, aged around 40, was taken into custody after Andure told the CBI that he was with him at the time of Dabholkar's murder, the sources said. The former corporator was allegedly riding pillion on the motorcycle driven by Andure, they said. Dabholkar, 67, was shot dead by two motorcycle-borne assailants on 20 August, 2013, when he was on a morning walk near his home in Pune. Andure, who works as a salesman in a garment shop in the Nirala Bazaar area of Aurangabad, is believed to be one of the shooters who fired at Dabholkar, the CBI spokesperson had said on Saturday. He was arrested on a tip-off from the Maharashtra Anti-Terrorism Squad (ATS), which had last week arrested three persons for allegedly hatching a conspiracy to carry out blasts in the state. One of the arrested accused gave the input about Andure's involvement in Dabholkar's murder, which the ATS shared with the CBI, the spokesperson said. The murder case was transferred to the CBI from the Pune Police in 2014.",
"description": "Aurangabad: A former Shiv Sena corporator has been detained in connection with the killing of anti-superstition activist Narendra Dabholkar in Maharashtra's Jalna district,Central Bureau of Investigation (CBI) sources said on Sunday. File Image of Anti-superstition activist Narendra Dabholkar. AP Shrikant Pangarkar, a former member of the Jalna Municipal Corporation, was detained on Saturday night by the CBI after interrogation of Sachin Prakasrao Andure, the alleged main shooter in the Dabholkar murder case, they said. Andure, a resident of Aurangabad in central Maharashtra, was arrested in Pune on Saturday evening, said a CBI spokesperson on Saturday. Pangarkar, aged around 40, was taken into custody after Andure told the CBI that he was with him at the time of Dabholkar's murder, the sources said.",
"time_scraped": "2018-08-20 03:51:29.882002",
"article_id": "4996351",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2013/08/NarendraDabholkar_AP_NEW2.jpg",
"path": "full/fe2f4a54297454cef9d9b5515f6bf92eaf2b2b0a.jpg",
"checksum": "a46056a9f2655a2e4199b0c97c94efcb"
}
]
}