{
"source_article_link": "https://www.firstpost.com/india/uae-reaching-out-to-kerala-amid-devastating-floods-highlights-north-indias-apathy-even-more-4996151.html",
"title": "UAE reaching out to Kerala amid devastating floods highlights North India's apathy even more",
"date_published": "2018-08-19T17:21:17+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/AP18230455383876-380.jpg"
],
"article_body": "For once, Rahul Gandhi may have got it right. It's time to declare the Kerala floods a \"national disaster\". As much as the Rs 500-crore relief package is welcome, there is still more interest in Delhi's social circles, and even in cricketer-turned-politician Navjot Singh Sidhu hugging Pakistan Army chief General Qamar Javed Bajwa at Imran Khan's inauguration as the prime minister, than in the plight of the several million in Kerala facing the devastating floods. With water levels at reservoirs still at dangerous levels and fears of the situation getting worse, only now is it slowly seeping into the North Indian mindset that the southern state is in dire trouble. A truck carries people past a flooded road in Thrissur in flood-hit Kerala. AP It is ironical in this disconnect, with even the media unable to spark a \"Save Kerala, Help Kerala\" campaign, that there seems to be more concern and empathy displayed at the Gulf Cooperation Council enclave. Over3 million Malayalees work in the GCC members states, whereover 2,000 associations, groups and clubs represent them. The President of the United Arab Emirates (UAE), Khalifa bin Zayed Al Nahyan, has ordered a National Emergency Committee to ensure relief for the victims of the floods in Kerala. The Emirates Red Crescent has been asked to do its bit, as well. UAE vice president Mohammed bin Rashid Al Maktoum, who is also the ruler of the Emirate of Dubai, tweeted his support for a relief operation in Malayalam . He said: \"The people of Kerala have always been and always will be part of the success story in the UAE. We have a special responsibility to help and support those affected, especially during these holy and blessed days.\" The Minister of Cabinet Affairs of UAE, Mohammed Abdulla Al Gergawi, is in direct contact with Kerala chief minister Pinayari Vijayan and has given his team the task to respond to all requests for specific types of aid. Members of royal families in the UAE and politicians were not alone in calling for assistance for the flood-affected in Kerala. The Arab business fraternity has also felt the enormity of the situation. The Arab media, too, has been urging people to contribute to end the Kerala crisis, and television and radio stations have been sending out messages by the hour in multiple languages. Prime Minister Narendra Modi hasacknowledged thisunprecedented show of support from abroad. He tweeted: \"A big thank you to Sheikh Mohammed for his gracious offer to support people of Kerala during this difficult time. His concern reflects the special ties between the governments and people of India and UAE.\" A big thanks to @hhshkmohd for his gracious offer to support people of Kerala during this difficult time. His concern reflects the special ties between governments and people of India and UAE. — Narendra Modi (@narendramodi) August 18, 2018 However, theprime minister's gratitude cannot deflect from Delhi's nonchalance and the northern belt's slow response to the disaster. The floods in Kerala were underplayed, much like the 2016 deluge in Chennai, and the North's \"not-much-to-do-with-us\" attitude is profoundly questionable. In comparison, Mumbai has been far more hands on in gathering aid for Kerala, with as many as 46 centres set up to collect relief material. It is only now — more than a week after the flooding started — that Delhi has taken stock of the severity of the situation, and NGOs and professionals like lawyers, motivated by Justice Kurian Joseph, pitched in to help. While rescue efforts will pick up pace now, there are fears that Kerala will need more than a helping hand as the waters recede. Follow LIVE updates on the Kerala floods here.",
"description": "For once, Rahul Gandhi may have got it right. It's time to declare the Kerala floods a \"national disaster\". As much as the Rs 500-crore relief package is welcome, there is still more interest in Delhi's social circles, and even in cricketer-turned-politician Navjot Singh Sidhu hugging Pakistan Army chief General Qamar Javed Bajwa at Imran Khan's inauguration as the prime minister, than in the plight of the several million in Kerala facing the devastating floods. With water levels at reservoirs still at dangerous levels and fears of the situation getting worse, only now is it slowly seeping into the North Indian mindset that the southern state is in dire trouble. A truck carries people past a flooded road in Thrissur in flood-hit Kerala. AP It is ironical in this disconnect, with even the media unable to spark a \"Save Kerala, Help Kerala\" campaign, that there seems to be more concern and empathy displayed at the Gulf Cooperation Council enclave. Over3 million Malayalees work in the GCC members states, whereover 2,000 associations, groups and clubs represent them. The President of the United Arab Emirates (UAE), Khalifa bin Zayed Al Nahyan, has ordered a National Emergency Committee to ensure relief for the victims of the floods in Kerala. The Emirates Red Crescent has been asked to do its bit, as well.",
"time_scraped": "2018-08-20 03:51:30.282763",
"article_id": "4996151",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/AP18230455383876-380.jpg",
"path": "full/95a05b7f725a09d631a1123ea4ac160e45177238.jpg",
"checksum": "39ebb12add1278381cf72fef57977a06"
}
]
}