{
"source_article_link": "https://www.firstpost.com/india/tamil-nadu-chief-minister-edapaddi-palaniswami-visits-flood-hit-areas-in-state-assures-compensation-for-crop-loss-4996141.html",
"title": "Tamil Nadu chief minister Edapaddi Palaniswami visits flood-hit areas in state, assures compensation for crop loss",
"date_published": "2018-08-19T16:25:12+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/01/E-Palaniswami-380-PTI.jpg"
],
"article_body": "Bhavani: Tamil Nadu chiefministerEdapaddi Palaniswamion Sunday assured compensation for crop loss due to the floods caused by the heavy discharge of water from the state's dams and permanent houses for the affected people. The dams, including Mettur and Bhavanisagar, have been discharging huge volumes of water in view of continuing high inflows from Karnataka reservoirs like Krishnarajasagar. File image of Tamil Nadu chief minister Edappadi Palaniswamy. PTI The discharge has resulted in theinundation of a slew of villages and submergence of standing crops along the banks of Cauvery, (its tributary Bhavani in Erode) in several districts of Tamil Nadu. \"Presently, inflow into the Bhavanisagar dam is 21,000 cusecs and discharge is 3,000 cusecs. From the Mettur reservoir, the outflow is 2 lakh cusecs and the inflow is about 1.95 lakh cusecs,\" Palaniswami said. The chief minister, who was speaking to reporters after inspecting flood-affected areas in Erode district, said the government would disburse compensation for damaged crops proportionate to the extent of loss. \"The government will give compensation for crop damage after the flood waters recede,\" he told reporters. In Erode district, 47 villages and 609.69 hectares of crops, including horticulture, have been affected. Those residing along the banks of the rivers Bhavani and Cauvery have requested safe, permanent houses and government would take steps to fulfil their request, he told reporters when asked about the representation from the affected people. He said the government was extending all help to the people whose houses were damaged due to inundation caused by the release of excess waters from dams. As many as 7,832 people have been sheltered in relief centres in Erode district, 263 houses fully damaged and 114 partially damaged, while a total of 1,599 houses have been inundated, he said. A flood alert was sounded for 13 districts, including the Cauvery delta regions, besides Madurai and Theni as the Periyar and Vaigai dams too received copious inflows. The chief minister visited flood-affected in the town and at nearby Komarapalayam, along with ministers KA Sengottiyan, KC Karuppannan and MR Vijaya Baskar. The chief minister visited relief centres and distributed rice, vessels and blankets to the affected people.",
"description": "Bhavani: Tamil Nadu chiefministerEdapaddi Palaniswamion Sunday assured compensation for crop loss due to the floods caused by the heavy discharge of water from the state's dams and permanent houses for the affected people. The dams, including Mettur and Bhavanisagar, have been discharging huge volumes of water in view of continuing high inflows from Karnataka reservoirs like Krishnarajasagar. File image of Tamil Nadu chief minister Edappadi Palaniswamy. PTI The discharge has resulted in theinundation of a slew of villages and submergence of standing crops along the banks of Cauvery, (its tributary Bhavani in Erode) in several districts of Tamil Nadu.",
"time_scraped": "2018-08-20 03:51:33.103890",
"article_id": "4996141",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/01/E-Palaniswami-380-PTI.jpg",
"path": "full/a46e38a8113eec826aa4d95cf4e56e4a0548631c.jpg",
"checksum": "f9daed49a2a20d5afdc19d28054922ef"
}
]
}