{
"source_article_link": "https://www.firstpost.com/india/for-kerala-rehabilitation-likely-the-biggest-challenge-post-floods-health-issues-another-looming-calamity-4996921.html",
"title": "For Kerala, rehabilitation likely the biggest challenge post floods, health issues another looming calamity",
"date_published": "2018-08-19T21:52:20+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/House-fully-damaged-in-landslide-in-Kannur.jpg",
"https://images.firstpost.com/wp-content/uploads/2018/08/UC-college-relief-camp2.jpg"
],
"article_body": "Editor's note multi-part series *** \"I wish the flood had taken my life. I have lost everything I had. My house is damaged. I have no money to repair it. If the government does not help me repair it, I don't know where I will go,\" says Sarojini , who is languishing in a relief camp in Alangad near Aluva in Ernakulam district. The 65-year-old woman was brought to the relief camp after floodwaters from the Periyar river ravaged her single-room house in Karumalloor. Sarojini, a childless widow, sells fish to make a living. She says she doesn't have anything other than the dress she is wearing left to see her life through. There are hundreds of thousands of such people languishing in relief camps across Kerala, unable to imagine how they will rebuild their lives. With water receding in most major flood-hit regions , all people in the camps are eager to return home. But home is a distant prospect for thousands of people like Sarojini. Innumerable houses have collapsed in landslides or been washed away by floodwaters over the past month, when Kerala has been devastated by one of the worst floods in a century . Officials say the number of houses fully damaged may cross 75,000. Details of partially damaged houses are not available yet. This may be in lakhs, considering the ferocity of the floods and landslides. Officials said they were not in a position to take a detailed account of loss to property as they are fully engaged in rescue operations. \"We are now fully focused on rescue operations. We will be able to ascertain details of loss to property and the scale of rehabilitation only after all those stranded in the flood-hit areas are moved to safety,\"a senior revenue department official said. The officer, who did not wish to be identified, said that the government was planning to provide assistance to rebuild and repair the damaged houses under its Life Mission project, which is aimed at providing houses to families without land or homes. Under the project, Chief Minister Pinarayi Vijayan has announced assistance worth Rs 4 lakh for those who lost their homes and Rs 10 lakh for those who lost both their homes and land. Partially damaged houses have not been taken into account here. The flood victims who interacted with this reporter in half a dozen relief centres in Ernakulam district said that the amount announced even for fully damaged houses was insufficient. Shaji Joseph, who has been put up at the UC College relief camp in Aluva, said that Rs 10 lakh was not sufficient to buy land. \"The government had relaxed norms to compensate fisherfolk for the losses they had suffered in the Ockhi cyclone. The floods that displaced us is worse than Ockhi. I hope the government considers this a special case and helps all victims rebuild their homes and lives,\"Joseph said. A house fully damaged after a landslide in Kannur, Kerala. Image Courtesy: TK Devasia The people who lost their houses are worried about where they will go after the relief camps are closed. A majority of themhave been accommodated in schools and colleges, which will re-open after the Onam holidays if the monsoon does not unleash a fresh wave of fury. The Kerala government has not made any arrangements yet to accommodate people who have lost their houses. \"A part of our house has collapsed. We cannot return home unless it is rebuilt. I don't know whether it is safe to live in the house even if it is repaired as the floods may have shaken the foundation. I don't know where we will go till we get a safe accommodation,\" said Sreedevi, who is housed in a camp in Eloor. The biggest challenge staring at the government now is rehabilitating those whose homes were destroyed in the floods. In fact, those whose houses are still intact and have not suffered any damage in the floods are also not in a position to return to them as a majority of these houses are not in a liveable condition. TP Johny, who stayed put in his house in Cheranallur on the banks of the Kochi backwaters till the floodwaters reached the first floor, said he may need at least a week to make the house liveable again. \"The entire ground floor is covered in mud. I found half a dozen snakes and many other reptiles when I went to inspect the house on Sunday. I need to clean and sanitise the entire house before I can bring my family back,\" he said. This is the case with a vast majority of the people who were forced to leave their homes . Most of those accommodated inrelief camps are the poor who cannot afford the huge expense of clearing and sanitising their houses before returning to them. A relief camp at UC College in Aluva. Image Courtesy: TK Devasia If people are allowed to return home without this cleaning and sanitising process, Kerala may face yet another disaster — this time in the form of communicable diseases and an epidemic. Health authorities have already sounded an alert about a breakout of malaria, diarrhoea and leptospirosis, which are the most common diseases triggered by floods. Doctors say leptospirosis can be a bigger risk of the lot because everyone has been wading through the floodwaters without taking precautions. They have been exposed to urine of animals such as dogs, rodents and livestock, which causes the bacterial infection. The Directorate of Health Services has issued advisories for the public and medical workers on measures to be taken during the floods and after. Theadvisories cover treatment of injuries as well as control of communicable diseases. The department has suggested taking the following precautions: * Consume only safe drinking water, preferably boiled. * Wash your hands frequently with soap and water to prevent infections. * Do not consume food soaked in the floodwaters. The health department has also advised people developing a fever or suffering from diarrhoea to seek treatment at government facilities, including medical camps, and refrain from treating themselves. If a cluster of diarrhoea cases— more than three in a locality — is found, a health facility nearby should be informed. The department has also issued guidelines to local authorities on handling clean-up operations after the floodwaters recede. This includesguidelines on dumping waste, disinfecting flooded areas, cleaning drinking water sources, chlorinating water, ensuring oral rehydration of those who need it and preventing food poisoning, mosquito-borne diseases and snake bites. The guidelines point out that flood-affected people are also likely to suffer psychological problems, advising local authorities to conduct special camps for them wherever necessary. With the government fully focusing on rescue operations, it could be faced with another calamity post-floods in the form of numeroushealth issues.",
"description": "Editor's note multi-part series *** \"I wish the flood had taken my life. I have lost everything I had. My house is damaged. I have no money to repair it. If the government does not help me repair it, I don't know where I will go,\" says Sarojini , who is languishing in a relief camp in Alangad near Aluva in Ernakulam district.",
"time_scraped": "2018-08-20 03:51:41.417990",
"article_id": "4996921",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/House-fully-damaged-in-landslide-in-Kannur.jpg",
"path": "full/3516a16189e97d1d2948eed8fc88a9f781975c1c.jpg",
"checksum": "ee87fb6094a75824b9954c12db98a033"
},
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/UC-college-relief-camp2.jpg",
"path": "full/e01b19f7eef160e0f606234d1fcc81a1394c27dc.jpg",
"checksum": "071c567c4bf1424f2a1325e44f8d3237"
}
]
}