{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-ndma-says-6-33-lakh-people-in-relief-camps-currently-no-heavy-rains-expected-from-tomorrow-4996891.html",
"title": "Kerala floods: NDMA says 6.33 lakh people in relief camps currently, no heavy rains expected from tomorrow",
"date_published": "2018-08-19T19:56:07+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/WhatsApp-social.jpg"
],
"article_body": "New Delhi: The National Disaster Management Authority (NDMA) on Sundaysaid there will be no heavy rains in flood-hit Kerala for the next four days, giving a ray of hope to the distraught people of the state.The NDMA also said that different agencies have rescued more than 33,000 people from the flood-affected areas of the state. Over 6.33 lakh people are currently staying in relief camps, it added. An NDRF team rescues a woman in flood-hit Kerala. Image Courtesy: Naveen Nair \"Rainfall will further decrease in the next five days. Heavy rain at one or two places in Idukki, Konnur and Kozhikode districts likely today (Sunday). No heavy rain from tomorrow for the next four days,\" the NDMA said, quoting a bulletin of the India Meteorological Department (IMD). There is no red or amber alert for any district of Kerala for Sunday. A yellow warning has been issued in three districts. The IMD has four colour codes to signify the intensity of weather. Red means authorities need to take action and one can expect extreme weather conditions. Amber means government agencies need to be prepared to handle exigencies. Yellow means the situation needs to be watched, and green signals possibly normal weather. The central government has also decided to give ex-gratia of Rs 2 lakh each to the families of those killed in the floods, and Rs 50,000 to the injured.The compensation will be provided from the Prime Minister's Relief Fund. A total 6,33,010 people are staying in 2,971 relief camps. As of now, 33,179 people have been evacuated in rescue operations, the NDMA said. It added that sofar, 129 metric tonnes of rice and 30 MT of milk powder — 20 MT to Idukki and 10 MT to Wayanad— have been dispatched to Kerala. The Tamil Nadu Medical Services Corporation has dispatched necessary medicines to the affected areas, which is in addition to the over 150 truck loads of relief materials from the civil society and NGOs. Altogether, 100 tonnes of food materials like biscuits, rusks and drinking water are being airlifted to Kerala from Jalandhar and Patiala in Punjab. At least 197 people have been killed in Kerala in the last 10 days in the second spell of monsoon fury since 8 August, as floods and landslides triggered by incessant rain have wreaked havoc in many parts of the state.",
"description": "New Delhi: The National Disaster Management Authority (NDMA) on Sundaysaid there will be no heavy rains in flood-hit Kerala for the next four days, giving a ray of hope to the distraught people of the state.The NDMA also said that different agencies have rescued more than 33,000 people from the flood-affected areas of the state. Over 6.33 lakh people are currently staying in relief camps, it added. An NDRF team rescues a woman in flood-hit Kerala. Image Courtesy: Naveen Nair \"Rainfall will further decrease in the next five days. Heavy rain at one or two places in Idukki, Konnur and Kozhikode districts likely today (Sunday). No heavy rain from tomorrow for the next four days,\" the NDMA said, quoting a bulletin of the India Meteorological Department (IMD). There is no red or amber alert for any district of Kerala for Sunday. A yellow warning has been issued in three districts.",
"time_scraped": "2018-08-20 03:51:38.361937",
"article_id": "4996891",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/WhatsApp-social.jpg",
"path": "full/0de639ea5633cb2b2a0264c3b617c3f22fc39d9c.jpg",
"checksum": "cdce3da31b17531fa0b39103c34e23a7"
}
]
}