{
"source_article_link": "https://www.firstpost.com/india/karnataka-floods-over-3500-rescued-in-kodagu-district-hd-kumaraswamy-conducts-aerial-survey-to-assess-situation-4996581.html",
"title": "Karnataka floods: Over 3,500 rescued in Kodagu district; HD Kumaraswamy conducts aerial survey to assess situation",
"date_published": "2018-08-19T18:54:10+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/HD_Kumaraswamy_Aug4.jpg"
],
"article_body": "Bengaluru: More than 3,500 people have been rescued in Karnataka's Kodagu district till Sunday, where six people have lost their lives due to floods and landslides. File photo of Karnataka chief minister HD Kumaraswamy. ANI President Ram Nath Kovind spoke to Chief Minister HD Kumaraswamy over phone to inquire about the situation in the rain-battered southern district, bordering Kerala. Kumaraswamy informed Kovind that the district administration was managing the rescue-and-relief work efficiently, along with the army, National Disaster Response Force (NDRF) and other agencies, and have rescued more than 3,500 people so far, the chief minister's office said in a statement. Operations are on to rescue those stranded at various places. Kumaraswamy, who had conducted an aerial survey in Kodagu on Sunday, undertook another one for more than an hour in Somwarpet, Suntikoppa, Madapura, Mukkodlu, Harangi backwaters, Siddapura, Kushalnagar and surrounding areas. He also assessed the situation in the affected areas between Piriyapatna and Madikeri. According to officials, as many as 317 people were rescued and shifted to safer places in the district on Sunday, and rescue operations were on around Makkandor and other areas of the district on Sunday. Among those rescued include a two-month-old infant, they said, adding that food had been arranged at all the 31 relief shelters. There are reports about a landslide near Kuduremukha in Chikkamagaluru district, affecting road connectivity in the region. Several districts of coastal and Malnad regions like Dakshina Kannada, Udupi, Chikkmagaluru, Kodagu, parts of Hassan and Kannada, have been facing the wrath of the nature due to incessant rains in the last few days.",
"description": "Bengaluru: More than 3,500 people have been rescued in Karnataka's Kodagu district till Sunday, where six people have lost their lives due to floods and landslides. File photo of Karnataka chief minister HD Kumaraswamy. ANI President Ram Nath Kovind spoke to Chief Minister HD Kumaraswamy over phone to inquire about the situation in the rain-battered southern district, bordering Kerala. Kumaraswamy informed Kovind that the district administration was managing the rescue-and-relief work efficiently, along with the army, National Disaster Response Force (NDRF) and other agencies, and have rescued more than 3,500 people so far, the chief minister's office said in a statement. Operations are on to rescue those stranded at various places. Kumaraswamy, who had conducted an aerial survey in Kodagu on Sunday, undertook another one for more than an hour in Somwarpet, Suntikoppa, Madapura, Mukkodlu, Harangi backwaters, Siddapura, Kushalnagar and surrounding areas. He also assessed the situation in the affected areas between Piriyapatna and Madikeri.",
"time_scraped": "2018-08-20 03:51:29.816687",
"article_id": "4996581",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/HD_Kumaraswamy_Aug4.jpg",
"path": "full/d5396033053f3503ce9cbdcd157ec8128fc1e0ac.jpg",
"checksum": "c6af13ad82a170ac1f133aede76df0dc"
}
]
}