{
"source_article_link": "https://www.firstpost.com/india/centre-could-take-legislative-route-to-build-ram-temple-says-up-deputy-chief-minister-keshav-prasad-maurya-4996251.html",
"title": "Centre could take legislative route to build Ram Temple, says UP deputy chief minister Keshav Prasad Maurya",
"date_published": "2018-08-19T17:44:19+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2017/06/keshavprasad-maurya-ibnlive.jpg"
],
"article_body": "Lucknow: Uttar Pradesh deputy chief minister Keshav Prasad Maurya on Sunday said he was hopeful that if the need arose and there was no way out, the Centre could opt for the legislative route in Parliament for the construction of a Ram temple in Ayodhya, when it has adequate numbers in both Houses. File image of Keshav Prasad Maurya. CNN News 18 \"When such a need arises that there is no way out except bringing a Bill, I am fully confident that in such a situation and when we have adequate strength (in both Houses of Parliament), remember these two things\", he said without elaborating. \"At present, in Parliament, we do not have adequate strength. Because even if we bring the matter in Lok Sabha, our strength in the Rajya Sabha is less, and it will definitely be defeated. Every devotee of Lord Ram knows this. The court will soon give its judgement. The day we have the strength, it will be constructively used and not misused ( ),\" Maurya told He said the matter was being heard in the Supreme Court. Maurya also said if the grand Ram temple was built, it will be a \"true tribute\" to VHP stalwart Ashok Singhal, Mahant Sri Ramchandra Das Paramhans (former head of the Ram Janmabhoomi Nyas in Ayodhya) and karsewaks who sacrificed their lives. The deputy chief minister was also asked whether the Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Bill will anger BJP's core vote bank. Maurya replied, \"The intention of the government is to not cause any harassment to anyone by bringing in the bill. As deputy chief minister of the state, I can say that in Uttar Pradesh, no fake case will be registered and no one will be harassed unnecessarily. But, anyone doing any wrong to SC/ST people will not be spared.\" On 9 August, Parliament had passed the bill to overturn a Supreme Court order concerning certain safeguards against arrest under the Scheduled Caste and Scheduled Tribe law, The Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Bill, which was passed by the Rajya Sabha by a voice vote, had got the nod of the Lok Sabha on 6 August. On the party's poll preparations, Maurya who had represented Phulpur in the Lok Sabha said, \"Our party is working to get at least 51 percent vote share at every booth, and we are working in this direction.\" Taking a jibe at rival political parties, the Uttar Pradesh deputy chief minister said, \"Who is actually nervous can be clearly revealed by the expressions of (Samajwadi Party chief) Akhilesh Yadav and (BSP supremo) Mayawati\". Prime Minister Narendra Modi is an MP from Uttar Pradesh, and the mass crowd which had turned up at the programmes addressed by him drop ample hints that our political rivals have been shaken..... There is a special attachment for Modi ji among the people. They are in fact complementary to each other.\"",
"description": "Lucknow: Uttar Pradesh deputy chief minister Keshav Prasad Maurya on Sunday said he was hopeful that if the need arose and there was no way out, the Centre could opt for the legislative route in Parliament for the construction of a Ram temple in Ayodhya, when it has adequate numbers in both Houses. File image of Keshav Prasad Maurya. CNN News 18 \"When such a need arises that there is no way out except bringing a Bill, I am fully confident that in such a situation and when we have adequate strength (in both Houses of Parliament), remember these two things\", he said without elaborating. \"At present, in Parliament, we do not have adequate strength. Because even if we bring the matter in Lok Sabha, our strength in the Rajya Sabha is less, and it will definitely be defeated. Every devotee of Lord Ram knows this. The court will soon give its judgement. The day we have the strength, it will be constructively used and not misused ( ),\" Maurya told",
"time_scraped": "2018-08-20 03:51:32.542334",
"article_id": "4996251",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2017/06/keshavprasad-maurya-ibnlive.jpg",
"path": "full/7242a4a515a2dbe826ddf252fb0b083d00670dce.jpg",
"checksum": "52a518cd06ad7869ef13aa1171208fea"
}
]
}