{
"source_article_link": "https://www.firstpost.com/india/atal-bihari-vajpayees-ashes-immersed-in-ganga-massive-crowd-gathers-at-haridwars-har-ki-pauri-to-bid-adieu-to-ex-pm-4996051.html",
"title": "Atal Bihari Vajpayee's ashes immersed in Ganga; massive crowd gathers at Haridwar's Har ki Pauri to bid adieu to ex-PM",
"date_published": "2018-08-19T16:12:57+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee-380-PTI1.jpg"
],
"article_body": "Haridwar: A huge crowd converged at Har ki Pauri in Haridwar on Sunday to bid a final farewell to their beloved leader and former prime minister Atal Bihari Vajpayee as his ashes were immersed in the Ganga by family members and Bharatiya Janata Party (BJP) leaders. Top party leaders including BJP president Amit Shah, Home Minister Rajnath Singh, Uttar Pradesh Chief Minister Yogi Adityanath, his Uttarakhand counterpart Trivendra Singh Rawat, his adopted daughter Namita Kaul Bhattacharya and other family members of Vajpayee were present as the urn carrying his ashes was emptied into the river amid chanting of Vedic hymns. File image of former prime minister Atal Bihari Vajpayee. PTI A platform had been specially raised at Brahmakund below the stairs leading into the river where the rituals were performed. Earlier a sea of humanity followed the flower-bedecked truck that carried Vajpayee's urn through the narrow 2km stretch in reverence to the departed leader. The convoy started from Bhalla college ground and went to Har Ki Pauri with a host of party leaders and family members in attendance. People were also seen standing on the balconies and rooftops to witness the slow passage of the convoy carrying the urn through overcrowded streets. Vajpayee's son-in-law Ranjan Bhattacharya carried the urn through the surging crowds to Brahmakund (Har ki Pauri) where it was later immersed in the Ganga amid elaborate rituals performed by \"Teerth purohits\" (priests) and cries of \"Atal Ji Amar Rahein\" rent the air. The rituals lasted around 20 minutes as a huge crowd waited at the ghats on either side of the river to witness the process in total reverence.",
"description": "Haridwar: A huge crowd converged at Har ki Pauri in Haridwar on Sunday to bid a final farewell to their beloved leader and former prime minister Atal Bihari Vajpayee as his ashes were immersed in the Ganga by family members and Bharatiya Janata Party (BJP) leaders. Top party leaders including BJP president Amit Shah, Home Minister Rajnath Singh, Uttar Pradesh Chief Minister Yogi Adityanath, his Uttarakhand counterpart Trivendra Singh Rawat, his adopted daughter Namita Kaul Bhattacharya and other family members of Vajpayee were present as the urn carrying his ashes was emptied into the river amid chanting of Vedic hymns. File image of former prime minister Atal Bihari Vajpayee. PTI A platform had been specially raised at Brahmakund below the stairs leading into the river where the rituals were performed. Earlier a sea of humanity followed the flower-bedecked truck that carried Vajpayee's urn through the narrow 2km stretch in reverence to the departed leader.",
"time_scraped": "2018-08-20 03:51:25.084682",
"article_id": "4996051",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Atal-Bihari-Vajpayee-380-PTI1.jpg",
"path": "full/62668f9f94fb13da1465f5425bf6ad898e51ec68.jpg",
"checksum": "163660fbb4a9a3d7cee491905d622086"
}
]
}