{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-imd-predicts-relief-from-rain-for-state-but-pinarayi-vijayan-warns-of-rehabilitation-challenge-4996751.html",
"title": "IMD predicts relief from rain for flood-battered Kerala, but Pinarayi Vijayan warns of rehabilitation challenge",
"date_published": "2018-08-19T20:58:06+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/KeralaFlood1-380.jpg"
],
"article_body": "Kerala, battling catastrophic floods for the past 12 days, finally received some good news and a hint of respite on Sunday. The India Meteorological Department (IMD) said there is no alert for heavy showers for the next four days in the state, and that the intensity of rainfall had decreased over the past two days.According to the weather agency, 'heavy rainfall' is expected only in the districts of Kozhikode, Kannur and Idukki. Further indicating a gradual return to normalcy, train services between Thiruvananthapuram and Ernakulam were reinstated on Sunday, and passenger services were also resumed. However, Chief Minister Pinarayi Vijayan sounded a note of caution. He said that though one phase of the calamity was over, rehabilitation would be the next big challenge. \"The spirit that we showed in rescue work needs to replicated in rehabilitation efforts also,\" the chief minister said, adding that rescue operations were in the final stages, and that 8,46,680 people were living in 3,734 camps across the state. \"Our prime concern was to save lives. It appears it has been met,\" Vijayan told the media amid signs that the most destructive phase of the floods in Kerala had ended, and that waters submerging numerous towns and villages had finally begun to recede.\"The tragedy is perhaps one of the worst ever. Hence, the loss caused is so huge. So we will accept all help.\" A man stands outside his house in Olavakode, Kalpathy in Palakkad district, Kerala. Image credit: Mohan Kumar K According to an official press release from the Centre, train services are expected to be restored on all lines by Monday evening. A special train with 14,00,000 litres of water and a navy ship with 8 lakh litres of water will also reach Kerala by Monday. Furthermore, commercial flights will resume operations from the Kochi Naval Base from Monday, and all arrangements for logistics for this have been put in place, the release said. According to the National Disaster Response Force (NDRF), more than 15,000 people have been evacuated from areas affected by the floods and heavy rains in Kerala so far, and rescue operations have been stepped up in a number of badly-affected locations. State governments extend assistance On Sunday, Odisha chief minister Naveen Patnaik announced an additional financial assistance of Rs 5 crore for Kerala from the state's Chief Minister's Relief Fund. This is in addition to the Rs 5 crore he had sanctioned earlier. Patnaik has also ordered 500metric tonnes of polythene sheets, worth around Rs 8 crore, to be sent to Kerala. Telangana home minister N Narasimha Reddy handed a cheque for Rs 25 crore to the Kerala chief minister in Thiruvananthapuram on Sunday to help with the state's flood relief activities.Reddy also announced that he will donate a month's salary to the Kerala Chief Minister's Relief Fund, an official release said. The Jammu and Kashmir government also announced a relief ofRs 2 crore for the flood victims of Kerala. Governor NN Vohra informed Vijayan of this decision while expressing sorrow over the tragic loss of hundreds of lives in the floods. These are in addition to the several other states that had pledged crores to Kerala as flood relief. This includes Telangana, West Bengal, Himachal Pradesh, Uttar Pradesh, Tamil Nadu, Karnataka, Punjab and Rajasthan. Toll rises to 370 The toll in the disaster has climbed to 370, as two more deaths in the floods in Kerala were reported on Sunday. Rescue operations are still underway in the worst-affected districts of Alappuzha, Ernakulam and Thrissur. The high number of deaths is a result of 'exceptionally high seasonal rainfall' that has battered Kerala since 1 August. The downpour has left nearly half the state inundated. On Sunday, Byju, a grievance officer working with the Southern Railway, said: \"There is an exodus-like situation everywhere. People have lost their family members, homes and property and are in a complete state of shock and helplessness.\" \"I feel like I am in a war zone,\" he added. \"Although water has receded, it is difficult to access some homes... The boundary walls of houses are strong, and water has collected inside the compounds. Many homes are in small inroads where boats can't reach. The destruction is immense, and the conditions of people is pathetic.\"",
"description": "Kerala, battling catastrophic floods for the past 12 days, finally received some good news and a hint of respite on Sunday. The India Meteorological Department (IMD) said there is no alert for heavy showers for the next four days in the state, and that the intensity of rainfall had decreased over the past two days.According to the weather agency, 'heavy rainfall' is expected only in the districts of Kozhikode, Kannur and Idukki. Further indicating a gradual return to normalcy, train services between Thiruvananthapuram and Ernakulam were reinstated on Sunday, and passenger services were also resumed.",
"time_scraped": "2018-08-20 03:51:44.516467",
"article_id": "4996751",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/KeralaFlood1-380.jpg",
"path": "full/1d6903f6812855bf7fbc8fda5b20c3911c4f0f72.jpg",
"checksum": "5c1d25802c6f1ee25d6e05c4f59fcb50"
}
]
}