{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-railways-permits-govt-organisations-private-bodies-to-transport-relief-material-for-free-till-31-august-4996721.html",
"title": "Kerala floods: Railways permits govt organisations, private bodies to transport relief material for free till 31 August",
"date_published": "2018-08-19T19:14:36+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/kerla-flood.jpg"
],
"article_body": "New Delhi: The railways has issued a set of guidelines allowing all government organisations as well as private bodies to transport relief material to flood-ravaged Kerala for free. People being rescued from Kochi following heavy rainfall. PTI However, non-government organisations have to be vetted by divisional railway managers in order to avail this provision, said the guidelines issued on Saturday. \"No freight is to be charged for transportation of relief material to Kerala. That is to all stations in Kerala as of now,\" the railways said. All consignments in passenger-carrying trains through parcel vans as well as intra-state coaching trains carrying relief material shall be covered under these guidelines so as to ensure faster transit, the Railway Board said in a letter to all zonal general managers. \"All government organisations across the country can book relief material free of cost to Kerala. Other organisations, as deemed fit by Divisional Railway Managers (DRM) may also avail of this provision,\" it said. The DRMs have also been empowered to take decisions on attaching additional bogies, vans to various Kerala-bound trains. The railways also said that no ancillary charges like demurrage, wharfage and others are to be charged on such relief material. These guidelines will be in effect till 31 August or till further orders, it added.",
"description": "New Delhi: The railways has issued a set of guidelines allowing all government organisations as well as private bodies to transport relief material to flood-ravaged Kerala for free. People being rescued from Kochi following heavy rainfall. PTI However, non-government organisations have to be vetted by divisional railway managers in order to avail this provision, said the guidelines issued on Saturday. \"No freight is to be charged for transportation of relief material to Kerala. That is to all stations in Kerala as of now,\" the railways said. All consignments in passenger-carrying trains through parcel vans as well as intra-state coaching trains carrying relief material shall be covered under these guidelines so as to ensure faster transit, the Railway Board said in a letter to all zonal general managers. \"All government organisations across the country can book relief material free of cost to Kerala. Other organisations, as deemed fit by Divisional Railway Managers (DRM) may also avail of this provision,\" it said.",
"time_scraped": "2018-08-20 03:51:49.109738",
"article_id": "4996721",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/kerla-flood.jpg",
"path": "full/39a72d86b0de9ee002b71cc55b4a26fee89220ce.jpg",
"checksum": "fd0a6a87930b8e182d61ea7f1316bacd"
}
]
}