{
"source_article_link": "https://www.firstpost.com/india/daily-bulletin-kerala-floods-and-rehabilitation-dabholkar-murder-accused-arrested-asian-games-2018-todays-top-stories-4997731.html",
"title": "Daily Bulletin: Kerala floods and rehabilitation, Dabholkar murder accused arrested, Asian Games 2018; today's top stories",
"date_published": "2018-08-20T07:05:01+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Indonesia-earthquake_AP_380.jpg"
],
"article_body": "Kerala rains: With over 6.33 lakh people taking shelter in 3,000 relief camps, the governmenthas directed the central ministries to focus on providing essential commodities and medicine and restoration of vital services in flood-hit Kerala.The National Crisis Management Committee (NCMC) in its review meeting directed that focus should now be on the provision of emergency supplies of food, water, medicines and restoration of essential services such as power, fuel, telecom and transport links as flood water recedes in Kerala, an official spokesperson said.The National Disaster Management Authority (NDMA) said atotal of 6,33,010 people are staying in 2,971 relief camps in Kerala and around 38,000 flood-affected people have also been rescued by different agencies so far. On Sunday, IMD said there will be no heavy rains in the flood-hit Kerala for the next four days, giving a ray of hope to the distraught people of the state. File image of earthquake in Indonesia's Lombok. AP Dabholkar murder: Former Shiv Sena corporator Shrikant Pangarkar was arrested by the Maharashtra Anti-Terrorism Squad (ATS)on Sunday in connection with the seizure of crude bombs and weapons from different parts of the state between 9 and 11 August, an ATS official said.Pangarkar was arrested under the Explosives Act, the Explosive Substances Act and the Unlawful Activities (Prevention) Act, he added. Indonesia earthquake: Multiple earthquakes — including a powerful and shallow 6.9-magnitude tremor — have rocked the Indonesian holiday island of Lombok, killing at least five people and setting off fresh waves of panic. A series of quakes were recorded by seismologists throughout on Sunday, the first measuring 6.3 shortly before midday which triggered landslides and sent people fleeing for cover. It was followed nearly twelve hours later by a quake measuring 6.9 and at least five more significant aftershocks, according to the US Geological Survey. Parliamentary Committeeseeks Raghuram Rajan's help: Theparliamentary committee looking into the issue of mounting non-performing assets (NPAs) has asked former RBI Governor Raghuram Rajan to appear before it and brief on the matter., according to sources. Parliament's Committee on Estimates, headed by veteran BJP leader Murali Manohar Joshi, has written a letter to Rajan asking him to appear before the panel and brief the members on the issue of mounting NPAs. Asian Games 2018: After the highs and lows of the opening day of the 18th Asian Games, the second day of the ongoing tournament at Indonesia will witness the men's hockey team, shooters Apurvi Chandela, Elavenil Valarivan and Manavjit Singh Sandhu, wrestlers Sakshi Malik, Vinesh Phogat, Pooja Dhanda in action among the list of events concerning the Indian contingent. India vs England, 3rd Test, Day 3: India find themselves in a fantastic situation in the Trent Bridge Test, after the brilliant second session where Hardik Pandya bagged his maiden five-for. They already lead by 292 runs and Virat Kohli and Co will now look forward to post as many runs as possible on the board to set up the foundation for their first Test win in this series. Kangana speaks up on real estate controversy: Rejecting the claims of a real estate broker, Actress Kangana Ranaut says she has cleared all her dues and despite this, she is being harassed. Last year, Kangana bought a bungalow in Pali Hill, and the complainant was instrumental in making the deal happen but now the real estate broker has approached the Khar Police complaining against her sister Rangoli Chandel and other staff members. \"I paid the agency who made the deal for me. One percent brokerage which adds to Rs 22 lakhs, their dues have been paid many months ago. The said person is one of the brokers who offered this deal to me,\" Kangana said.",
"description": "Kerala rains: With over 6.33 lakh people taking shelter in 3,000 relief camps, the governmenthas directed the central ministries to focus on providing essential commodities and medicine and restoration of vital services in flood-hit Kerala.The National Crisis Management Committee (NCMC) in its review meeting directed that focus should now be on the provision of emergency supplies of food, water, medicines and restoration of essential services such as power, fuel, telecom and transport links as flood water recedes in Kerala, an official spokesperson said.The National Disaster Management Authority (NDMA) said atotal of 6,33,010 people are staying in 2,971 relief camps in Kerala and around 38,000 flood-affected people have also been rescued by different agencies so far. On Sunday, IMD said there will be no heavy rains in the flood-hit Kerala for the next four days, giving a ray of hope to the distraught people of the state. File image of earthquake in Indonesia's Lombok. AP Dabholkar murder: Former Shiv Sena corporator Shrikant Pangarkar was arrested by the Maharashtra Anti-Terrorism Squad (ATS)on Sunday in connection with the seizure of crude bombs and weapons from different parts of the state between 9 and 11 August, an ATS official said.Pangarkar was arrested under the Explosives Act, the Explosive Substances Act and the Unlawful Activities (Prevention) Act, he added.",
"time_scraped": "2018-08-20 07:10:20.189722",
"article_id": "4997731",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Indonesia-earthquake_AP_380.jpg",
"path": "full/f0851675f55f52b4af70b78628b11f47b1a797c7.jpg",
"checksum": "958f1c4bafac2ac84418400abbed99b7"
}
]
}