{
"source_article_link": "https://www.firstpost.com/india/kashmiri-engineer-suspected-to-be-islamic-state-sympathiser-deported-from-uae-handed-over-to-jk-police-after-questioning-4997911.html",
"title": "Kashmiri engineer suspected to be Islamic State sympathiser deported from UAE, handed over to J&K Police after questioning",
"date_published": "2018-08-20T08:04:35+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2017/07/ISIS-flag-Reuters.jpg"
],
"article_body": "Srinagar: A Kashmiri man, suspected to be a sympathiser of the banned Islamic State terror group, was recently deported to India from the United Arab Emirates (UAE), officials said here on Sunday. Thirty-six-year-old Irfan Ahmad Zargar, a resident of Chattatabal area on the outskirts of Srinagar, was deported from the Gulf country on 14 August and subjected to questioning by various security agencies, including the National Investigation Agency, they said. Representational image. Reuters He was then handed over to the Jammu and Kashmir police who were carrying out detailed investigations. However, there was no case pending against him in the state. Zargar, an engineer, is alleged to have been \"quite active\" on social media and had been expressing his liking for the activities of ISIS in Syria, they said. The NIA, the central probe agency tasked with investigating terror cases, questioned him for over two days before handing him over to the state police. Zargar was picked up by the authorities in Dubai on 28 April this year when he was entering into the Gulf country from Oman, they said. He was subjected to intensive questioning by Dubai sleuths about his activities on social networking sites, especially his appreciation of Islamic State activities in Syria and Iraq. Working with a telecom company in Dubai, Zargar maintained that he had travelled to Oman for setting up a business of handcrafts. The Dubai officials had carried out a thorough search of his apartments in Sharjah and later whisked him away to an undisclosed location. He was deported to India on 14 August. External Affairs Minister Sushma Swaraj had been approached by one of his kin on her Twitter handle asking for help. The minister had assured them help and the Indian Consulate General in Dubai had initiated a hunt for the man. However, the Dubai authorities had refused to entertain any plea until they had not completed their own investigation in the case. Zargar is the third Kashmiri to have been deported for allegedly being sympathisers of the terror group. Srinagar-resident Afshan Parvaiz was deported from Turkish capital of Ankara on 25 May. Parvaiz had left home after an argument with his father, who wanted him to join a college while he was interested in religious studies. He booked himself a seat on a flight to Teheran on 23March and was later deported after he crossed into Turkey. Another youth from Ganderbal, Azhar ul Islam, was deported from the UAE last year for being an alleged Islamic State sympathiser.",
"description": "Srinagar: A Kashmiri man, suspected to be a sympathiser of the banned Islamic State terror group, was recently deported to India from the United Arab Emirates (UAE), officials said here on Sunday. Thirty-six-year-old Irfan Ahmad Zargar, a resident of Chattatabal area on the outskirts of Srinagar, was deported from the Gulf country on 14 August and subjected to questioning by various security agencies, including the National Investigation Agency, they said. Representational image. Reuters He was then handed over to the Jammu and Kashmir police who were carrying out detailed investigations. However, there was no case pending against him in the state. Zargar, an engineer, is alleged to have been \"quite active\" on social media and had been expressing his liking for the activities of ISIS in Syria, they said.",
"time_scraped": "2018-08-20 09:02:01.123697",
"article_id": "4997911",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2017/07/ISIS-flag-Reuters.jpg",
"path": "full/82ece2b87862289891243a7d5d6d9a715d434112.jpg",
"checksum": "1abcc890869cb22058967751c4afe704"
}
]
}