{
"source_article_link": "https://www.firstpost.com/india/hardik-patel-likely-hold-indefinite-fast-over-patidar-quota-demands-on-25-august-demands-rupani-govts-permission-4997711.html",
"title": "Hardik Patel likely hold indefinite fast over Patidar quota demands on 25 August, demands Rupani govt's permission",
"date_published": "2018-08-20T07:04:47+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2017/12/hardik_patel-news182.jpg"
],
"article_body": "Ahmedabad: Patidar quota agitation leader Hardik Patel on Sunday wrote to Gujarat chief minister Vijay Rupani, seeking his intervention for necessary permissions to hold an indefinite fast here from 25 August. File image of Hardik Patel. News18 The authorities have not granted police permission, nor have they allocated a ground for his protest despite repeated applications, he said in an open letter to Rupani. Patel has announced that he will launch an indefinite hunger strike at a ground in Nikol area here to press the demand of reservation for the Patidar (Patel) community from 25 August. But the civic body has converted the ground into a parking area. Patel said protesting is citizens' \"fundamental right under Constitution\" and referred to the fast observed by Prime Minister Narendra Modi, BJP president Amit Shah and others over the logjam in Parliament on 12 April this year. \"We have given a guarantee to the administration that the protest will not affect law and order and will be Gandhian in nature,\" he said. \"Not granting permission and a ground for the planned protest indicates government's helplessness,\" Patel claimed. On Saturday, Patel had said on August 19 he and his supporters will observe a fast sitting in their cars in the parking area in Nikol if an alternative place was not made available for his 25 August gathering.",
"description": "Ahmedabad: Patidar quota agitation leader Hardik Patel on Sunday wrote to Gujarat chief minister Vijay Rupani, seeking his intervention for necessary permissions to hold an indefinite fast here from 25 August. File image of Hardik Patel. News18 The authorities have not granted police permission, nor have they allocated a ground for his protest despite repeated applications, he said in an open letter to Rupani. Patel has announced that he will launch an indefinite hunger strike at a ground in Nikol area here to press the demand of reservation for the Patidar (Patel) community from 25 August. But the civic body has converted the ground into a parking area.",
"time_scraped": "2018-08-20 09:02:01.145521",
"article_id": "4997711",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2017/12/hardik_patel-news182.jpg",
"path": "full/76a39760a259582dd20f544e2eb1bdc3a065c2fc.jpg",
"checksum": "364e4abc1766a41372128a4e23785bd2"
}
]
}