{
"source_article_link": "https://www.firstpost.com/india/ramachandra-guhas-criticism-of-st-stephens-lopsided-quotas-misplaced-college-performing-its-role-as-minority-institute-4997041.html",
"title": "Ramachandra Guha's criticism of St Stephen's 'lopsided' quotas misplaced; college performing its role as minority institute",
"date_published": "2018-08-19T21:59:06+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/st-stephens.jpg"
],
"article_body": "Nostalgia is a curious substance, at once evocative and obfuscating. To speak of St. Stephen’s College, one of the earliest and better known constituents of the University of Delhi, is to, at once, also speak of nostalgia. For an institution as advanced in its antiquity, it is peculiar, if not remarkable, how concomitant nostalgia has remained with the college as a palpable, forceful presence. It is where, we are told , footsteps of illustrious figures of public life have not only lain, but moved, where an enlightened political life is so pervasive that men and women walk 'uncontaminated by the prejudices of race, religion, caste, and class. Ramachandra Guha, whose eulogistic article this piece is an extended comment on, embodies that very generation of illustrious figures of public life for whom the college has remained a site of nostalgic recollection. In the aforesaid piece, Guha alludes to the historic and historical antecedents of St Stephen’s College and takes these to be the moral energy of the college until after Guha when the Christians came. Founded by the Cambridge mission to Her Majesty’s India, St. Stephen’s College has always been characterised by a Christian inscription, even in its transposition from colonial service to postcolonial responsibility. Guha, and indeed, his generation, belonged to the second era in the history of the college, when it became the fixture around which academic life moved. The college did so by handpicking an excellent few from excellent, elite nurseries and delivering them into political, academic, intellectual, and culturaleminence. Curiously, the college still continues to perform that very function, although substantially diluted by the diversion of 'outstanding students' to other institutions where education is relatively secular. Such a history, recounted not only by Guha but his contemporaries at the college, leaves unidentified those outstanding students uncontaminated by prejudice – certainly,they do not carry prejudices of race, religion, caste, and class, but are we to assume that they have no social positions of their own? The Stephanians Guha speaks of in glowing terms came from upper-caste, Hindu, and until 1975, male positions. Itappears thus that it is the upper-caste Hindu subject whomGuha is defending against the encroaching Christians – it is they who rob our aforesaid outstanding students from the luxury of walking corridors their kind had ever considered theirown. St Stephens College. Image courtesy: College website It is in this script that Guha’s ceaseless profiling of the Christian as someone too privileged to be delivered affirmative action – as also a group not outstanding enough as Guha’s outstanding students – is to be located. He writes that 'a striking consequence of this lopsided reservation policy has been an influx of students from the Syrian Christian community, whohave a high degree of wealth and status already. Reserving 50 percent of seats for 2 percent of the population, this a far from disadvantaged section to boot, is surely indefensible on ethical grounds, especially when the college is funded not by the Church but by taxpayers’ money. (…) There have been academic costs to this capture as well. If outstanding students and the best faculty are turned away only because of their religion, then they will go elsewhere.” Such an assessment also ignores, at its own peril, that the college’s avowed Christianisation in admissions is more complicated – indeed, there are special categorisations by church, but also an attempt at educational inclusion by apportioning positions for those of the Scheduled Caste (SC) and Scheduled Tribe (ST) categories among the Christian applicants. If anything, there is a case to be made for the affirmative focus of the college’s Christianisation not going far enough – too say that it has gone too far is obfuscation. It is equally significant that St Stephen’s College is constitutionally empowered by Article 30 of the Constitution which guarantees 'the right of minorities to establish and administer educational institutions.' Notwithstanding Guha’s frequent references to how 'taxpayers’ money' is being funneled into the running of a Christian institution, the Article also prohibits the State from any discrimination towards an institution on account of its minoritarian affiliation. In its 'galloping Christianisation,' the college, then, is performing its constitutional role. Why, one wonders, can it be an object of nostalgia only when 'its Christianity was/is extremely understated'? On a morefundamental level, Guha’s piece, however evocative, betrays a viscerally pathological fear of the sacral. Beyond sensationalist readings, there is no solidity to the claim, contained in a piece on The Print , that the philosophy department of the college is being disbanded in lieu of a department for theological study. Were the former to fructify, the college would stand to lose a precious intellectual resource, but the possibility of the latter – the institution of a theology department – need not necessarily evoke distaste. In any case, astatement put out by the institution on its website states that the department of Philosophy will continue to function, and that there 'was and is no proposal to start a department of Theology in College.' To return to nostalgia, perhaps what Guha remembers – and mourns – is not St. Stephen’s College’s diversity but its exclusion, its totalising marginalisation of the diverse and the different. This is, indeed, why the thirtieth constitutional Article was put in place. It is also why, in India’s present political circumstance, the Article – and its 'narrow' institutional visions and incarnations, must remain.",
"description": "Nostalgia is a curious substance, at once evocative and obfuscating. To speak of St. Stephen’s College, one of the earliest and better known constituents of the University of Delhi, is to, at once, also speak of nostalgia. For an institution as advanced in its antiquity, it is peculiar, if not remarkable, how concomitant nostalgia has remained with the college as a palpable, forceful presence. It is where, we are told , footsteps of illustrious figures of public life have not only lain, but moved, where an enlightened political life is so pervasive that men and women walk 'uncontaminated by the prejudices of race, religion, caste, and class. Ramachandra Guha, whose eulogistic article this piece is an extended comment on, embodies that very generation of illustrious figures of public life for whom the college has remained a site of nostalgic recollection. In the aforesaid piece, Guha alludes to the historic and historical antecedents of St Stephen’s College and takes these to be the moral energy of the college until after Guha when the Christians came. Founded by the Cambridge mission to Her Majesty’s India, St. Stephen’s College has always been characterised by a Christian inscription, even in its transposition from colonial service to postcolonial responsibility. Guha, and indeed, his generation, belonged to the second era in the history of the college, when it became the fixture around which academic life moved. The college did so by handpicking an excellent few from excellent, elite nurseries and delivering them into political, academic, intellectual, and culturaleminence. Curiously, the college still continues to perform that very function, although substantially diluted by the diversion of 'outstanding students' to other institutions where education is relatively secular. Such a history, recounted not only by Guha but his contemporaries at the college, leaves unidentified those outstanding students uncontaminated by prejudice – certainly,they do not carry prejudices of race, religion, caste, and class, but are we to assume that they have no social positions of their own? The Stephanians Guha speaks of in glowing terms came from upper-caste, Hindu, and until 1975, male positions. Itappears thus that it is the upper-caste Hindu subject whomGuha is defending against the encroaching Christians – it is they who rob our aforesaid outstanding students from the luxury of walking corridors their kind had ever considered theirown.",
"time_scraped": "2018-08-20 03:51:26.758622",
"article_id": "4997041",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/st-stephens.jpg",
"path": "full/9c4d25f626ec66c532508c380da8df949cb8b85b.jpg",
"checksum": "645d336162488f7f8fb9a9435a15a1fb"
}
]
}