{
"source_article_link": "https://www.firstpost.com/india/army-personnels-sc-petition-protesting-non-adherence-to-afspa-investigation-by-cbi-requires-understanding-of-conditions-they-operate-in-4997831.html",
"title": "Petition in SC protesting non-adherence to AFSPA, investigation by CBI requires understanding of conditions army operates in",
"date_published": "2018-08-20T09:53:27+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Army-generic-reuters.jpg"
],
"article_body": "A few years ago, at a British institution in London, after listening to a talk on India, I complimented the speaker for mentioning that the two most respected institutions of India, credited with upholding the dignity of the nation, were the Supreme Court and the armed forces. The credentials of the two institutions are certified by almost every Indian. It is therefore quite ironic that this essay is about the very same institutions. On 14 August, 356 officers and army personnel of other ranks — spread from military stations across the country — petitioned the Supreme Court to alert it about the increasing difficulty faced by soldiers while fighting for the nation in sub-conventional conflict situations. The writ petition on behalf of at least one brigadier, a couple of colonels and representatives of other miscellaneous ranks has been accepted and scheduled for hearing on Monday, 20 August. Their perception is that while human rights of the public at large and even anti-national elements is a subject of intense scrutiny, soldiers' own human rights are being progressively denied due to a lack of understanding of the conditions in which they operate against terrorists and militants. The reference here is essentially to the alleged non-adherence to the provisions of the Armed Forces Special Powers Act (AFSPA), which is applicable all over Jammu and Kashmir (less Ladakh) and portions of the northeastern states. Under the AFSPA, protection is to be given to soldiers if inadvertent mistakes are made while operating in the line of duty and acting in good faith. The petition is in reference to the recent direction of the Supreme Court to the Central Bureau of Investigation (CBI) to expedite the investigation of 1,500 cases of alleged extra-judicial killings by the security forces in Manipur. This includes the army, Assam Rifles (officered by the army) and the Manipur Police. A charge against a colonel has already been framed and a case regarding filing of FIR against Major Aditya of 10 Garhwal Rifles, whose column allegedly killed three stone throwers/attempted lynchers in self-defence in Kashmir's Shopian district, is under hearing. Representational image. Reuters To the general public, most of this makes little sense without a simpler understanding of legal rights and powers in an internal proxy conflict. Law and order situations, such as various caste-based agitations, are handled by the state police and central police organisations; the army often comes to their aid under the 'aid to civil authority' clause. This is for short durations and for functional requirement, but the army does not operate independently and has a magistrate whose presence is mandatory at all times and a magisterial endorsement needs to be signed to allow the army to use a firearm. But such a system cannot work in areas where the threat is much larger and affects the integrity of the nation. While battling terror groups or militants, the army cannot await magisterial sanction before it gets into the act, which is often a rapid response to actionable intelligence. Thus, in conduct of such operations, the army functions independently under empowerment of a legislation, which in the case of both Jammu and Kashmir and the North East, is provided by AFSPA (1990) and AFSPA (1958) respectively. In this, there is one relevant provision of the AFSPA. This is the protection — or part immunity from prosecution — for soldiers who in the line of duty make inadvertent mistakes or are simply forced by circumstances to cause injuries or death to civilians, the stone-pelting mobs in Jammu and Kashmir attempting to hinder operations against terrorists being a case in point. In such cases, prosecution of a soldier can only be done under sanction of the Central Government, although law and order is a state subject. This is to protect soldiers from local bias or pressure. It needs to be understood that such irregular or sub-conventional operations as they are called are complex procedures involving intelligence gathering and discernment of targets. They are not conducted under simple binary conditions that are involved in conventional operations against an established adversary with clear battle lines. The complexity is further enhanced by the ever-present feasibility of manipulation of situations by terrorists or their supporters, normally referred to as over-ground workers (OGWs), to place the army under legal pressure and impede its operations. Allegations of rape or gender insensitivity are not uncommon. There is considerable consternation among both serving personnel and veterans on a couple of issues. Firstly, army personnel are involved in these operations at the behest of the State, and that too as the last resort, after the failure of the other organs and agencies. And second, circumstances and complexities of such operations are seldom understood outside the Services community, and therefore prosecution of individuals is unfair. There are also other aspects involved here, but what is seldom appreciated is the relative infirmities in the law which provides protection to soldiers. For example, AFSPA provides partial protection from prosecution due to the provision of prior approval by the Central Government. However, it gives no protection from investigation, and that gives scope for much harassment of soldiers against whom first information reports (FIRs) can be registered and the investigation be carried out under arrest for undetermined period. In addition, local police authorities under directions from lower judiciary may also reopen a case or commence investigation of an action by army personnel long after the conduct in which some local civilians may have allegedly disappeared or been killed. Such personnel may have retired from the army; the interpretation of AFSPA in some instances has gone to the extent to assume that the law does not protect soldiers who may have retired but were serving at the time the operation was conducted. One such case was handled by me when the local police arrested a retired Havaldar from his village in Orissa for an act in which he was allegedly involved while in service. There are many other issues involved which cause concern to those responsible for executing sub-conventional operations. They perceive severe vulnerability in the absence of what they perceive as insufficient sensitivity about the manner in which such operations are conducted. However, it is also important to flag the division of opinion within the veteran ranks and perhaps within those of the serving personnel on the method of petitioning the Supreme Court. Some perceive it as bordering on collective insubordination, although legally this step has the scrutiny and presence of a uniformed legal officer. There are others who feel that the situation is exasperating and that instead of receiving support, the army is being obstructed at every step. There is also a prevailing perception that the army's higher leadership may have compromised its credibility by not sufficiently thumping the table on this issue which apparently was sensitive enough to affect the quality of its sub-conventional operations. Media commentaries have not been entirely sensitive to the issues highlighted leaving the entire case open to perception. The one thing on which any experienced soldier will always agree is that long drawn deployment of the army in such operations is never good. Also, that the truth in most such cases is almost impossible to determine. It is going to take much understanding and maturity to determine how this thorny issue is going to be resolved such that rights of everybody are respected and yet the protectors of the law are themselves not made the victims of it.",
"description": "A few years ago, at a British institution in London, after listening to a talk on India, I complimented the speaker for mentioning that the two most respected institutions of India, credited with upholding the dignity of the nation, were the Supreme Court and the armed forces. The credentials of the two institutions are certified by almost every Indian. It is therefore quite ironic that this essay is about the very same institutions. On 14 August, 356 officers and army personnel of other ranks — spread from military stations across the country — petitioned the Supreme Court to alert it about the increasing difficulty faced by soldiers while fighting for the nation in sub-conventional conflict situations. The writ petition on behalf of at least one brigadier, a couple of colonels and representatives of other miscellaneous ranks has been accepted and scheduled for hearing on Monday, 20 August. Their perception is that while human rights of the public at large and even anti-national elements is a subject of intense scrutiny, soldiers' own human rights are being progressively denied due to a lack of understanding of the conditions in which they operate against terrorists and militants. The reference here is essentially to the alleged non-adherence to the provisions of the Armed Forces Special Powers Act (AFSPA), which is applicable all over Jammu and Kashmir (less Ladakh) and portions of the northeastern states. Under the AFSPA, protection is to be given to soldiers if inadvertent mistakes are made while operating in the line of duty and acting in good faith. The petition is in reference to the recent direction of the Supreme Court to the Central Bureau of Investigation (CBI) to expedite the investigation of 1,500 cases of alleged extra-judicial killings by the security forces in Manipur. This includes the army, Assam Rifles (officered by the army) and the Manipur Police. A charge against a colonel has already been framed and a case regarding filing of FIR against Major Aditya of 10 Garhwal Rifles, whose column allegedly killed three stone throwers/attempted lynchers in self-defence in Kashmir's Shopian district, is under hearing.",
"time_scraped": "2018-08-20 12:02:16.080403",
"article_id": "4997831",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Army-generic-reuters.jpg",
"path": "full/d5c40d910c6fe91b42aab2a540a1d60f15992795.jpg",
"checksum": "13602bd54f6074ddb1cdc4beac961135"
}
]
}