{
"source_article_link": "https://www.firstpost.com/india/indian-origin-billionaires-in-uae-pledge-rs-125-million-for-kerala-flood-victims-relief-operations-4997271.html",
"title": "Indian-origin billionaires in UAE pledge Rs 125 million for Kerala flood victims, relief operations",
"date_published": "2018-08-19T22:35:51+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/Kerala_Floods_Reuters.jpg"
],
"article_body": "Dubai: Indian-origin billionaire businessmen based in the United Arab Emirates (UAE) have announced Rs 125 million in donations for flood relief operations in deluge-hit Kerala, according to a media report. Nearly 200 people have lost their lives in Kerala since 8 August due to the floods caused by rains and landslides, while over 3.14 lakh people have been moved to relief camps. The southern Indian state is facing its worst flood in 100 years with 80 dams opened and all rivers in spate. A body blow has been dealt to the scenic state, with its infrastructure, standing crops and tourism facilities severely hit. An flooded area in Kerala. Reuters Kerala-born businessman Yusuff Ali MA, chairman and managing director of Lulu Group, has announced a Rs 50-million donation for rain-battered Kerala, the reported on Sunday. KP Hussain, chairman of Fathima Healthcare Group, has donated Rs 50 million. He said Rs 10 million of the Rs 50 million will go directly to the Kerala Chief Minister's Relief Fund, while the rest will be allocated for medical relief aid, the Gulf paper added. Hussain said that his group has coordinated with the state's health secretary to send volunteers from its medical faculty. This includes doctors and paramedics being sent to relief camps. \"As per our geological studies and today's condition in Kerala, the stagnant water will be drained much later than expected. Hence, there is a high possibility of more deaths in the event of spread of various diseases like fever, dysentery, gastric issues, skin disorders etc,\" he was quoted as saying.\"This situation needs to be handled very seriously and emergency treatment has to be provided with immediate effect. As recommended by the public health secretary, we have received the list of medicines which will be supplied to the relief camps.\" Other UAE-based businessmen had pledged amounts to help in flood relief operations. India-born billionaire BR Shetty, chairman of Unimoni and UAE Exchange, had pledged Rs 20 million. Azad Moopen, Indian physician, philanthropist and founder chairman and managing director of Aster DM Healthcare, pledged Rs 5 million. The group also announced that it had mobilised a disaster support team of over 300 volunteers. On Saturday, UAE prime minister and Dubai emirate ruler Sheikh Mohammed bin Rashid Al Maktoum pledged support to deluge-hit Kerala and ordered the formation of an emergency committee to provide relief to the victims hit by devastating rains and floods in the state. The Indian community in the UAE, numbering 2.6 million, constitutes 30 percent of the total population. It is the largest expatriate community in the country.",
"description": "Dubai: Indian-origin billionaire businessmen based in the United Arab Emirates (UAE) have announced Rs 125 million in donations for flood relief operations in deluge-hit Kerala, according to a media report. Nearly 200 people have lost their lives in Kerala since 8 August due to the floods caused by rains and landslides, while over 3.14 lakh people have been moved to relief camps. The southern Indian state is facing its worst flood in 100 years with 80 dams opened and all rivers in spate. A body blow has been dealt to the scenic state, with its infrastructure, standing crops and tourism facilities severely hit. An flooded area in Kerala. Reuters",
"time_scraped": "2018-08-20 03:51:22.879815",
"article_id": "4997271",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/Kerala_Floods_Reuters.jpg",
"path": "full/5fc91a84cf6b90e4a7f64fad4c0cddd498f87260.jpg",
"checksum": "27417cf7b6332e12454391a0b6207750"
}
]
}