{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-live-state-assembly-speaker-p-sriramakrishnan-cleans-affected-houses-in-his-constituency-in-malappuram-4997721.html",
"title": "Kerala floods updates: State Assembly Speaker P Sriramakrishnan cleans affected houses in his constituency in Malappuram",
"date_published": "2018-08-20T18:37:21+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/kerala-flood-PTI1.jpg"
],
"article_body": "Kerala floods latest updates: Kerala Assembly Speaker P Sriramakrishnan was seen helping clean the houses affected due to floods in his constituency Ponnani in Malappuram district. Twenty five judges belonging to the Supreme Court have decided to donate Rs 25,000 each towards the relief fund for Kerala floods. Meanwhile, ahouse in Kochi has painted a thank you note on the roof of a house to express their gratitude for Naval Commander Vijay Varma who had rescued two women from the area on 17 August. As of 12 pm on Monday, 14 districts have been affected due to heavy rains and floods in Kerala. Over 5 lakh people from 775 villages have been affected. A total of 361 people have died in rain-related incidents. The Madikeri-Mangalurunational highway is damaged from Jodupala (8 kilometres from Madikeri) to Sampaje, owing to huge landslide. Officials say it will take weeks to repair the road. On Monday, the Indian Army, navy, and coast guard deployed 243 motorised, 24 non-motorised and 21 hired boats to conduct the rescue and relief operations in Kerala, said the defence ministry. Asserting that the rescue operations in Kerala have not yet been called off, General Officer Commanding-in-Chief, Southern Command, Lieutenant General DR Soni said they will make up for the shortcomings in the rescue operations. Chief Justice Dipak Misra on Monday said that all Supreme Court judges will contribute to the Kerala flood relief fund, PTI reported. Earlier Attorney General KK Venugopal had donated Rs 1cr towards the relief fund. As flood waters recede in Kerala, residents are greeted with decomposing carcasses of animals killed in the deadly floods that took the lives of 370 people so far. Hundreds of such carcasses have been found floating in water in Alappuzha and Chalakudy. Union minister JP Nadda said that till now, 3,757 medical camps have been set up across flood-hit Kerala. He said there is a requirement of 90 different medicines and that the first batch has already reached. Vice President of India Venkaiah Naidu called a review meeting on Kerala floods with Deputy Chairman of Rajya Sabha HarivanshNarayan Singh and decided to donate a month’s salary for relief measures in the state. The first batch of passengers arrived at INS Garuda Kochi Naval Air Station as commercial flights service began at the station due to flooding of Cochin International Airport.The district collector of Ernakulam in Kerala said on Monday that all rescue operations in the district have been completed. However, rescue efforts are going onin Kuttanad in Alappuzha where hundreds are still believed to be stranded. Rainfall over Kerala during the South West Monsoon (June 1 to Aug 19) has been exceptionally high. Kerala has so far received 2346.6 mm rains against the normal of 1649.5 mm, according to IMD.High-range Idukki recorded the highest excess rainfall (92 percent above normal) followed by Palakkad (72 percent above normal). Fifty-five doctors from JJ Hospital in Mumbai, and 26 doctors from Pune's Sassoon hospital and paramedical staff will leave for Thiruvananthapuram in two Air India aircraft. Railways restored passenger and express train services in the flood-hit Ernakulam district in Kerala due to \"early completion of restoration works in the division\".The rise in water level in Periyar had a major impact on the flood situation with waters marooning many houses and commercial establishments in Aluva, Paravur and Perumbavoor. With over7.24 lakh people taking shelter in5,645 relief camps, the government on Sunday directed the central ministries to focus on providing essential commodities and medicine and restoration of vital services in flood-hit Kerala. In view of the grave situation in Kerala due to floods, Chief Minister Pinarayi Vijayan called off his proposed trip to the US for medical treatment, an official said on Saturday. The India Meteorological Department (IMD) said there is no alert for heavy showers for the next four days in the state, and that the intensity of rainfall had decreased over the past two days. On Sunday, around 22,000 people were rescued in Kerala in the operations launched by the defence personnel, national and state disaster response forces, fishermen and local people. Meanwhile, Alliance Air's first flight from Bengaluru has just landed at the Kochi Naval Air Base. Its a 70-seater small flight. People being rescued from flood-affected regions in Kerala. PTI Commercial flights will resume operations from the Kochi naval base in Kerala from Monday, and all arrangements for logistics for this have been put in place, an official press release from the Centre. Only small commercial flights will begin operations from the naval base. The deadly monsoon rains that savaged Kerala claimed 13 more lives on Sunday, taking the toll to 210 in the last ten days as Chief Minister Pinarayi Vijayan said most of the marooned had been rescued and the focus would now be on their rehabilitation. In a big relief, there was respite from the rains in most parts of the state on Sunday after nearly two weeks of virtually non-stop downpour and the red alert has been lifted in several districts. President Ram Nath Kovind spoke to Kerala Governor P Sathasivam and Chief Minister Pinarayi Vijayan and enquired about the situation and acknowledged the grit and resilience of the people in coming together in this trying hour. \"Assured the people of the state that entire nation was with them,\" the Rashtrapati Bhavan tweeted. The deadliest deluge in close to a century has claimed 210 lives since 8 August and nearly 400 since 29 May when the south west monsoon set in over Kerala. More than 80 dams were opened, leading to floods while the rains also triggering landslides. High-range Idukki district, Malappuram and Thrissur are among the worst hit. Prime Minister Narendra Modi on Saturday undertook an aerial survey of monsoon ravaged areas and announced an immediate assistance of Rs 500 crore. In good news, the rainfall intensity over Kerala has decreased over the past two days, the meteorology department said on Sunday, adding there is no alert of heavy precipitation for the next four days in the state. The number of those displaced in the torrential rains was on Sunday put at 7.24 lakh by Chief Minister Pinarayi Vijayan, who said most of the affected had been rescued and the government's focus would now be their rehabilitation. Thirteen people lost their lives on Sunday and 7,24,649 lakh people were in 5,645 relief camps, he told reporters after a review meeting. Around 22,000 people were rescued on Sunday in the operations launched by the defence personnel, national and state disaster response forces, fishermen and local people. He was all praise for the efforts put in by personnel of the army, navy, air force, coast guard, NDRF, fishermen and local people in rescuing people. The chief minister said in each panchayat six health officers would be deployed to ensure there was no outbreak of any communicable diseases as the flood water recedes. Vijayan said the state government would distribute 36 lakh textbooks free of cost to school children who had lost their books in the floods. Commercial flight operations from Kochi, hit following the closure of its international airport due to flooding, would resume on Monday from the naval airport to Coimbatore and Bengaluru, bringing some relief to travellers. Meanwhile, as flood waters receded in some areas, people in relief camps have slowly started returning to their homes. The railways cancelled at least 18 trains, partially cancelled nine others and diverted Kanyakumari-Mumbai CST express train via Nagercoil on Sunday. Skeletal services were run between Ernakulam and Thiruvananthapuram and on Alappuzha-Kottayam routes. The trains were packed with flood affected people moving to the houses of their friends and relatives. Efforts are on to restore power and water supply in areas where the power systems have been completely destroyed. The government also decided to pay Rs 3,000 per day each to the fishermen who participated in the rescue operations. Amid horrors of the torrential rains, the wedding of a woman inmate on Sunday brought cheers to a relief camp in northern Malappuram district. Twenty four-year-old Anju, the bride, staying with her family members at the camp for the last three days after her house was submerged in flood, entered into wedlock with Shaiju at a nearby temple. Meanwhile, several people who reached their houses found it difficult to control their tears seeing their dwelling in total disarray. Muddy homes, utensils strewn all over and furniture turned upside down greeted some of them as they come back. Many buildings have developed cracks and pillars were seen perched precariously after water receded in some places. \"Our life has been destroyed. My pension book has gone,\" said an elderly woman near Kochi. Near the Nedumbassery airport, bodies of at least 20 animals could be seen floating in the waters. As per a preliminary estimate, there was Rs 4,441 crore loss to the government following the damage to roads and bridges. At least 220 bridges have been damaged and 59 were still under water, officials said.",
"description": "Kerala floods latest updates: Kerala Assembly Speaker P Sriramakrishnan was seen helping clean the houses affected due to floods in his constituency Ponnani in Malappuram district. Twenty five judges belonging to the Supreme Court have decided to donate Rs 25,000 each towards the relief fund for Kerala floods. Meanwhile, ahouse in Kochi has painted a thank you note on the roof of a house to express their gratitude for Naval Commander Vijay Varma who had rescued two women from the area on 17 August. As of 12 pm on Monday, 14 districts have been affected due to heavy rains and floods in Kerala. Over 5 lakh people from 775 villages have been affected. A total of 361 people have died in rain-related incidents. The Madikeri-Mangalurunational highway is damaged from Jodupala (8 kilometres from Madikeri) to Sampaje, owing to huge landslide. Officials say it will take weeks to repair the road.",
"time_scraped": "2018-08-20 21:03:39.218267",
"article_id": "4997721",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/kerala-flood-PTI1.jpg",
"path": "full/ff7dcaa17a465b2233df4f27906c311524fa2f2e.jpg",
"checksum": "443d544ea10c936aa35efd07df0b0d8d"
}
]
}