{
"source_article_link": "https://www.firstpost.com/india/top-commander-of-al-qaeda-affiliate-in-jammu-and-kashmir-urges-muslims-to-wage-war-against-hindutva-forces-in-new-audio-clip-4997321.html",
"title": "Top commander of Al-Qaeda affiliate in Jammu & Kashmir urges Muslims to 'wage war' against Hindutva forces in audio clip",
"date_published": "2018-08-20T00:06:47+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/zakir-musa-news183.jpg"
],
"article_body": "A top commander of the Ansar Ghawzat-Ul-Hind, an Al-Qaeda affiliate in Jammu and Kashmir, has asked Muslims in India to \"wage a war\" against Hindutva forces and made several references to instances of mob lynching over cow slaughter. In a 15-minute audio clip released by Zakir Musa, the commander, he said, “The Muslim brothers of Kashmir and India, you should prepare for war. Start your preparations, and for believers, Allah has promised success. Jihad is our way, and paradise lies in the shade of swords.” Musa, who had dissociated himself from the Hizbul Mujahideen militant outfit, was announced as the head of Ansar Ghazwat-Ul-Hind through the Global Islamic Media Front, an al-Qaeda-affiliated information network. Hitting out at Prime Minister Narendra Modi, he said that his defeat is certain. “The defeat of Narendra Modi and his army is certain, but that is only possible through jihad. No matter how many atrocities Modi and his Hindu group commit, remember they are cowards,\" he said. File image of Ansar Ghazwat-Ul-Hind commander Zakir Musa. News18 Musa added, \"Remember that the solution to your problems is not to stop eating cow meat, cutting your beard, or choosing the Congress or any other political party in place of the BJP. It lies in jihad only.\" The Ansar Ghazwat-Ul-Hind commander also made references to a number of lynching cases, including those of Mohammad Akhlaq, Pehlu Khan and Inayatullah Khan. This is not the first time that Musa has referred to cow lynching incidents in the country. In a four-minute audio clip in June 2017 , he exhorted the community to 'take revenge' for such incidents. Speaking on Kashmir in his latest audio clip, he urged youth to \"hurl petrol bombs\" at forces to help militants escape, and asked traders not to install CCTV cameras at their shops. Further, he urged people to damage CCTV cameras installed by the police and army. Musa had hit the headlines while being a member of the Hizbul Mujahideen, when he had threatened to behead Hurriyat leaders for terming the Kashmir conflict as a \"political movement\". Following this, Hizbul spokesperson Saleem Hashmi had said that Musa's statement \"isn’t acceptable and the outfit has nothing to do with it.\" Hashmi had further said, \"This is the personal opinion of Zakir Musa. The resistance leadership and Kashmiri people were taking the movement ahead through united efforts. In these circumstances, any provocative statement or step could prove deadly for the movement\". Musa later announced his decision to dissociate himself from the Hizbul Mujahideen, saying, \"The Hizbul Mujahideen has disassociated itself from my statement, so I am disassociating myself from the Hizbul. The Hizbul said that they have nothing to do with Zakir’s statement. If the Hizbul doesn’t represent me, then I don’t represent them. Now onwards, I have nothing to do with the Hizbul. I am on the right path and I am not associated with anybody and we will see who stands with me.\"",
"description": "A top commander of the Ansar Ghawzat-Ul-Hind, an Al-Qaeda affiliate in Jammu and Kashmir, has asked Muslims in India to \"wage a war\" against Hindutva forces and made several references to instances of mob lynching over cow slaughter. In a 15-minute audio clip released by Zakir Musa, the commander, he said, “The Muslim brothers of Kashmir and India, you should prepare for war. Start your preparations, and for believers, Allah has promised success. Jihad is our way, and paradise lies in the shade of swords.” Musa, who had dissociated himself from the Hizbul Mujahideen militant outfit, was announced as the head of Ansar Ghazwat-Ul-Hind through the Global Islamic Media Front, an al-Qaeda-affiliated information network. Hitting out at Prime Minister Narendra Modi, he said that his defeat is certain. “The defeat of Narendra Modi and his army is certain, but that is only possible through jihad. No matter how many atrocities Modi and his Hindu group commit, remember they are cowards,\" he said. File image of Ansar Ghazwat-Ul-Hind commander Zakir Musa. News18",
"time_scraped": "2018-08-20 03:51:41.619387",
"article_id": "4997321",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/zakir-musa-news183.jpg",
"path": "full/a2a4b1497caee01dfa6eeebdc2a0fdcad4cca705.jpg",
"checksum": "8a9cff4f94b77ed9aa0ad6e755c3c96d"
}
]
}