{
"source_article_link": "https://www.firstpost.com/india/gdp-data-showing-high-economic-growth-during-upa-years-not-official-estimates-says-ministry-of-statistics-4997741.html",
"title": "GDP data showing high economic growth during UPA years 'not official estimates', says Ministry of Statistics",
"date_published": "2018-08-20T07:23:37+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/05/Arun-Jaitley-new_380_PTI2.jpg"
],
"article_body": "New Delhi: The government said on Sunday that the gross domestic product (GDP) numbers published this week showing that the Indian economy performed better during previous UPA rule are \"not official estimates\" and that the official data would be released later. Referring to the data published in the media, the Ministry of Statistics and Programme Implementation (MoSPI) said in a statement that \"these are not official estimates\". \"The estimates in the report are not official estimates and are meant only to facilitate a decision on the appropriate approach,\" it said. File image of Arun Jaitley. PTI The MoSPI has revised the base years of the GDP and the Index of Industrial Production (IIP) to 2011-12 and for the Consumer Price Index (CPI), or retail inflation, to 2012. According to the back series data on Gross Domestic Product based on the report of the Committee on Real Sector Statistics, the Indian economy clocked a 10.08 percent growth rate in 2006-07 under the UPA regime led by then Prime Minister Manmohan Singh, the highest since liberalisation of the economy in 1991. The National Statistical Commission (NSC) also said in a separate statement on Sunday that the methodology for back-casting of GDP series is a \"work in progress\" and yet to be finalised. The NSC had constituted a Committee on Real Sector Statistics under the Chairmanship of Sudipto Mundle in April 2017 for improvement and modernisation of the real sector database. \"It is clarified that the methodology for back-casting of GDP series has not yet been finalised and various alternative methods are being explored,\" the Ministry said. \"The methodology, as also the series using the methodology, will be worked out using the suggestions made by the Committee on Real Sector Statistics and other suggestions that emanate during the consultancy process.\" According to the statement, the committee also looked at the issue of data challenges in bringing out the Back Series of GDP (Base 2011-12) as several new sources had been used in the current series, which were not available, or not reliable, in the earlier series (Base 2004-05). The MoSPI also said that the committee approached the data challenges using different approaches. Three possible approaches were considered for generating the back series. The recommendations of the NSC Committee will be examined by MoSPI and other experts for deciding on the appropriate methodology to be adopted for generating the back series estimates for each sector. \"The Advisory Committee on National Accounts Statistics will be deliberating on the Back Series estimates before finalising the same for continuity, consistency and reliability,\" the MoSPI said. It said that the statistical processes involved in producing such estimates are open, transparent and in line with the best international practices and standards. \"The processes and estimates are evolved after detailed deliberations in various technical committees and the recommendations placed in the public domain. Efforts have also been made to increase the sample size and use of high frequency data released by various agencies,\" the Ministry said. In a Facebook post, Finance Minister Arun Jaitley, who is currently convalescing, pointed to the global factors which helped a high rate of growth during the period in question. Besides this, the UPA-I government had the benefit of a continuous incremental reforms from 1991 to 2004, he said. \"2003-04 witnessed the boom period for the global economy. The result was that global growth picked up. Most economies were doing well and all emerging economies started showing a high growth rate. This period continued till 2008 when the global crisis started. \"Since demand was high, exports were growing, and, therefore, for an emerging economy like India it was a great opportunity. However, when this honeymoon ended, growth started slipping down and to ensure that growth is maintained, two significant steps were taken. \"Firstly, fiscal discipline was compromised and the banking system was advised to go in for reckless lending, notwithstanding the fact that it would eventually put the banks at a risk,\" he added.",
"description": "New Delhi: The government said on Sunday that the gross domestic product (GDP) numbers published this week showing that the Indian economy performed better during previous UPA rule are \"not official estimates\" and that the official data would be released later. Referring to the data published in the media, the Ministry of Statistics and Programme Implementation (MoSPI) said in a statement that \"these are not official estimates\". \"The estimates in the report are not official estimates and are meant only to facilitate a decision on the appropriate approach,\" it said. File image of Arun Jaitley. PTI",
"time_scraped": "2018-08-20 15:02:28.747171",
"article_id": "4997741",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/05/Arun-Jaitley-new_380_PTI2.jpg",
"path": "full/4e903cbaeb344b06f9a2114fb90fd4e895a764be.jpg",
"checksum": "8cc30266bda665a709933064302b567b"
}
]
}