{
"source_article_link": "https://www.firstpost.com/india/moving-aero-india-2019-from-bengaluru-to-up-will-damage-indias-hopes-of-becoming-asias-manufacturing-hub-4997821.html",
"title": "Moving Aero India 2019 from Bengaluru to UP will damage India's hopes of becoming Asia's manufacturing hub",
"date_published": "2018-08-20T10:22:17+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2013/07/mig21.jpg"
],
"article_body": "The assertive and bold decision by the present Indian political dispensation in 2015 and 2016, to tactically unshackle the army, was unprecedented in recent times. It resulted in the army executing successful surgical strikes on key terrorist infrastructure across the international borders, both against Indian Insurgent Groups in the North East and terrorists supported by the Pakistani State waging a 'proxy war' in Jammu and Kashmir. Thereafter, the visibility accorded to the events were undoubtedly a masterstroke in 'signalling' that India will not hesitate to adopt kinetic options, if its 'red lines' are crossed. The resultant positive emotional surge and favourable national sentiment that it generated in the country, was also beyond expectation. The collateral fallout was 'defence issues' becoming part of political gamesmanship, in the national narrative. It is in this context that the forthcoming 12th biennial 'Aero India 2019', scheduled to be held in Bengaluru, has been mired in controversy. This was sparked by the request of Uttar Pradesh chief minister Yogi Adityanath to host the event, with the intent of giving a fillip to the proposed 'UP defence corridor'. The placid statements of Defence Minister Nirmala Sitharaman and other officials have added proverbial fuel to the fire. This would have been a 'no-brainer' if the Ministry of Defence had been timely and not ambivalent in confirming the much awaited dates and venue for the forthcoming air show. The arguments that are being debated for both the continuation and change of venue, can be logically justified, based on the tenor of the argument. For it to continue in Bengaluru, the reasoning is hinged on the basis of historical precedence. Since its inception in 1996, it has been hosted by Bengaluru, where it has gradually earned international recognition. Also, it conforms to the worldwide practice of retaining the sanctity of the location of international air shows, whether that is the Le Bourget in Paris (France), Farnborough in Hampshire (UK), Dubai, Singapore or the biennial MAKS air show in Zhukovsky, Russia. Another point in favour is the fact that India's premier aircraft manufacturing industry, Hindustan Aeronautics Limited, is also located in the city. Representational image. Reuters Those in support of the change anchor their reasoning on the precedent set by the changing of venues of the 'Defence Exhibition' in the past few years. It was relocated from its traditional location in Delhi to Goa in 2017 and then Chennai earlier this year. The changes generated a lot of debate, but even the naysayers had to grudgingly accept that the DefExpo in Chennai was a success. It also showcased the proposed 'defence corridor' commencing from that city. Undoubtedly the advantage of organising such mega events at a new location, showcases a different region of the country to foreign visitors and companies, while indirectly exposing them to th earmarked 'defence corridor', with its intrinsic strengths and opportunities. In this case, the proposed change to Lucknow is supposed to do what 'Defence Expo 2018' achieved for Chennai, ie initiating an interest is destination Uttar Pradesh — even though as of now no tangible gains have been accrued on the Chennai defence corridor. In addition, the argument being propounded is that as the air show-cum-exhibition, is organised by the Ministry of Defence, the state government cannot claim a permanent lien on the venue for the conduct of this event. In light of the two contrarian view points, the question that we need to answer is what are the critical guiding factors for deciding the venue for Aero India? For this, the best inputs are when we look at the rationale for the selection and continuation of three of the largest international air shows-cum-exhibitions at the same venue, year on year. Paris-Le Bourget Airport, continues to host the largest and oldest such event in the world, ie the premier Paris Air Show, since 1949. It is an airport exclusively dedicated to business aviation, located just seven kilometres from Paris and 20 kilmometres from La Défense. It has three runways, two of which can operate independently. It is home to 75 businesses offering airport and aviation services, including the major names in business aviation, and is a top industrial pole of Greater Paris. The Farnborough Air Show in Hampshire, UK commenced in its present format in 1948, as the town was home to the 'Royal Aircraft Establishment' and had its own exclusive airstrip. MAKS in Russia, is held at Zhukovsky International Airport, southeast of Moscow, since its commencement in the early 1990s. It is home to the 'Gromov Flight Research Institute' and National Research Centre 'Zhukovsky Institute'. The point to highlight is that the selection of the city for hosting these events was largely influenced by the existing aviation institutions at the location. But the greater gain of permanency, for as long as 70 years as in the case of Paris, has been the cumulative addition over time of aviation-related industries/institutions in and around it. The profile of La Défense in its proximity speaks louder than words. Similarly, Bengaluru is home to Indian aviation and space with both HAL and ISRO being headquartered there since Independence. Over the past seven decades, with India's economic growth, there has been addition of a large number of boutique design and development institutes, with subsidiary manufacturing bases, within/in close proximity of the city. The major aviation setups have incentivised, a large network of MSMEs coming up in the region. Bengaluru has therefore gradually become India's centre of startups and home to the aviation industry. It would be fair to state that the permanency of the event has created an interdependent aviation ecosystem in the extended region around Bengaluru. Cities in the proximity like Hyderabad and Chennai have also seen a major growth of design-manufacturing hubs. This is substantiated by the fact that the Tatas have set up their aerospace facilities in Hyderabad. A large number of commercial airlines have their training facilities in these areas. Thus, the current venue will promote larger participation of involved parties/organisations. The venue at Bengaluru also has the exclusivity of large open spaces including an airstrip, for the duration of the show. The argument that the organising agency has the right to select the venue, in this case the Indian defence ministry is theoretically correct. But it has to be understood that the aim of this mega event is not just to showcase specific areas of the country, but to give a fillip to the 'Make in India' initiative. There is a need to facilitate B2B and M2M engagements, formalise meaningful contracts and joint ventures, and ensure infusion of state-of-the-art technology to Indian companies, so as to make them globally competitive and part of the global aviation supply chain. These events also provide a unique business platform where leaders in government and in the case of India, the public sector and corporate houses are available for business communication. Bengaluru is ideally suited for this. It is a business venture and a trade event where aircraft, avionics and other services are promoted to potential customers, by the large number of MSMEs and boutique designers, co-located, showcasing their capabilities, products and niche technological innovations. The stability of the venue over the past two-plus decades has seen the state government implementing construction and infrastructure norms that aid the overall conduct of the event. The air space continues to be free of encumbrances. Small business houses continue to mushroom under the umbrella of the major aviation conglomerates. Therefore, continuity in this case will be the answer for achieving the above stated aims. Unlike the DefExpo, the air show is limited to only the aviation sector and with the aviation anchors in Bengaluru; in other words, you will not attract anything major in manufacturing, astride the UP defence corridor. We need to take a lesson from the automobile industry that has seen the systematic accretion in players generally around Gurgaon and Chennai, ie existing hubs. The gap between intentions and action has been most glaring in the defence sector that was supposed to be one of the primary sectors for the 'Make in India' initiatives. Changing the venue of the air show will literally be the 'last nail in the coffin'. The permanency of Bengaluru for the event will reestablish India’s seriousness to becoming the manufacturing hub for Asia.",
"description": "The assertive and bold decision by the present Indian political dispensation in 2015 and 2016, to tactically unshackle the army, was unprecedented in recent times. It resulted in the army executing successful surgical strikes on key terrorist infrastructure across the international borders, both against Indian Insurgent Groups in the North East and terrorists supported by the Pakistani State waging a 'proxy war' in Jammu and Kashmir. Thereafter, the visibility accorded to the events were undoubtedly a masterstroke in 'signalling' that India will not hesitate to adopt kinetic options, if its 'red lines' are crossed. The resultant positive emotional surge and favourable national sentiment that it generated in the country, was also beyond expectation. The collateral fallout was 'defence issues' becoming part of political gamesmanship, in the national narrative. It is in this context that the forthcoming 12th biennial 'Aero India 2019', scheduled to be held in Bengaluru, has been mired in controversy. This was sparked by the request of Uttar Pradesh chief minister Yogi Adityanath to host the event, with the intent of giving a fillip to the proposed 'UP defence corridor'. The placid statements of Defence Minister Nirmala Sitharaman and other officials have added proverbial fuel to the fire. This would have been a 'no-brainer' if the Ministry of Defence had been timely and not ambivalent in confirming the much awaited dates and venue for the forthcoming air show. The arguments that are being debated for both the continuation and change of venue, can be logically justified, based on the tenor of the argument. For it to continue in Bengaluru, the reasoning is hinged on the basis of historical precedence. Since its inception in 1996, it has been hosted by Bengaluru, where it has gradually earned international recognition. Also, it conforms to the worldwide practice of retaining the sanctity of the location of international air shows, whether that is the Le Bourget in Paris (France), Farnborough in Hampshire (UK), Dubai, Singapore or the biennial MAKS air show in Zhukovsky, Russia. Another point in favour is the fact that India's premier aircraft manufacturing industry, Hindustan Aeronautics Limited, is also located in the city. Representational image. Reuters Those in support of the change anchor their reasoning on the precedent set by the changing of venues of the 'Defence Exhibition' in the past few years. It was relocated from its traditional location in Delhi to Goa in 2017 and then Chennai earlier this year. The changes generated a lot of debate, but even the naysayers had to grudgingly accept that the DefExpo in Chennai was a success. It also showcased the proposed 'defence corridor' commencing from that city. Undoubtedly the advantage of organising such mega events at a new location, showcases a different region of the country to foreign visitors and companies, while indirectly exposing them to th earmarked 'defence corridor', with its intrinsic strengths and opportunities.",
"time_scraped": "2018-08-20 12:02:18.841998",
"article_id": "4997821",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2013/07/mig21.jpg",
"path": "full/d7f3704a74542e42f59fcc6b53d67626e41deb07.jpg",
"checksum": "9ec1bcd048171d84bd6aeb5d9703d9d7"
}
]
}