{
"source_article_link": "https://www.firstpost.com/india/kerala-floods-video-of-man-letting-women-use-him-as-stepping-stone-to-climb-into-boat-goes-viral-is-dubbed-humanity-at-its-finest-4997761.html",
"title": "Kerala Floods: Video of man letting women use him as stepping stone to climb into boat goes viral, is dubbed 'humanity at its finest'",
"date_published": "2018-08-20T07:56:21+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [],
"article_body": "Though rains in Kerala have receded, the rescue operations to save people stranded in different parts of the flood-ravaged state continue. Part of the rescue operations in Malappuram district was a 32-year-old fisherman who offered his body as a stepping stone to help women climb on to a rescue boat which otherwise might have been too high for them to reach. The fisherman from Tanur, identified as Jaisal KP, rescued three women in Vengara's Muthalamad area on Saturday, according to News18 . A video of the rescue and Jaisal's actions therein has gone viral on social media. https://www.youtube.com/watch?v=lZasD8HydoA&feature=youtu.be In the video, Jaisal is seen in a blue shirt, kneeling on the ground, his face hardly a few inches above the water, as women step on to his back to climb into a boat. \"NDRF personnel who were leading the rescue operations in Vengara informed us they won't be able to reach the place where these women were stranded. We asked them to give their boats for a while, and we rescued them,\" Jaisal told Jaisal has been lauded on social media platforms, with people calling the action \" humanity at its finest\" Kerala, battling catastrophic floods for the last 12 days, finally received some good news and a hint of respite on Sunday. The India Meteorological Department (IMD) also said there is no alert for heavy showers for the next four days in the state, and that the intensity of rainfall had decreased over the last two days. According to the weather agency, \"heavy rainfall\" is expected only in the districts of Kozhikode, Kannur and Idukki.",
"description": "Though rains in Kerala have receded, the rescue operations to save people stranded in different parts of the flood-ravaged state continue. Part of the rescue operations in Malappuram district was a 32-year-old fisherman who offered his body as a stepping stone to help women climb on to a rescue boat which otherwise might have been too high for them to reach. The fisherman from Tanur, identified as Jaisal KP, rescued three women in Vengara's Muthalamad area on Saturday, according to News18 . A video of the rescue and Jaisal's actions therein has gone viral on social media.",
"time_scraped": "2018-08-20 09:02:00.750443",
"article_id": "4997761",
"article_category": "India",
"image_details": []
}