{
"source_article_link": "https://www.firstpost.com/india/over-6000-private-sector-specialists-applied-for-lateral-entry-to-10-joint-secretary-posts-in-govt-says-official-4997311.html",
"title": "Over 6,000 private sector specialists applied for 'lateral entry' to 10 joint secretary posts in govt, says official",
"date_published": "2018-08-19T23:02:49+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2017/12/Jitendra-Singh-PIB.jpg"
],
"article_body": "New Delhi: Over 6,000 candidates have shown interest in 10 posts of joint secretaries in the central government offered to private sector specialists as part of the Narendra Modi government's bid to bring in fresh talent in bureaucracy, officials said on Sunday. The personnel ministry had recently announced recruitment of 10 joint secretaries in select government departments through \" lateral entry \" mode, thus allowing private sector talents to join the government on contractual basis. A total of 6,077 applications have been received for the joint secretary posts, the officials said. File photo of Jitendra Singh. PIB The posts of joint secretaries are in revenue, financial services, economic affairs, agriculture and farmers welfare, road transport and highways, shipping, environment, forest and climate change, new and renewable energy, civil aviation and commerce departments. The deadline to apply for the posts was 30 July. The term lateral entry relates to the appointment of specialists, mainly those from private sector, in government organisations. There are a maximum of 1,100 applicants against one post, depending on the department concerned. The minimum application for a post is 290. \"The central government has started the process of short-listing the candidates,\" a senior ministry official said. There are about 5,004 IAS officers against the strength of 6,500 working across the country. Usually, the posts of joint secretaries are manned by the IAS, IPS, IFS and IRS officers recruited through the civil services examination conducted by the Union Public Service Commission. Citing the names of former prime minister Manmohan Singh, who was also a bureaucrat, and the then deputy chairman of the Planning Commission Montek Singh Ahluwalia, who was appointed through the lateral recruitment route, the government had last month informed Parliament that there has been no adverse effect on the morale of the civil servants due to such appointments. In a written reply to Lok Sabha, Minister of State for Personnel Jitendra Singh said the government had decided to undertake lateral recruitment of 10 joint secretaries on contractual basis in order to achieve the twin objectives of bringing in fresh talent as well as augmenting the availability of manpower. On whether this practice had been followed earlier also, the minister said there was lateral recruitment of some prominent persons to man specific assignments from time to time. \"This includes, among others, appointment of Manmohan Singh, Montek Singh Ahluwalia, Vijay Kelkar, Bimal Jalan, Shankar Acharya, Rakesh Mohan, Arvind Virmani, Arvind Panagariya, Arvind Subramanian and Vaidya Rajesh Kotecha, Parameswaran Iyer and Ram Vinay Shahi. No adverse effect on the morale of the civil servants has resulted from lateral recruitment,\" he said. Kelkar had been former finance secretary, Jalan the ex-RBI governor, Mohan former deputy RBI governor, and Acharya, Virmani and Subramanian, former chief economic advisers. Panagriya had been vice-chairman of NITI Ayiog — formerly the Planning Commission — and Kotecha is secretary of the Ministry of AYUSH. Iyer, a former IAS officer and sanitation expert, is secretary in the Ministry of Drinking Water and Sanitation. Shahi was former power secretary. Government think tank NITI Ayog, in its three-year action agenda for 2017-18 to 2019-20, highlighted that it is essential that specialists be inducted into the system through lateral entry on fixed-term contract, the minister said. The Sectoral Group of Secretaries (SGoS) submitted a report in February 2017, in which it has inter aliabeen observed that there is a shortage of officers at the joint secretary, director and deputy secretary levels due to a reduction in recruitment in 1995-2002. \"Based on the recommendation of the SGoS, the government has decided to undertake lateral recruitment of 10 joint secretaries on contract basis in order to achieve the twin objectives of bringing in fresh talent as well as augment the availability of manpower,\" Singh said.",
"description": "New Delhi: Over 6,000 candidates have shown interest in 10 posts of joint secretaries in the central government offered to private sector specialists as part of the Narendra Modi government's bid to bring in fresh talent in bureaucracy, officials said on Sunday. The personnel ministry had recently announced recruitment of 10 joint secretaries in select government departments through \" lateral entry \" mode, thus allowing private sector talents to join the government on contractual basis.",
"time_scraped": "2018-08-20 03:51:23.025398",
"article_id": "4997311",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2017/12/Jitendra-Singh-PIB.jpg",
"path": "full/952637839f0b48da4b14a4bb14c46c7d8c628f7f.jpg",
"checksum": "21ca5d9f198dfcf7a1ce1f19f59fbb64"
}
]
}