{
"source_article_link": "https://www.firstpost.com/india/jharkhand-police-arrests-11-men-for-abducting-raping-two-minor-girls-in-lohardaga-district-task-force-formed-to-investigate-incident-4998111.html",
"title": "Two minor girls in Jharkhand ask friend for help as bike breaks down, he sends 11 men who abduct and rape them",
"date_published": "2018-08-20T09:41:36+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/06/jharkhand_police_380.jpg"
],
"article_body": "Lohardaga (Jharkhand): Eleven people were arrested for allegedly raping two minor girls in the district of Jharkhand, police said. They were nabbed after a police team conducted raids in the Hirhi Harra Toli locality, Deputy Superintendent of Police Ashish Kumar Mahli told a press conferencein Lohardagaon Sunday. The accused, all aged between 18 and 28 years, had raped the girls on 16 August when they were going to the Hirhi Harra Toli area along with their neighbour, he said. They were travelling on a motorcycle which developed a snag near the Hirhi Railway bridge, the DSP said. Representational image. News18. One of the girls called her friend over phone for help but he sent his 11 friends to the spot instead.They took the girls to an isolated place, beat up their neighbour and drove him away. The men then took turns to rape the girls, Mahli said. The accused also snatched away mobile phones of the victims, he added. A case was registered at Sadar police station on the basis of the statement of the girls. The task force was formed on the directions of Superintendent of Police Priyadarshi Alok to investigate the incident. It was headed by Sub-Divisional Police Officer Arvind Kumar Verma and Mahli. The team also recovered the mobile phones from the house of one of the accused, the DSP said.",
"description": "Lohardaga (Jharkhand): Eleven people were arrested for allegedly raping two minor girls in the district of Jharkhand, police said. They were nabbed after a police team conducted raids in the Hirhi Harra Toli locality, Deputy Superintendent of Police Ashish Kumar Mahli told a press conferencein Lohardagaon Sunday. The accused, all aged between 18 and 28 years, had raped the girls on 16 August when they were going to the Hirhi Harra Toli area along with their neighbour, he said. They were travelling on a motorcycle which developed a snag near the Hirhi Railway bridge, the DSP said. Representational image. News18. One of the girls called her friend over phone for help but he sent his 11 friends to the spot instead.They took the girls to an isolated place, beat up their neighbour and drove him away. The men then took turns to rape the girls, Mahli said. The accused also snatched away mobile phones of the victims, he added. A case was registered at Sadar police station on the basis of the statement of the girls.",
"time_scraped": "2018-08-20 12:02:21.705502",
"article_id": "4998111",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/06/jharkhand_police_380.jpg",
"path": "full/e11bd31375d368fa406eb7279bde8ed6885cf339.jpg",
"checksum": "2ad6f0c1955c4e9c7f3bcd1d014ba380"
}
]
}