{
"source_article_link": "https://www.firstpost.com/india/punjab-chief-minister-amarinder-singh-says-navjot-singh-sidhus-act-to-hug-pakistan-army-chief-was-wrong-4998261.html",
"title": "Punjab chief minister Amarinder Singh says Navjot Singh Sidhu's act to hug Pakistan Army chief was 'wrong'",
"date_published": "2018-08-20T10:52:53+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2016/07/Sidhu-Reuters.jpg"
],
"article_body": "Chandigarh/Attari : Punjab chief minister Amarinder Singh on Sunday ticked off Cabinet colleague Navjot Singh Sidhu for hugging Pakistan army chief, who, he said, was responsible for the killings of Indian soldiers on the border, even as the cricketer-turned-politician defended his action. \"I think it was wrong of him (Sidhu) to have shown the affection he did for the Pakistan army chief. I am not in its favour... the fact is that the man (Sidhu) should understand that our soldiers are being killed everyday. My own regiment lost one major and two jawans a few months ago,\" said Amarinder Singh, a retired officer of the Indian Army's Sikh Regiment. File image of Navjot Singh Sidhu. Reuters The chief minister was replying to reporters' questions on Sidhu hugging General Qamar Javed Bajwa at the swearing-in of Imran Khan as Pakistan prime minister in Islamabad on Saturday. Sidhu was the only Indian who attended Khan's swearing-in ceremony. Sidhu, who returned from Pakistan via the Wagah-Attari border on Sunday, defended hugging Bajwa by posing a counter-question. \"If someone (Pak army chief) comes to me and says that we belong to the same culture and that we'll open the route to Gurdwara Kartarpur Sahib (in Pakistan) on first Sikh Guru, Guru Nanak Dev's 550th birth anniversary, what else I could do?\" he said while speaking to reporters. At a photo exhibition in Chandigarh, chief minister Amarinder Singh, however, made no bones about his disapproval of his minister's actions. Referring to Sidhu's hug to Bajwa, Amarinder Singh said the local bodies minister should have avoided the gesture as Indian soldiers were getting killed every day on the borders. \"After all, it is the Army chief who gives the orders to kill, with soldiers merely following them,\" said the chief minister. The Pakistan army chief is responsible for the deaths of our soldiers and Sidhu should not have shown such niceties to him, said Amarinder Singh. Besides hugging Pakistan army chief, the Punjab minister also courted controversy as he was seen sitting next to Pakistan-occupied Kashmir (PoK) chief Masood Khan, at the event. Amarinder Singh, however, gave the former opening batsman of the Indian cricket team, the benefit of doubt in this case. Sidhu may not have known who he was sitting next to, Amarinder Singh said. In any case, the sitting arrangement was not in Sidhu's hands, he added. Sidhu went to Pakistan in his personal capacity due to his close relations with Imran Khan since their cricketing days, Amarinder Singh said. \"Going there was his personal affair, it has nothing to do with us,\" he said. The chief minister, however, dismissed the Opposition's demand for Sidhu's resignation, saying it was \"not important.\" Khan, who captained his national cricket team to the World Cup glory in 1992, had invited some of his cricketing friends to witness his formal accession to the top job in Pakistan. The BJP and the Akali Dal have hit out at Sidhu for \"ignoring the sentiments\" of the people of his country, mourning the demise of former prime minister Atal Bihari Vajpayee. Apart from political parties, Sidhu's gestures of bonhomie in Islamabad did not go down well with Dalbir Kaur, sister of Sarabjit Singh who died in a Pakistan jail in 2013. Sidhu chose his friendship over the country by attending the swearing-in ceremony of Imran Khan as Pakistan's prime minister, she claimed. She raised questions over Sidhu hugging the Pakistan army chief when there were repeated instances of ceasefire violations along the LoC in Jammu and Kashmir in recent times. Sidhu did not restrict himself to lavishing praise but even \"warmly hugged the Army chief of Pakistan\" at the swearing-in ceremony yesterday trusting that General Qamar Javed Bajwa believes in peace, she added.",
"description": "Chandigarh/Attari : Punjab chief minister Amarinder Singh on Sunday ticked off Cabinet colleague Navjot Singh Sidhu for hugging Pakistan army chief, who, he said, was responsible for the killings of Indian soldiers on the border, even as the cricketer-turned-politician defended his action. \"I think it was wrong of him (Sidhu) to have shown the affection he did for the Pakistan army chief. I am not in its favour... the fact is that the man (Sidhu) should understand that our soldiers are being killed everyday. My own regiment lost one major and two jawans a few months ago,\" said Amarinder Singh, a retired officer of the Indian Army's Sikh Regiment. File image of Navjot Singh Sidhu. Reuters The chief minister was replying to reporters' questions on Sidhu hugging General Qamar Javed Bajwa at the swearing-in of Imran Khan as Pakistan prime minister in Islamabad on Saturday. Sidhu was the only Indian who attended Khan's swearing-in ceremony. Sidhu, who returned from Pakistan via the Wagah-Attari border on Sunday, defended hugging Bajwa by posing a counter-question. \"If someone (Pak army chief) comes to me and says that we belong to the same culture and that we'll open the route to Gurdwara Kartarpur Sahib (in Pakistan) on first Sikh Guru, Guru Nanak Dev's 550th birth anniversary, what else I could do?\" he said while speaking to reporters. At a photo exhibition in Chandigarh, chief minister Amarinder Singh, however, made no bones about his disapproval of his minister's actions. Referring to Sidhu's hug to Bajwa, Amarinder Singh said the local bodies minister should have avoided the gesture as Indian soldiers were getting killed every day on the borders. \"After all, it is the Army chief who gives the orders to kill, with soldiers merely following them,\" said the chief minister. The Pakistan army chief is responsible for the deaths of our soldiers and Sidhu should not have shown such niceties to him, said Amarinder Singh.",
"time_scraped": "2018-08-20 12:02:22.214450",
"article_id": "4998261",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2016/07/Sidhu-Reuters.jpg",
"path": "full/361840731f3ca186e78052dde0158ef4b016a53d.jpg",
"checksum": "3b12e73a6e44798f8ce4c6016828eb21"
}
]
}