{
"source_article_link": "https://www.firstpost.com/india/over-4000-people-rescued-by-security-forces-from-karnatakas-kodagu-several-others-suspected-to-be-stranded-in-hilltop-villages-4998231.html",
"title": "Over 4,000 people rescued by security forces from Karnataka's Kodagu; several others suspected to be stranded in hilltop villages",
"date_published": "2018-08-20T09:41:39+05:30",
"source_type": "news_article",
"source_name": "FirstPost",
"image_link": [
"https://images.firstpost.com/wp-content/uploads/2018/08/AP18230455383876-380.jpg"
],
"article_body": "Kodagu (Karnataka): A total of 4,225 marooned people have been rescued so far in Karnataka's flood-hit Kodagu district even as incessant rains continued to hamper relief work, said an official on Sunday. \"Though the intensity of rainfall has reduced, the rainfall remained unabated. As of 3 pm, 4,225 people in Kodagu district have been rescued and brought to safety through joint operations by state and central agencies,\" a statement from the state disaster management authority said. Of the rescued, 3,601 are staying in 36 relief shelters in the district. Representational image AP The unabated rains, leading to flooding and landslips, have claimed eight lives so far in the region, the statement added. The authorities, however, did not reveal the number of people stranded across the hilly district as communication lines were snapped due to landslides and damage to networks. Several hundreds are suspected to be stranded in the district's towns and villages on hilltops, which have been cut off due to landslides and damaged roads. Located in the Western Ghats mountain ranges, this coffee-growing district, about 270 km from Bengaluru, is the worst-hit due to the south-west monsoon rains since June first week. About 123 km of roads are estimated to be damaged due to the rains, while more than 800 homes have been destroyed. Most of the district's arterial roads have been damaged due to landslides, delaying the rescue operations, officials said. The heavy rains in coastal district of Dakshina Kannada have claimed one life, forcing nearly 800 people to live in temporary shelters, the statement added. Over 60 people have been stranded in Mukkodlu village of Kodagu district, but airlifting them has not been possible due to the bad weather, Chief Minister HD Kumaraswamy had earlier said. About 50 Dogra Regiment soldiers, 12 expert naval divers, 62 officials from the National Disaster Response Force (NDRF), 750 fire services officials and Home guards with boats and hundreds of volunteers have been carrying out relief work in the district. In all, 1,194 specialised rescuers from state and central agencies are on job. \"Bread and other dry eatables and rations have been airdropped in the inaccessible villages of the district,\" the statement said. The Chief Minister on Sunday toured across the district and visited relief camps and affected villages in the district. Revenue Minister RV Deshpande, Public Works Department (PWD) Minister HD Revanna and district in-charge minister Sa Ra Mahesh visited the villages and towns severely affected by the flood. About 300 people were rescued on Saturday, including 30 senior citizens and 50 children. Hundreds of volunteers from state capital Bengaluru and across the state have been gathering relief material, including dry food, water, milk, clothing, medicines, etc., which are being sent to those in the temporary shelters. Over the last 24 hours, the district received an average rainfall of 5.4 cm, according to the India Meteorological Department (IMD). Few parts of the district received rain upto 11.5 cm. The rainfall, however was \"moderate\" from the earlier \"very heavy\" rains the district received till Friday, the IMD said. The water being released from Harangi reservoir in the district across Harangi river, one of Cauvery's tributaries, has been adding to the flooding of towns and villages in the region. The state-run Karnataka State Road Transport Corporation (KSRTC) on Sunday resumed all its intra-state bus services towards Kodagu and Mangaluru and inter-state services towards Kerala. The bus services were suspended in the past few days to Kodagu, Mangaluru and flood-hit Kerala due to the landslips and damaged roads caused by the rains. The South Western Railway's (SWR) train services were, however, cancelled or partially suspended and diverted between Yesvantpur in Bengaluru and Kochuveli in Thiruvananthapuram, Mangaluru to Karwar in Uttara Kannada due to landslides and floods. The SWR on Sunday transported relief material including water, food, milk and clothing for thousands of people living in shelters in neighbouring Kerala via train from Bengaluru.",
"description": "Kodagu (Karnataka): A total of 4,225 marooned people have been rescued so far in Karnataka's flood-hit Kodagu district even as incessant rains continued to hamper relief work, said an official on Sunday. \"Though the intensity of rainfall has reduced, the rainfall remained unabated. As of 3 pm, 4,225 people in Kodagu district have been rescued and brought to safety through joint operations by state and central agencies,\" a statement from the state disaster management authority said. Of the rescued, 3,601 are staying in 36 relief shelters in the district. Representational image AP",
"time_scraped": "2018-08-20 12:02:15.670334",
"article_id": "4998231",
"article_category": "India",
"image_details": [
{
"url": "https://images.firstpost.com/wp-content/uploads/2018/08/AP18230455383876-380.jpg",
"path": "full/95a05b7f725a09d631a1123ea4ac160e45177238.jpg",
"checksum": "39ebb12add1278381cf72fef57977a06"
}
]
}