{
"source_article_link": "https://timesofindia.indiatimes.com/india/how-siddaramaiah-ended-up-praising-narendra-modi/articleshow/64077511.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "How Siddaramaiah ended up 'praising' Narendra Modi",
"date_published": "2018-05-08T18:49:31+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI:made a rather comical faux pas on Tuesday when he inadvertently praised Narendra Modi -- clearly a sign that the Prime Minister is foremost on his mind. Of course, that was not his intention. He was actually meaning to applaud the achievements of party candidateand was seeking votes for him when this slip of the tongue occurred.This is what the chief minister said - “In all the villages, work on roads, drinking water, building houses, all this is possible because of Narendra Modi and us….” He was immediately interrupted by Swamy, who looked sheepishly amused.Upon realising his mistake, the chief minister corrected himself saying, “Sorry, sorry...Narendra Swamy….the important word is Narendra.”Attempting to fix the situation, he went on to add, “The Swamy is here, the Modi is there in Gujarat. Narendra Modi is fiction, Narendra Swamy is truth.\"The crowd’s reaction, predictably, was one of amusement and even those sharing the dais with the chief minister couldn't resist smiling.With this gaffe today. Siddaramaiah joined the likes of BJP president Amit Shah, who made a similar blunder while on the campaign trail in March this year. Shah then embarrassed state president B S Yeddyurappa by saying his was the most corrupt government ever. Shah was rattling allegations against the Siddaramaiah government, and inadvertently said: “Recently a retired Supreme Court judge said if there was ever a competition of the most corrupt government then the Yeddyurappa government is number one...” shocking Yeddyurappa and the BJP leadership.Shah was immediately corrected by Yeddyurappa and BJP MP Pralhad Joshi who whispered into Shah’s ear: “Siddaramaiah government,” following which the BJP chief said: ”arre re...Siddaramaiah government is number one in corruption.”Siddaramaiah had then taken a jab at his rival by citing that the BJP’s own national president had termed Yeddyurappa as the most corrupt government. His own words have now come back to haunt him.",
"description": "Siddaramaiah was meaning to applaud the achievements of party candidate Narendra SwamyIn a slip of the tongue, he ended up 'praising' Narendra Modi instead",
"time_scraped": "2018-08-16 01:35:00.614324",
"article_id": "64077511",
"article_category": "IndiaNews",
"image_details": []
}