{
"source_article_link": "https://timesofindia.indiatimes.com/india/siddaramaiah-seeks-votes-for-narendra-modi!/articleshow/64090006.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Siddaramaiah seeks votes for ‘Narendra Modi'!",
"date_published": "2018-05-09T10:46:31+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64090126,imgsize-60684,width-400,resizemode-4/64090126.jpg"
],
"article_body": "MANDYA: The ongoing high pitched verbal duel with PMseems to be on CM Siddaramaiah’s mind, so much so that while campaigning forcandidate PM, he praised Narendra Modi instead!Siddaramaiah, who was intown on Tuesday at a roadshow for Congress candidate Narendraswamy, inadvertently praised Narendra Modi for doing a commendable job in providing basic amenities in Malavalli constituency.The gaffe brought back memories ofpresident Amit Shah calling the Yeddyurappa government “number one in corruption” at a press conference in Marchend. Prompted by Yeddyurappa, who sat next to him, and other leaders, Shah quickly corrected himself to slam thegovernment.On Tuesday, Siddaramaiah erroneously mentioned Modi twice, much to Narendraswamy’s embarrassment. “If it was true that the works of roads, concrete roads, drainages, drinking water, building of houses were done, it is because Narendra Modi and our government... Sorry, sorry it is because of Narendraswamy,” Siddaramaiah quickly corrected himself. He continued, “Every vote which is cast in favour of Narendra Modi means that those votes were given to me”.Siddaramaiah was nudged by a perplexed Narendraswamy and other leaders beside him. The CM quickly clarified that he meant to refer to Narendraswamy and tried to wriggle out of the situation, saying, “‘Narendra’ is important. Narendraswamy is here... Modi is there in Gujarat. Narendra Modi is fictional and Narendraswamy is the truth,” he said to laughter all around.",
"description": "MANDYA: The ongoing high pitched verbal duel with PMseems to be on CM Siddaramaiah’s mind, so much so that while campaigning forcandidate PM, he praised Narendra Modi instead!Siddaramaiah, who was in",
"time_scraped": "2018-08-16 01:34:57.206974",
"article_id": "64090006",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64090126,imgsize-60684,width-400,resizemode-4/64090126.jpg",
"path": "full/3cdefc77036a1b36744d3c00229321ad32350ac7.jpg",
"checksum": "f146635816c3e33fd45cc6f6c68eb50e"
}
]
}