{
"source_article_link": "https://timesofindia.indiatimes.com/india/earthquake-tremors-felt-in-delhi-ncr/articleshow/64095205.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "6.2-magnitude quake strikes Afghanistan, tremors felt in Delhi-NCR",
"date_published": "2018-05-09T18:09:24+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64095519,imgsize-329347,width-400,resizemode-4/64095519.jpg"
],
"article_body": "NEW DELHI: A magnitude 6.2 earthquake struck today afternoon in northern , sending tremors that were felt in Pakistan and parts of north India.   The earthquake shook buildings in Afghan capital , but there were no immediate reports of damage or casualties, reported Reuters. People in Delhi and the NCR region reported feeling light earthquake tremors. The quake was felt at about 4:15 pm today in the states of Punjab, Haryana and Jammu and Kashmir, a MeT Department official said. \"The intensity of the earthquake, which had its epicentre in Afghanistan-Tajikistan border, measured 6.2 on the Richter Scale,\" the official said. There were no reports of loss of life or damage to property, government officials said. News agency ANI reported that the Kashmir Valley was also jolted by the quake.   According to the United States Geological Survey (USGS), the earthquake occured near Afghanistan's border with Tajikistan in the Hindu Kush mountains, 36 km north-west of Ishkashim and at a depth of 111.9 km. It was the second to shake Afghanistan today. The tremors were felt in \"most parts\" of the -prone country, said Mohammad Omar Mohammadi, spokesman for the national disaster management ministry. In the eastern province of Khost, two children were injured when the roof of a house collapsed, Mohammadi said. In neighbouring Pakistan's city of Peshawar near the Afghan border, people rushed into the streets following the tremor, fearing aftershocks, witnesses told AFP. Earlier in the day, a magnitude 5.1 rattled parts of eastern Pakistan, near the border with Afghanistan. That quake caused a stampede at a school in the northwestern city of Bannu, injuring at least 10 students, according to a local police official.",
"description": "The quake of magnitude 6.2 occured in northern Afghanistan along its border with Tajikistan In India, tremors were felt in Delhi-NCR, and the states of Punjab, Haryana and Jammu and Kashmir There have been no reports of loss of life or damage to property so far",
"time_scraped": "2018-08-16 15:00:29.529129",
"article_id": "64095205",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64095519,imgsize-329347,width-400,resizemode-4/64095519.jpg",
"path": "full/87a7df63d5de6b5300481936ea3d975e544df3f7.jpg",
"checksum": "e9db1d4c9a7e3e7771e8b606e5dc63c7"
}
]
}