{
"source_article_link": "https://timesofindia.indiatimes.com/india/thunderstorm-squall-likely-in-north-india-hill-states-tomorrow-india-meteorological-department/articleshow/64136429.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Thunderstorm, squall likely in north India hill states on Sunday: India Meteorological Department",
"date_published": "2018-05-13T17:25:29+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64136446,imgsize-30740,width-400,resizemode-4/64136446.jpg"
],
"article_body": "NEW DELHI: Uttarakhand, Jammu and Kashmir and Himachal Pradesh are likely to witness accompanied with squall, while parts of Rajasthan might see dust over the next two days, the said on Saturday. Thunderstorm over these hill-states states and its subsequent effect on plains in north Indian is due to a new western disturbance from tomorrow. Western disturbance originates in the Mediterranean Sea that brings sudden rains to northwestern parts of India. Thunderstorm accompanied with squall with wind speed reaching 50-70 kilometres per hour are \"very likely\" at isolated places over east Uttar Pradesh, Assam, Meghalaya, Nagaland, Manipur, Mizoram, Tripura, Gangetic West Bengal, Odisha and Jharkhand, it said. \"Thunderstorm accompanied with gusty winds also very likely at isolated places over Punjab, Haryana, Chandigarh, Delhi, west Uttar Pradesh, Vidharbha, Chhattisgarh, Bihar, Telangana, north coastal Andhra Pradesh, south interior Karnataka, Tamil Nadu, Puducherry, Lakshadweep and Kerala,\" an Indian Meteorological Department (IMD) advisory said. Heat wave conditions are very likely at one or two pockets over Rajasthan, west Madhya Pradesh and Vidharbha. Several states in north India have witnessed erratic weather pattern over the fortnight. Uttar Pradesh and Rajasthan have alone witnessed over 120 deaths due to thunderstorm and violent winds in the first week of May.",
"description": "NEW DELHI: Uttarakhand, Jammu and Kashmir and Himachal Pradesh are likely to witness accompanied with squall, while parts of Rajasthan might see dust over the next two days, the said on Saturday. Thunderstorm over these hill-states states and its subsequent effect on plains in north Indian is due to a new western disturbance from tomorrow.",
"time_scraped": "2018-08-17 15:00:16.896721",
"article_id": "64136429",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64136446,imgsize-30740,width-400,resizemode-4/64136446.jpg",
"path": "full/5cc02d2900af1081a6bf31f292d8e9375001aa41.jpg",
"checksum": "322da7585d337664b6ef59e71f143236"
}
]
}