{
"source_article_link": "https://timesofindia.indiatimes.com/india/mumbai-cop-himanshu-roys-battle-with-cancer-began-in-early-2000s/articleshow/64130531.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Mumbai cop Himanshu Roy's battle with cancer began in early 2000s",
"date_published": "2018-05-12T10:47:06+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64130530,imgsize-37038,width-400,resizemode-4/64130530.jpg"
],
"article_body": "MUMBAI: One of Mumbai police force's most decorated officers, (54), ended his life on Friday after a long battle with . Roy, who held a series of key posts and helmed several crucial investigations before going on medical leave in 2016, shot himself in the mouth with a licenced private revolver at his residence near . \"His family was preparing to have lunch. Roy was in the bedroom while his wife, Bhawana, was in another room when he shot himself,\" said a police officer. Roy was rushed to in a car by his wife and their domestic staff, where he was declared dead. A signed suicide note has been found in which Roy admitted to being in a depressed frame of mind due to his illness and wanted no one held responsible for his actions. An IPS officer of the 1988 batch, Roy rose through the ranks to become one of the force's most visible faces in the city. A fitness freak, he stood out for his physique. Roy's other passion was Hindustani classical music which he helped promote by organising concerts at his alma mater, . In 2009, he was promoted to additional commissioner for south Mumbai, a highprofile post that marked the beginning of a phase during which he was entrusted with a range of sensitive cases. Roy investigated the IPL betting scam, the J Dey murder and the Shakti Mill rape. Reacting to his death, retired Mumbai police chief M N Singh said the relentless pressure of the job had taken a toll on the health of Roy, whose cancer battle began in the early 2000s. He was confined to his house the last few months. The entire police brass had gathered at the Bombay Hospital within an hour of the incident. \"It's a great loss to Mumbai police. He was an energetic and dynamic officer loved by his staff,\" said former DGP Arup Patnaik.",
"description": "MUMBAI: One of Mumbai police force's most decorated officers, (54), ended his life on Friday after a long battle with . Roy, who held a series of key posts and helmed several crucial investigations before going on medical leave in 2016, shot himself in the mouth with a licenced private revolver at his residence near . \"His family was preparing to have lunch. Roy was in the bedroom while his wife, Bhawana, was in another room when he shot himself,\" said a police officer.",
"time_scraped": "2018-08-18 06:00:31.112811",
"article_id": "64130531",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64130530,imgsize-37038,width-400,resizemode-4/64130530.jpg",
"path": "full/c2ff2f503574da161e28189f7abd3dbb2ef3ff06.jpg",
"checksum": "cf7e54f555bd418cb663d3a0704babea"
}
]
}