{
"source_article_link": "https://timesofindia.indiatimes.com/india/karnataka-election-results-key-takeaways/articleshow/64172937.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Karnataka election results: Key takeaways",
"date_published": "2018-05-15T18:41:11+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64173113,imgsize-410417,width-400,resizemode-4/64173113.jpg"
],
"article_body": "It seems the has no counter to the Modi juggernaut. Some opinion polls in April showed Congress in the lead while others predicted that the will fall short of the majority mark. Then in May, PM Modi began a campaign blitzkrieg in during which he addressed as many as four election rallies in a single day. By firing off one scathing salvo after another against the ruling Congress and peddling populist promises at these rallies, PM Modi single-handedly bolstered the BJP's prospects in Karnataka and opened up the party's gateway to southern India.  Rahul Gandhi has yet to register a major victory since taking up the mantle of Congress president and a string of electoral setbacks will not imbue the party with confidence in his leadership. In Karnataka, his \"soft Hindutva\" approach and visits to mutts and temples failed to deliver the desired results. Further, not acknowledging the PM's challenge to \"speak without a paper for 15 minutes\" is akin to running away and doesn't create a favourable impression on the voters. While he may have successfully shed the image of reluctant politician, the Gandhi scion needs to put in more work to match up to the charisma of .  The Congress party's political footprint has been shrinking since the 2014 election. It did measure a degree of success in Rajasthan and Madhya Pradesh bypolls by snatching seats from the BJP but has been unable to follow through in high-stakes assembly elections. The only state where it won in a direct contest with the BJP is Punjab. As the final results in Karnataka trickle in, Congress party's hold remains on only three states and if this trend continues, the saffron party's catchphrase of 'Congress-free Bharat' may become a very real possibility. It’s an open secret that Congress, which has lost power in almost all major states, banked heavily on Karnataka to meet its expenses. And that is precisely why BJP went all-out against the Congress in Karnataka in a bid to choke its funding supply in the run-up to the 2019 Lok Sabha polls. Defeat in Karnataka is not only a hit to Congress's prestige but also entails the loss of a crucial source of funding for the cash-strapped party.   While the Modi-led BJP beat on the drum of nationalism during its Karnataka poll campaign, CM Siddaramaiah chose to play up regional issues. He attempted to fracture the BJP's Lingayat voter base by recommending that they be recognised as a minority religion, a demand the community has raised for many years. He attacked PM Modi over the delay in implementing the Supreme Court verdict on the Cauvery dispute. However, the once again favoured the BJP while the JD(S) was leading in parched southern Karnataka where the Cauvery row is a polarising factor. Former Prime Minister HD Deve Gowda's JD(S) was reviled by both Congress and BJP in the run-up to the assembly election, with Rahul Gandhi describing it as the saffron party's 'B team' and PM Modi asking people not to \"waste\" their votes on the party. Now, with neither party breaching the majority mark, the JD(S)-BSP combine with its 40-odd seats may get to play kingmaker. Earlier today, West Bengal CM Mamata Banerjee said the poll outcome would have been \"very different\" and the Congress would have fared better if it had allied with the JD(S).",
"description": "In an upset for the Congress, the BJP was headed for a simple majority in Karnataka, where it was leading in 109 seats as per latest counting trends. As Congress stares at yet another defeat at the hands of the BJP and contemplates the possibility of a crucial state slipping away from its grasp, here's a look at the key takeaways from the Karnataka assembly election results:",
"time_scraped": "2018-08-20 09:00:38.731223",
"article_id": "64172937",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64173113,imgsize-410417,width-400,resizemode-4/64173113.jpg",
"path": "full/35107f599eab7470086a32cf9f0625b1a2acb250.jpg",
"checksum": "7e3e1ab924e27fcbf2be55dbc9808a0f"
}
]
}