{
"source_article_link": "https://timesofindia.indiatimes.com/india/tamil-nadu-tectonic-shift-e-palaniswami-o-panneerselvam-among-first-to-greet-pm-modi/articleshow/64183287.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Tamil Nadu tectonic shift? E Palaniswami, O Panneerselvam among first to greet PM Modi",
"date_published": "2018-05-16T06:14:44+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64183284,imgsize-49353,width-400,resizemode-4/64183284.jpg"
],
"article_body": "CHENNAI: Despite being coy about its relationship with BJP, chief minister and deputy chief minister were among the first to congratulate Prime Minister on the party's \"victory\" in the polls, much before the official results were out. Panneerselvam, the coordinator, went a step further to wish president for \"bellweathering a grand entry into South India\". The leaders were trolled in social media for their \"hearty wishes,\" even as the dramatic developments unfolded in Congress and JD(S) camps in Bengaluru. \"I would like to share my joy on this momentous occasion and convey my heartiest congratulations on the resounding victory of BJP in Karnataka elections. Your diligent and conscientious efforts not only yielded the desired fruits in the 15th state but also added another feather in your cap of glory,\" Panneerselvam said in a letter to Modi, which he later posted in his official twitter handle. The state information department, however, chose not to release the letter to the media. An official statement of the CM, congratulating the PM was, however, released to the media. State fisheries minister D Jayakumar, however, was less effusive. Refusing to react to OPS' greetings to Modi, he merely said, \"Whoever comes to power in Karnataka, we want them to comply with the orders of the Supreme Court and release water. That is the expectation of the people of .\" Not long ago, the AIADMK leaders had no difficulty getting an appointment with the PM or senior ministers. But, the first signs of strains surfaced soon after the R K Nagar bypoll results were out in December last year. Neither Panneerselvam nor Palaniswami got an appointment with Modi since. While AIADMK leaders privately admit that Panneeselvam's gushing congratulatory message were \"his own\". observers point out it was a token of gratitude for BJP's tacit backing of the AIADMK government. With the opposition intensifying its Cauvery protests, the EPS government and senior AIADMK leaders soon joined in. In March, Panneerselvam took a jibe at the saffron party, saying no national party would find space in Tamil Nadu. Stepping up its rhetoric against the BJP after the Centre's failure to comply with the SC order in Cauvery, and the protests intensifying in the state, AIADMK ministers were on record to say that \"there was no space for saffron\" in Tamil Nadu.",
"description": "CHENNAI: Despite being coy about its relationship with BJP, chief minister and deputy chief minister were among the first to congratulate Prime Minister on the party's \"victory\" in the polls, much before the official results were out. Panneerselvam, the",
"time_scraped": "2018-08-20 09:00:24.928973",
"article_id": "64183287",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64183284,imgsize-49353,width-400,resizemode-4/64183284.jpg",
"path": "full/fbeb8affb7a893328977011b9d8d36fbd668921c.jpg",
"checksum": "f104d41ddf31e42f4bf4ae415af14c2f"
}
]
}