{
"source_article_link": "https://timesofindia.indiatimes.com/india/supreme-court-justifies-its-verdict-on-sc/st-act/articleshow/64193565.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Supreme Court justifies its verdict on SC/ST Act",
"date_published": "2018-05-16T19:59:16+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64193561,imgsize-63443,width-400,resizemode-4/64193561.jpg"
],
"article_body": "NEW DELHI: Theon Wednesday justified its March 20 verdict on the SC/ST Act, saying even Parliament cannot allow the arrest of a person without a fair procedure and asserted that it has protected the fundamental rights to life and liberty of innocents by ordering prior scrutiny of complaints.The Centre opposed the verdict saying that courts cannot order to supplant or substitute a provision in the law enacted by the Parliament.A bench of Justices Adarsh Goel and U U Lalit said, \"we are not living in a civilised society, if we allow an innocent to go behind bar on a one-sided version\".The bench deferred the hearing of the matter after the summer vacation and said it would hear all the parties concerned in detail.Justice Goel, who is heading the bench will retire on July 6, 2018, soon after the court reopens after summer vacation on July 2.During the hearing, the bench said, \"There are series of judgements which say that Article 21 (Right to life and liberty) of the Constitution has to be dealt in every provision. Article 21, cannot be denied even by Parliament. Even our Constitution does not allow the arrest of an individual without a provision\".Attorney General, appearing for Centre, cited various apex court verdicts and said that courts cannot supplant or substitute or fill in the gap of the provisions in a law enacted by the Parliament.\"In March 20 verdict, we have dealt previous verdicts of this court which said that Article 21 needs to be protected. Without scrutiny, how can we allow arrest of an individual on a one-sided version,\" the bench said.The top court said that fundamental rights of an individual cannot be protected if an innocent is jailed on a complaint without its prior scrutiny.\"No Parliament can allow arrest without a fair procedure. Fundamental right to life and liberty cannot be denied even by the Parliament. Otherwise, we are not living in a civilised society, if we allow arrest of an innocent,\" it said.Venugopal said that the Constitution and various apex court verdicts dealt with fundamental right to life and right to dignity.\"Right to dignity is also associated with Right to Job but from where in a developing economy can we provide jobs to everyone. In the welfare state concept, it is very difficult and courts have to look into every aspect,\" the Attorney General said and added that there were various verdicts of courts which were inconsistent to each other.The bench, while referring tocase of 1995 that had dealt with a process of verification of caste certificate, said the court had carved out a complete machinery as there was no existing procedure in place.\"Constitutional courts have to ensure life, liberty and fair procedure to everyone in the society. Courts have power to ensure that fundamental right of an individual are not trampled upon,\" it said.The bench said that due to paucity of time, the arguments cannot be completed and deferred the matter for further hearing after summer vacation saying the apex court registry will give the next date of hearing.On May 3, the apex court had rejected the Centre's demand for a stay on its verdict on the SC/ST Act and said it favoured \"100 per cent\" the protection of the rights of these communities and punishing those guilty of atrocities against them.It had also strongly disagreed with the Centre's contention that its March 20 verdict had led to the loss of lives in the violence that had broken out later in several states.The top court had said under the Scheduled Castes and Tribes (Prevention of Atrocities) Act, 1989, theoretically a person cannot get anticipatory bail, but soon after his arrest, he can get regular bail even in offences where the punishment is just six months.It had clarified that the court has not asked for non-registration of an FIR for the offences under the SC/ST Act, but sought verification before registration of FIR, so that innocents do not get penalised.The apex court had on March 20 said that on \"several occasions\", innocent citizens were being termed as accused and public servants deterred from performing their duties, which was never the intention of the legislature while enacting the SC/ST Act.Several states were rocked by wide spread violence and clashes following a '' call given by several SC/ST organisations protesting the top court's March 20 order, that claimed eight lives.",
"description": "NEW DELHI: Theon Wednesday justified its March 20 verdict on the SC/ST Act, saying even Parliament cannot allow the arrest of a person without a fair procedure and asserted that it has protected the fundamental rights to life and liberty of innocents by ordering prior scrutiny of complaints.The Centre opposed the verdict saying that courts cannot order to supplant or substitute a provision in the law enacted by the Parliament.A bench of Justices Adarsh Goel and U U Lalit said, \"we are not living in a civilised society, if we allow an innocent to go behind bar on a one-sided version\".The bench deferred the hearing of the matter after the summer vacation and said it would hear all the parties concerned in detail.",
"time_scraped": "2018-08-16 05:27:11.980100",
"article_id": "64193565",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64193561,imgsize-63443,width-400,resizemode-4/64193561.jpg",
"path": "full/c63051467d659be130c9a4218620c015cd481fa9.jpg",
"checksum": "a31d80d50a93a02f59c96c35393668e6"
}
]
}