{
"source_article_link": "https://timesofindia.indiatimes.com/india/only-saving-state-nation-hd-kumaraswamy/articleshow/64200985.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Only saving state & nation: HD Kumaraswamy",
"date_published": "2018-05-17T11:13:05+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64201033,imgsize-400554,width-400,resizemode-4/64201033.jpg"
],
"article_body": "BENGALURU: Chief ministerial candidate of the JD(S)- combine HD on Wednesday alleged that the offered Rs 100 crore and ministerial berths to some of his party MLAs to switch to the saffron party. “BJP leaders have been contacting some of our MLAs and offering money and berths to join hands with them. The governor should stop this,” Kumaraswamy said, after being elected JD(S) legislature party leader on Wednesday. He warned that he was s also capable of engineering a split in BJP if the latter continued with its efforts to woo JD(S) MLAs. Stating that he is not happy about becoming CM as he is not the choice of the people, Kumaraswamy said he has accepted the responsibility to save the state and nation from divisive forces. “There is a feeling that I am in a hurry to become CM. But that is not true. I did not go to anybody seeking support. The situation has made the Congress and JD(S) join hands. In fact, it is BJP which is in a hurry as they are trying to form the government with no numbers. I have the support of 117 MLAs,” he added. Kumaraswamy said he chose to go with Congress as he did not want to hurt his father, former PM HD . “My decision was a black spot on my father’s political career. I don’t want to repeat the mistake,” he said. He indirectly blamed Congress for BJP’s good show. “BJP managed to win because of efforts of some leaders who tried to finish off JD(S),” he said.",
"description": "BENGALURU: Chief ministerial candidate of the JD(S)- combine HD on Wednesday alleged that the offered Rs 100 crore and ministerial berths to some of his party MLAs to switch to the saffron party. “BJP leaders have been contacting some of our MLAs and offering money and berths to join hands with them. The governor should stop this,” Kumaraswamy said, after being elected JD(S) legislature party leader on Wednesday.",
"time_scraped": "2018-08-21 00:00:31.726065",
"article_id": "64200985",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64201033,imgsize-400554,width-400,resizemode-4/64201033.jpg",
"path": "full/e2ee23d08f622edc27465a0cc93ee7410a9fffdb.jpg",
"checksum": "595511d8fd101090763c8f1e3bf9d9ef"
}
]
}