{
"source_article_link": "https://timesofindia.indiatimes.com/india/karnataka-assembly-election-top-developments/articleshow/64221926.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Karnataka floor test: Top developments",
"date_published": "2018-05-18T23:44:14+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64225482,imgsize-329659,width-400,resizemode-4/64225482.jpg"
],
"article_body": " \"Of course they are with us, if the MLAs from Congress and JD(S) don't support us, how can we prove majority? We will win the floor test 101 per cent. We are in the Shangri-La hotel for the legislature meeting. We have the majority. More than what we expected. Our workers are really happy.\" \"Two MLAs have been abducted by our BJP friends. But, I am certain that they will come back to us,\" said Kumaraswamy. \"MLAs are with us. Whatever misuse they had to do they have done. Supreme Court has also given them a good scolding not verbally but in terms of action, it is a different matter that the people of BJP have a thick skin.\" \"Karnataka Congress Legislature Party met in Hyderabad and unanimously elected Shri Siddaramaiah as the leader of the CLP as per the directions of Congress president Shri Rahul Gandhi,\" Karnataka Congress said in a tweet.   Karnataka Congress on Friday alleged that BJP leader G Janardhan Reddy is trying to \"poach\" a Congress MLA from Raichur by \"offering money and post\" In an audio clip, released in front of the media, the Congress party alleged that Reddy has claimed that he has the backing of BJP president Amit Shah \"for doing horse-trading\".   Late in the night, the Karnataka Pradesh Congress Committee (KPCC) filed a complaint and demanded action against BJP's Janardhan Reddy for offering hundreds of crore rupees and a minister portfolio to Raichur rural MLA Basvanagowda Daddal through telephone, reported ANI. Late in the evening, the Congress filed a petition in the SC to challenge the governor's decision to appoint Bopaiah as the pro-tem speaker of the assembly. Supreme Court will hear Congress's plea tomorrow at 10.30 am. “What the BJP has done is against the rulebook. Ideally the senior most leader is supposed to hold that position,” said Congress leader Abhishek Manu Singhvi. \"KG Bopaiah was appointed as Pro-tem speaker even in 2008 by the then governor. That time Bopaiah was 10 years younger than what he is today. Congress is thus raising hoax objection. The appointment of Bopaiah Ji is as per rules and regulations,\" said BJP leader Prakash Javadekar. Following the apex court’s order, governor Vala appointed BJP MLA KG Bopaiah as pro-tem speaker ahead of floor test tomorrow. The Supreme Court hearing a petition filed by the Congress-JD(S) regarding governor Vajubhai Vala's invitation to the BJP to form a government in Karnataka earlier today ordered that floor test in the Karnataka assembly be held at 4 PM on Saturday. \"It is better to hold floor test on Saturday and not give any time to anyone rather than go into legality of governor's decision to invite BS Yeddyurappa,\" the bench of justices AK Sikri, SA Bobde and Ashok Bhushan said said during the proceedings. SC said it will order DGP to make proper arrangements for floor test on Saturday. SC barred the governor from nominating any Anglo-Indian community member as MLA till the floor test is over. It asked the Yeddyurappa government to refrain from taking any major policy decision till the floor test is concluded. The court directed the DGP to take all measures to keep things under control outside the assembly so the floor test is conducted smoothly inside the House. The order reduced the 15-day time given by the governor earlier to the newly-appointed chief minister BS Yeddyurappa to 28 hours.  During the hearing, senior advocate appearing for Yeddyurappa, Mukul Rohatgi, handed over two letters stating that Yeddyurappa has been elected as leader of BJP, the largest party in the Karnataka assembly and that he has the support of the necessary number of MLAs. Rohatgi added that there was no need for Yeddyurappa to give names of all MLAs to the governor as he is ready to prove majority on the floor of the House. He revealed that BJP would receive support from legislators belonging to Congress and JD(S) and the letters written by Congress-JD(S) does not show signs of each and every MLA declaring its support to the post-poll alliance. Senior advocate Abhishek Manu Singhvi, representing the Congress, asked the court to decide which party should get the chance to prove majority first. He asserted that Congress-JD(S) is ready for a floor test on Saturday, without any delay. He went on to say that there should be videography and proper security provided to legislators so they may vote fearlessly. \"Today’s Supreme Court order, vindicates our stand that Governor Vala acted unconstitutionally. The BJP’s bluff that it will form the Govt., even without the numbers, has been called out by the court. Stopped legally, they will now try money & muscle, to steal the mandate.\" “As per the directions of Supreme Court, we are expected to prove our majority tomorrow. We are sending our file to Karnataka governor to call an assembly session at 11 am tomorrow. We are going to prove majority.”  \"All of our MLAs are together. We have an understanding. Despite this being reality, despite they (BJP) not asking for 15 days, the governor has given them 15 days to prove majority. What inference could one draw?\" Siddaramaiah said. \"Governor has followed Narendra Modi and Amit Shah's instructions. If he had followed constitution, he would not have taken such decision,\" he said. “BJP wanted that vote of confidence should be done via secret ballot. But, Supreme Court has written in its order that there shall be no secret ballot in proving vote of confidence tomorrow.” “If we are given a chance, we can easily clear the floor test. We have a total of 111 MLAs and some unhappy JD(U) MLAs are in contact with us. We don't have MLAs in our party or alliance who will take U-turn like Nitish Kumar.” Earlier today, Yadav and other alliance leaders met Bihar governor Satyapal Malik and handed over letters stating that RJD is the single largest party and hence should be invited to form the government.  Thirteen Congress MLAs at Raj Bhavan handed over the memorandum to governor Mridula Sinha saying Congress is the single largest party in the state  Early on Friday morning, Congress and JD(S) MLAs reached Hyderabad in three buses after alleging that security was removed from Bengaluru's Eagleton Resort where they had been camping amid fears of poaching by BJP.",
"description": "The drama over government formation in Karnataka continued for the fourth consecutive day with the SC setting the tone by ordering a floor test as early as 4 pm on Saturday. Both, the BJP and the Congress-JD(S) camp expressed confidence in winning the trust vote. Here is a look at all the top developments from the day:",
"time_scraped": "2018-08-19 18:00:10.432348",
"article_id": "64221926",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64225482,imgsize-329659,width-400,resizemode-4/64225482.jpg",
"path": "full/1b9c576283a5c7e794972cc9f38c76ba63736a98.jpg",
"checksum": "29f0cbcd09b564d9b303ab0add1d7f2e"
}
]
}