{
"source_article_link": "https://timesofindia.indiatimes.com/india/bs-yeddyurappa-resigns-for-third-time-in-his-political-career-before-trust-vote/articleshow/64237402.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "BS Yeddyurappa resigns before trust vote for third time in his political career",
"date_published": "2018-05-19T23:12:46+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64237403,imgsize-806414,width-400,resizemode-4/64237403.jpg"
],
"article_body": "BENGALURU: For the third time in his political career, and the shortest tenure of 56 hours as CM, chief minister from his post even before a trust vote was moved. After a hectic week of political developments, trying to muster the numbers by approaching “like-minded” MLAs from the and JD(S) coalition to join him, resigned to the fact that could not form the government and stepped down from his post. But before announcing his resignation, in his classic style of using emotions to justify the reasons for resigning, Yeddyurappa said: “Unlike others, who asked people to vote him into power to save his life, I will continue to give my life to serve the people of this state with or without power.” But his resignation was not without a “veiled” warning that Karnataka may face a mid-term poll or even see the fall of the Congress-JD(S) government. “I am still hale and healthy and have good 10 years left. I will come back for the next elections, perhaps even before that, to fulfill the promises that I have made to the people and the farmers of the state,” he said. No sooner did Yeddyurappa resign, the opposition camp started making plans for their chief ministerial candidate HD to take oath. Accordingly, Kumaraswamy said he will be , as the next CM. In a 20-minute speech, Yeddyurappa tried to project his never die attitude even in despair and continued to exude confidence in Prime Minister Narendra Modi and BJP national president Amit Shah juggernaut to help him save his legacy. “Under the leadeship of PM Modi and our national president Amit Shah, we will win the 28 parliamentary seats in the state in 2019 and prove that the people’s mandate is with us. We will come back with renewed strength,” he said. Yeddyurappa said he will be immediately embarking upon a statewide tour to reiterate the peoples’ mandate and repay the love and affection that the 6.5 crore people have given him. The CM lamented that if only people had given him 113 seats things would have been different. “However, it appears God had other plans,” he added. Earlier in the day, a deflated BJP camp and Yeddyurappa put up a brave face after realising that they will continue to remain in the opposition despite being the single largest party in the state. With the Congress and JD(S) numbers of 117 intact, the mood in the opposition camp was upbeat and positive. At 10.45 am, 76 Congress MLAs including their legislature party leader Siddaramaiah arrived at the assembly after an overnight journey from Hyderabad. They were later followed by JD(S) MLAs led by their legislature party leader and CM apparent HD Kumaraswamy, who arrived at 11.05am to the house. All eyes were on two Congress MLAs, Anand Singh (Vijayanagara) and Pratapgouda Patil (Maski), who had abandoned the coalition camp and were rumored to be with the BJP. While the Congress-JD(S) coalition were not “overly worried”, considering they had more than sufficient numbers to defeat the Yeddyurappa trust vote, the BJP were still hoping for a “miracle”. During his speech, Yeddyurappa himself admitted that he had personally gotten in touch with MLAs from the opposition camp. “I admit that I had gotten in touch with MLAs to ensure that a stable BJP government is in power. The MLAs had even promised support but anything can happen in politics,” he said. While Congress MLAs were feeling a few jitters due to unlikely, but possible “defections”, they were calmed with the “professional” atttidue of their troubleshooters led by DK Shivakumar. With the numbers against BJP, Singh and Patil also realised that they were on the losing side and came to the Congress camp after much drama outside the House. As the two MLAs took their oath, wry smiles and defeated expressions appeared on the faces of BJP legislators. Interestingly, both the JD(S) and Congress MLAs were asked in the legislature party meetings to not get provoked by the BJP and give room for “misuse” of the pro-tem speaker’s position. As a result, even when Yeddyurappa hinted at the Congress-JD(S) unholy alliance being cobbled up despite a crass war of words between Kumaraswamy and Siddaramaiah, none of the opposition MLAs uttered a word and waited for the CM to either resign or seek a division of votes.",
"description": "During his speech, Yeddyurappa admitted that he had personally gotten in touch with MLAs from the opposition camp \"The MLAs had even promised support but anything can happen in politics,” he said Yeddyurappa said he will be immediately embarking upon a statewide tour to reiterate the peoples’ mandate",
"time_scraped": "2018-08-16 09:00:45.660602",
"article_id": "64237402",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64237403,imgsize-806414,width-400,resizemode-4/64237403.jpg",
"path": "full/bc6509fbb91a8ced67273095c5ef6feb60b314e5.jpg",
"checksum": "d95884180fd7cef2e96d56da68862ad2"
}
]
}