{
"source_article_link": "https://timesofindia.indiatimes.com/india/pm-narendra-modi-invokes-atal-bihari-vajpayee-to-assert-india-russia-strategic-ties/articleshow/64260401.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "PM Narendra Modi invokes Atal Bihari Vajpayee to assert India-Russia strategic ties",
"date_published": "2018-05-21T18:50:33+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64260420,imgsize-121745,width-400,resizemode-4/64260420.jpg"
],
"article_body": "SOCHI: Prime Ministeron Monday invoked former premier and BJP stalwartseveral times in his opening remarks during his talks with Russian Presidenthere to underline the strong bond between the two \"strategic partners\".Prime Minister Modi, who is here for the first informal summit with Putin, referred to the 93-year-old Vajpayee at least seven times in his opening remarks.Vajpayee was the prime minister of India when Putin became Russian President for the first time in 2000. Modi's first reference to Vajpayee came as he recalled Putin's first visit to India as the Russian President in 2000.\"At that time you had praised the civilisation of India and, and strong democracy, lively democracy to define our relations,\" he said.\"Being a friend of Russia for a long time, we want to see Russia as a strong and confident country having an important role in the multipolar world,\" Modi quoted Vajpayee as saying during Putin's visit to India in 2000.He said that \"it is our pleasure to see that dream and farsightedness of Atal Bihari Vajpayee come true\".Modi said the strategic partnership between India and Russia has now been elevated into a \"special privileged strategic partnership\" which is a \"very big achievement\".Modi also recalled his first visit to Russia with then prime minister Vajpayee in 2001 and said Putin was the first world leader whom he met after becoming the chief minister of Gujarat.\"In my political career also, Russia and you (Putin) are very significant...As the chief minister of Gujarat, it was my first meeting with a foreign leader.\"Hence, the beginning of my international relations started from you and Russia,\" Modi added.",
"description": "SOCHI: Prime Ministeron Monday invoked former premier and BJP stalwartseveral times in his opening remarks during his talks with Russian Presidenthere to underline the strong bond between the two \"strategic partners\".Prime Minister Modi, who is here for the first informal summit with Putin, referred to the 93-year-old Vajpayee at least seven times in his opening remarks.",
"time_scraped": "2018-08-16 01:33:24.101583",
"article_id": "64260401",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64260420,imgsize-121745,width-400,resizemode-4/64260420.jpg",
"path": "full/581cf617865041bbf59b619665b26ccf1e43b26b.jpg",
"checksum": "dccc4170adbc8eaaad3b0dbb221daf35"
}
]
}