{
"source_article_link": "https://timesofindia.indiatimes.com/india/bharatiya-janata-party-to-boycott-swearing-in-today/articleshow/64286626.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Bharatiya Janata Party to boycott swearing-in today",
"date_published": "2018-05-23T14:52:55+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64286761,imgsize-61835,width-400,resizemode-4/64286761.jpg"
],
"article_body": "BENGALURU: The BJP is boycotting HD Kumaraswamy’s Wednesday swearing-in ceremony. The party will, instead, be holding a state-wide protest against the ascension of the ‘unholy alliance’ of Congress and Janata Dal (Secular) to power earlier in the day. “It is an unholy alliance which lacks people’s mandate and they have not learnt their lesson. Now, perhaps, the people will teach them a lesson at a later date,” BJPs state chief said in a statement. On Tuesday, Yeddyurappa confined himself to his home and met in-charge and BJP national general secretary P Muralidhar Rao, Vijayapura city MLA and close associate and B Sreeramulu. Through the day Yeddyurappa kept himself busy over the next possible move for the party in the state, with discussions with his party members. Yatnal said the BJP will not be attending the swearing-in in accordance with the decision taken by the high command. By afternoon, police withdrew the security given to Yeddyurappa and also took back the metal detector stationed outside his Dollars Colony residence. At the party office, and state general secretary CT announced that the BJP will be holding a protest around 11.30am on Wednesday at in Bengaluru to oppose the Congress-JD(S) alliance coming to power. He said the coalition did not have the mandate of the state and its ascension to power was a murder of democratic principles. Ravi said along with Yeddyurappa other state leaders will take part in the protest against the “people’s mandate virodhi government”.",
"description": "The BJP is boycotting HD Kumaraswamy’s Wednesday swearing-in ceremony.  Yeddyurappa confined himself to his home and met Karnataka in-charge and BJP national general secretary P Muralidhar Rao, Vijayapura city MLA and close associate Basavaraj Patil Yatnal and B Sreeramulu.",
"time_scraped": "2018-08-16 21:00:13.419671",
"article_id": "64286626",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64286761,imgsize-61835,width-400,resizemode-4/64286761.jpg",
"path": "full/f3f9ee265213f31771fc249d101d65e45bdf9f3e.jpg",
"checksum": "c42c02a8391655aaf89b4295906988bd"
}
]
}