{
"source_article_link": "https://timesofindia.indiatimes.com/india/key-cbi-sleuth-in-nimo-probe-repatriated/articleshow/64311111.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Key CBI sleuth in Nirav Modi probe repatriated",
"date_published": "2018-05-25T06:20:00+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64311113,imgsize-64062,width-400,resizemode-4/64311113.jpg"
],
"article_body": "NEW DELHI: CBI joint director , who was supervising the probe into Rs 13,578 crore scam involving and others, has been prematurely repatriated with “immediate effect” to his parent cadre of Tripura. Joint director , who was heading special crimes zone in CBI, has also been sent back to her parent cadre of Rajasthan. Other than Rajiv Singh, two other CBI officers from the Tripura cadre — R Gopal Krishna Rao (SP) and DIG Anish Prasad — have also been repatriated to the state. The move comes a week after CBI filed two chargesheets against Nirav Modi, Mehul Choski and top PNB officials, including former MD-CEO Usha Ananthasubramanian, in the scam and there are plans to issue a red corner notice against Modi and his family members. Officials said repatriation of 1993 batch IPS officer Rajiv Singh was done by the government after Tripura chief minister Biplab Kumar Deb recently wrote to the Centre asking it to send back the IPS officers serving on deputation at the Centre. Sources said shortage of officers in in the state was cited as the reason. “Rajiv Singh has already led filing of chargesheets in PNB scam, so 80% of work is already done. The rest of the investigations can be easily pursued by another officer now,” said a CBI official requesting anonymity. Singh had earlier successfully probed several financial frauds including the Saradha and Rose Valley chit-fund scandals. Under his supervision in the last four months, CBI’s Bank Security and Fraud Cell (BS&FC) registered over 40 cases related to major bank frauds against Rotomac, Simbhaoli Sugars, and other big names while a preliminary enquiry was initiated against ICICI Bank CEO Chanda Kochhar’s husband Deepak Kochhar. Rajiv Singh has already led filing of chargesheets in PNB scam, so 80% of work is already done. The rest of the investigations can be easily pursued by another officer now, said a CBI official",
"description": "Joint director Nina Singh, who was heading special crimes zone in CBI, has also been sent back to her parent cadre of Rajasthan Other than Rajiv Singh, two other CBI officers from the Tripura cadre — R Gopal Krishna Rao (SP) and DIG Anish Prasad — have also been repatriated to the state",
"time_scraped": "2018-08-20 15:00:12.331903",
"article_id": "64311111",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64311113,imgsize-64062,width-400,resizemode-4/64311113.jpg",
"path": "full/2c98f46717db35e568b40e0708f3f3085d8723ad.jpg",
"checksum": "793f1b91f273b2c4db50ad17a3e8315c"
}
]
}