{
"source_article_link": "https://timesofindia.indiatimes.com/india/cbse-class-12th-result-2018-to-be-declared-today/articleshow/64320370.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "CBSE class 12th result 2018 declared @ cbse.examresults.net",
"date_published": "2018-05-26T12:40:52+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64320371,imgsize-40334,width-400,resizemode-4/64320371.jpg"
],
"article_body": "NEW DELHI: Results for the exams was released today and now available on cbse.examresults.net, cbseresults.nic.in and results.gov.in. The examinations for this year were held from March 5 to April 13. Last year, Class 12 result was announced in the last week of May and the result for Class 10 was announced in first week of June. Earlier, the board had assured that declaration of results will not be delayed due to re-test of the Economics paper, after a purported leak. The IVR numbers to check the results are 24300699: For local Delhi users 011 - 24300699: For subscribers in other parts of the country The result can also be received by sending SMS for class 12 as given below: Type: cbse12 give space and type roll number give space and type sch no give space and type center no and send it to (mobile no) 7738299899 Dates for declaration of the Board's class 10 results is yet to be announced. Last year, the result for CBSE Class 12 examination was declared in the last week of May and the result for Class 10 was declared in the first week of June. The post-result CBSE counseling will begin from May 26 and continue till June 9 from 8 am to 10 pm on all days. For the 21st consecutive year, CBSE will be providing counseling services to students and parents to overcome common psychological problems and general queries related to Class X and XII results.",
"description": "NEW DELHI: Results for the exams was released today and now available on cbse.examresults.net, cbseresults.nic.in and results.gov.in. The examinations for this year were held from March 5 to April 13. Last year, Class 12 result was announced in the last week of May and the result for Class 10 was announced in first week of June. Earlier, the board had assured that declaration of results will not be delayed due to re-test of the Economics paper, after a purported leak.",
"time_scraped": "2018-08-19 03:00:55.468955",
"article_id": "64320370",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64320371,imgsize-40334,width-400,resizemode-4/64320371.jpg",
"path": "full/75bdbef0fb25fb1f9fd0f44ab0bcc3a118b81706.jpg",
"checksum": "177f19d49490019ae0d02895d0e36505"
}
]
}