{
"source_article_link": "https://timesofindia.indiatimes.com/india/culling-of-stray-dogs-sc-issues-notices-to-up-govt-animal-welfare-board/articleshow/64417317.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Culling of stray dogs: SC issues notices to UP Govt, Animal Welfare Board",
"date_published": "2018-06-01T18:19:23+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64417349,imgsize-185397,width-400,resizemode-4/64417349.jpg"
],
"article_body": "NEW DELHI: The Supreme Court on Friday sought responses from the government and the of India on a plea alleging rampant culling of stray dogs in Sitapur district of the state following deaths of several children in the past few months in the area. A vacation bench of Justices L and MM Shantanagoudar also issued notices to the District Magistrate of Sitapur and the state's animal welfare board on the plea that has sought an interim stay on further culling of stray dogs. Senior advocate Anand Grover, appearing for one of the parties, said there were two conflicting reports on the deaths of children in Sitapur district. One report said that children have been dying after being bitten by some wild animals like hyenas, while the DM's report suggested otherwise that the deaths have occurred due to dog bites, the lawyer said. The bench has posted the plea, filed by Gargi Srivastava, for hearing on June 8. The apex court had earlier agreed to hear today the plea against alleged rampant culling of stray dogs in Sitapur district. The petition has sought a direction to the state government to ensure that no more killings of community dogs take place in the state as an after-effect of death of 13 children in the past seven months in Sitapur unless it was established that dogs were behind such attacks. The plea said that subsequent investigations had pointed towards attacks on children by wild animals and not stray dogs. It has alleged that there was \"indiscriminate and inhuman killing\" of stray dogs in Sitapur on the mere assumption that the deaths were being allegedly caused by dog attacks. According to the plea, the attacks have increased due to lack of proper and timely efforts by the district administration and the magnitude of the problem grew this month when unconfirmed reports of attacks being carried out by stray dogs appeared in the media after statements by the district magistrate of Sitapur. \"Following such newspaper reports, indiscriminate and brutal killing of community dogs by hanging them alive, burying them alive, hitting them with 'lathis' (wooden stick), leaving them to bleed to death in a pile of garbage and shooting them point blank started,\" the plea said. \"This rampant massacre led to over 150 community dogs being brutally killed over a span of few days by not only the local people but also under orders of the village panchayats, police officials as well as the officers from district administration,\" it claimed. \"The applicant herein is conscious of the plight of the families of the victims and cannot even imagine their grief but the approach of the government and the administration in brushing aside this issue and leading to culling of numerous dogs in the area is nothing but a failed attempt to cover up their inactions as per earlier orders of this court in the instant matter,\" the plea said. It alleged that the top court, in its November 18, 2015 order, had categorically directed all local authorities and panchayats not to kill stray dogs. The petition said that animal welfare groups had constituted a committee which visited Sitapur and found that massacre of dogs was allowed by the district administration and the police. It alleged that according to the local people, the district administration had hired people to catch and kill dogs and they were being paid Rs 600 per dog. It has sought a direction to the state government to take immediate action and lodge FIRs against individuals who were involved in aiding and abetting the killing of stray dogs without following the due process of law and also initiate inquiry against erring officials of district administration of Sitapur. It said the state animal welfare board of Uttar Pradesh should be asked to act in accordance with directions passed by the apex court earlier and Animal Welfare Board of India should be directed to ensure that animal welfare laws in the country were diligently followed.",
"description": "NEW DELHI: The Supreme Court on Friday sought responses from the government and the of India on a plea alleging rampant culling of stray dogs in Sitapur district of the state following deaths of several children in the past few months in the area. A vacation bench of Justices L and MM Shantanagoudar also issued notices to the District Magistrate of Sitapur and the state's animal welfare board on the plea that has sought an interim stay on further culling of stray dogs.",
"time_scraped": "2018-08-20 03:50:11.650903",
"article_id": "64417317",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64417349,imgsize-185397,width-400,resizemode-4/64417349.jpg",
"path": "full/7339b9acc65f88fb65f57c28f274d2ed5c3f5440.jpg",
"checksum": "68ad8e6286036e072892d399911d133b"
}
]
}