{
"source_article_link": "https://timesofindia.indiatimes.com/india/air-india-marks-70-years-since-1st-india-uk-flight/articleshow/64433806.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Air India marks 70 years since 1st India-UK flight",
"date_published": "2018-06-03T10:15:29+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64433818,imgsize-228337,width-400,resizemode-4/64433818.jpg"
],
"article_body": "LONDON: is marking 70 years since its first flight took off from Mumbai to London in June 1948, which laid the foundations of the relationship. The national carrier is inviting members of the Indian diaspora in to share their memories of the airline in its early days. The iconic first flight, on a Super Constellation aircraft, took off from Mumbai on June 8 and landed in London via Cairo and Geneva on June 10, 1948, with just 42 passengers on board, including some Indian 'Nawabs' (noblemen) and 'Maharajas' (kings). Later this month, Air India is preparing to mark the historic journey, which laid the foundations of the India-UK relationship 70 years ago. \"We want to reach out to people who would have made some of these early journeys to share their memories and pictures, which we could feature in our inflight magazine and also catalogue to mark those glorious early days of air travel,\" said Debashis Golder, Air India Regional Manager - UK and Europe. \"Many of these journeys will mark the arrival of Indians who went on to make their life and fortunes in the UK or friends and family who made visits back and forth during a time when the availability and flight times were not what they are today. It marks an important chapter in the India-UK relationship,\" he said. Golder took charge of the UK and Europe operations of Air India recently, at a time when the airline is undergoing the process of disinvestment. \"It does mark a period of big change for Indian aviation, with a lot of hope that Air India will regain its days of grace and glory,\" he said. The UK market is among the airline's busiest sectors, having recently added three direct flights between Birmingham and Amritsar. \"This was a long-standing demand and the route is doing well, especially as it falls within the religious tourism segment -- culminating at Golden Temple in Amritsar. \"In addition, the third or fourth generation Indians, now settled in the UK for years, visit their home state frequently to stay connected to their roots and the direct connection has certainly proved popular,\" said Golder. The airline industry veteran believes a direct flight to Goa, daily flights to Ahmedabad and Canada and flights from London to Amritsar are among some of the desired routes but Air India remains constrained by airport slots. In the UK, it is running at full capacity at Heathrow Airport and believes the strong trust factor among the Indian diaspora population has proved the key to its growth. \"The only issue we faced in the past was to do with hardware and now with the Boeing 787 Dreamliners, we are among the safest and greenest airlines on the route. \"Passenger feedback backs this up, because they feel less jet-lagged and more relaxed by the time they land,\" he said. Air India's latest addition was and for the next phase of expansion, it is looking at the African continent -- with flights to East and , which the airline used to serve until the early 2000s.",
"description": "The iconic first flight took off from Mumbai on June 8 and landed in London on June 10 Air India is inviting members of the Indian diaspora in Britain to share their memories of the airline",
"time_scraped": "2018-08-17 21:00:06.713551",
"article_id": "64433806",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64433818,imgsize-228337,width-400,resizemode-4/64433818.jpg",
"path": "full/a942270a6c978f50dec247f6eabd1147f7cafede.jpg",
"checksum": "b7cabb1c1d948368992764cf6ee15fa8"
}
]
}