{
"source_article_link": "https://timesofindia.indiatimes.com/india/fear-of-job-losses-misplaced-says-ravi-shankar-prasad/articleshow/64435043.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Fear of job losses misplaced, says Ravi Shankar Prasad",
"date_published": "2018-06-03T12:45:16+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64435072,imgsize-120463,width-400,resizemode-4/64435072.jpg"
],
"article_body": "NEW DELHI: Advanced technologies like AI will spawn new jobs and fears around job losses are misplaced, IT Minister has said, while admitting that needs to play a larger role in the efforts to upskill people. \"Remember, technology by its very nature requires skilling and I see potential for digital skilling in a big way which, by itself, will create a lot of jobs,\" Prasad told PTI. He said IT ministry is working with other departments like on various aspects of these advanced technologies, and is also engaged with software body Nasscom on skill development initiatives. \"We are working with Nasscom...Also, I have already set up several committees to examine the whole matter. Artificial Intelligence (AI) should be used for governance...for improvement. We are working quite closely with other departments like Niti Aayog,\" he explained. Asked if the corporate India needed to put more efforts in this area, the minister said: \"There is a scope for that. Nasscom is doing that but there is a need to do more\". He dismissed concerns that technology may displace jobs, but added that it is important for people to upskill to keep pace with changing requirements in the digital world. \"If a person is not up to date in new technology, then he may have a problem. You have to be tuned to the new technology,\" the minister said in a recent interview. He noted that 39.8 lakh people are working directly in IT sector, while indirectly the sector employed about 1.3 crore people. Additionally, 10 lakh people are involved in Common Service Centre (CSC) - which acts as access point for delivery of electronic governance services - while 4.5 lakh people are involved in mobile manufacturing activities in the country, he added. \"All these numbers are excluding the startup and entrepreneurship movement. When a new technology comes, new skilling comes in, it is going to bring more and more jobs, be very clear about this,\" he said. The comments come amid reports of layoffs across various IT companies and apprehensions that increasing automation across sectors could make existing jobs redundant. Nasscom had refuted such reports saying the IT industry continues to hire people on \"net\" basis although techies will have to reskill themselves to stay relevant. IT companies, on their part, too had defended their position saying trimming of workforce is a part of annual performance reviews, a process that weeds out bottom performers or non-performers. Nasscom had argued that tech startups, e-commerce, and digital payments are creating new opportunities for growth. As many as three million new jobs are expected to be created in the sector by 2025, as per industry estimates. A poll conducted by EY recently found that while business leaders are optimistic about the impact of AI on job creation, talent crisis remains. \"AI is creating jobs, yet 80 per cent of respondents say there is a lack of talent to fill positions,\" EY had said. The IT sector is also battling challenges in business environment and stricter work permit regime in countries like the US, Singapore, Australia and New Zealand.",
"description": "NEW DELHI: Advanced technologies like AI will spawn new jobs and fears around job losses are misplaced, IT Minister has said, while admitting that needs to play a larger role in the efforts to upskill people. \"Remember, technology by its very nature requires skilling and I see potential for digital skilling in a big way which, by itself, will create a lot of jobs,\" Prasad told PTI. He said IT ministry is working with other departments like",
"time_scraped": "2018-08-17 03:00:20.531930",
"article_id": "64435043",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64435072,imgsize-120463,width-400,resizemode-4/64435072.jpg",
"path": "full/80a19db1893203d1664483bf7ae385e7540d9099.jpg",
"checksum": "97d566b6a6382c6a968ee4d92816ddff"
}
]
}