{
"source_article_link": "https://timesofindia.indiatimes.com/india/yet-again-pakistan-pledges-to-hold-cross-border-fire/articleshow/64456242.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Yet again, Pakistan pledges to hold cross-border fire",
"date_published": "2018-06-05T01:56:27+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64456283,imgsize-883302,width-400,resizemode-4/64456283.jpg"
],
"article_body": "NEW DELHI/ISLAMABAD: In the backdrop of renewing cross-border firing despite the DGsMO of India and Pakistan agreeing to renew adherence to a 2003 ceasefire pact less than a week ago, officers of the BSF and held an unscheduled flag meeting on Monday and agreed to restore peace “by holding fire”. Meanwhile, the Pakistan army said there was “no space for war” with India as “we are two nuclear powers”, but it would be compelled to retaliate if Indian troops targeted civilian populations from across the Line of Control. Addressing a press conference at GHQ Rawalpindi, Maj Gen Asif Ghafoor, the chief of Pakistan army’s media wing, said, “DGMO has given an undertaking to his Indian counterpart about respecting the 2003 ceasefire agreement and Pakistan army is committed to adhere to it. But we will give a befitting response if Indian army targets our civilian population.” He alleged that India had violated the ceasefire agreement after the May 29 hotline contact between DGsMO of the two countries. The ceasefire pact has been breached much more than it has been observed, with a spike in violations since July 2016 following the death of Hizb leader Burhan Wani. While heavy retaliation by Indian forces has led to Pakistan seeking cessation of cross-border firing, such intervals have proved brief with Indian civilians and security personnel being targeted afresh. Pakistan Rangers, official sources say, sought a meeting with the BSF after Indian forces hit their posts and villages with mortar shells and firing in response to repeated ceasefire violations in the last four days.",
"description": "The BSF and Pakistan Rangers held an unscheduled flag meeting on Monday and agreed to restore peace “by holding fire” Meanwhile, the Pakistan army said there was “no space for war” with India as “we are two nuclear powers”",
"time_scraped": "2018-08-20 03:00:35.531804",
"article_id": "64456242",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64456283,imgsize-883302,width-400,resizemode-4/64456283.jpg",
"path": "full/842f4cb5a16b21498927279ac653987120133f27.jpg",
"checksum": "ae2a3ecbad82fd78494f9af9181b8de3"
}
]
}