{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-australia-us-japan-to-hold-meet-in-singapore/articleshow/64473876.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India, Australia, US, Japan to hold meet in Singapore",
"date_published": "2018-06-06T10:23:30+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: The 'Quad' will hold its second meeting on June 7 in Singapore. India, , Australia and US, who revived the Quadrilateral Security Dialogue in 2017 will meet on the sidelines of an official Asean meeting in Singapore. The meeting will be at the level of senior officials, that is, at the joint secretary level. This would be the first meeting after November 2017 when officials had also met on the margins of the East Asia Summit (EAS). The meeting comes days after Prime Minister delivered the keynote address at the Shangri-La Dialogue, where he articulated India's Indo-Pacific policy. It also comes days before will be at Qingdao for the SCO summit where China and Russia are the leading powers. If Wuhan and Sochi summits signalled India’s efforts to “re-balance” its global partnerships, the Quad is yet another sign of India doing its global balancing act. Japan has been pushing for an early meeting of the Quad for some time, but Indians wanted to work through their diplomatic engagements with China and Russia before committing themselves to the second meeting. This led to some questioning India's commitment to the Quad. In November, all four members had issued their own statements after the meeting. It’s not yet clear whether they will take a united view this time. After the November 2017 meeting, the four countries have tried to give some teeth to the Quad, trying to work on areas of common interest. Humanitarian projects, disaster relief, counter-terrorism and non-proliferation are areas of common interest, and ones that India wants the four countries to work on. Significantly, neither Modi nor any of the leaders of the four countries had made any direct reference to the Quad during the Shangri-La Dialogue as an emerging mini-lateral grouping in the Indo-Pacific. India is also careful to not mix up the Malabar Exercises (to be held in Guam this year) with the Quad, which, India believes would be a red flag to China, At both Wuhan and Sochi summits, Modi was quizzed by his counterparts on how far India would go with the Quad. Russia and China are increasingly conflating the 'Indo Pacific' policy with the Quad. That's why it was necessary for Modi to clarify at Shangri-La that India's Indo-Pacific policy has its core in its Indian Ocean outreach. Russia, said Indian officials, has been more blunt asking India to get out of the \"US-led bloc\". Russia and China have exactly the same approach on these groupings. For its part, India has always been a big pillar of the Quad, but wants to be careful about aligning interests before moving forward. That will constitute the bulk of the agenda later this week. At Shangri-La Modi emphasised the breadth of India’s naval cooperation in the Indo-Pacific region — “India’s armed forces, especially our Navy, are building partnerships in the Indo-Pacific region for peace and security, as well as humanitarian assistance and disaster relief. They train, exercise and conduct goodwill missions across the region. For example, with Singapore, we have the longest un-interrupted naval exercise, which is in its 25th year now. We will start a new tri-lateral exercise with Singapore soon and we hope to extend it to other Asean countries. We work with partners like Vietnam to build mutual capabilities. India conducts Malabar Exercise with the and Japan.\" It showed which way India was leaning without actually spelling it out causing unease both in China and Russia.",
"description": "NEW DELHI: The 'Quad' will hold its second meeting on June 7 in Singapore. India, , Australia and US, who revived the Quadrilateral Security Dialogue in 2017 will meet on the sidelines of an official Asean meeting in Singapore. The meeting will be at the level of senior officials, that is, at the joint secretary level. This would be the first meeting after November 2017 when officials had also met on the margins of the East Asia Summit (EAS). The meeting comes days after Prime Minister delivered the keynote address at the Shangri-La Dialogue, where he articulated India's Indo-Pacific policy. It also comes days before",
"time_scraped": "2018-08-16 15:00:40.172157",
"article_id": "64473876",
"article_category": "IndiaNews",
"image_details": []
}