{
"source_article_link": "https://timesofindia.indiatimes.com/india/tn-to-set-up-fishing-harbour-in-tiruvallur-dist/articleshow/64479046.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Tamil Nadu to set up fishing harbour in Tiruvallur district",
"date_published": "2018-06-06T16:15:28+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64479079,imgsize-382146,width-400,resizemode-4/64479079.jpg"
],
"article_body": "CHENNAI: The government will set up a fishing harbour at nearby district at an estimated cost of Rs 200 crore, Chief Minister said on Monday. The move was part of the government's efforts towards creating infrastructure for handling deep-sea fish as well as due to the congestion at the existing fishing harbour here, he told the state Assembly. \"The fishing harbour at will be set up with world class facilities to handle deep-sea fish,\" he said in a suo motu statement. The existing fishing harbour in Cuddalore will be upgraded at an estimated Rs 100 crore, the Chief Minister said. The chief minister also made a number of other announcements concerning the departments of Animal Husbandry and Dairy Development. These included provision of modern equipment to detect diseases in cattle, new veterinary facilities and upgradation of veterinary centres as multi-speciality hospitals. He further proposed expansion and upgradation of existing milk processing centres in Chennai, Salem, Vellore-Tiruvannamalai and Thanjavur.",
"description": "CHENNAI: The government will set up a fishing harbour at nearby district at an estimated cost of Rs 200 crore, Chief Minister said on Monday. The move was part of the government's efforts towards creating infrastructure for handling deep-sea fish as well as due to the congestion at the existing fishing harbour here, he told the state Assembly.",
"time_scraped": "2018-08-19 18:00:20.636529",
"article_id": "64479046",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64479079,imgsize-382146,width-400,resizemode-4/64479079.jpg",
"path": "full/75a769651d6dd7e81335278e8bd9c9029cd28572.jpg",
"checksum": "cb0cd4938d161b237c2e8925b9c7691c"
}
]
}