{
"source_article_link": "https://timesofindia.indiatimes.com/india/cbi-questions-chidambaram-in-inx-media-case/articleshow/64486498.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "CBI questions Chidambaram in INX Media case",
"date_published": "2018-06-07T04:20:47+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64486494,imgsize-35959,width-400,resizemode-4/64486494.jpg"
],
"article_body": "NEW DELHI: The Central Bureau of Investigation ( ) on Wednesday questioned former finance minister for four hours in the involving his son , in which the senior Congress leader is being treated as a \"suspect\". Asserting that Chidambaram senior was summoned under section 41A of CrPC, which is a usually sent to a suspect, CBI sources said that he may be called again for questioning as he was the one who \"approved\" the FIPB proposal of INX Media. The Enforcement Directorate had questioned P Chidambaram in Aircel-Maxis case on Tuesday. Immediately after coming out of the CBI headquarters, P Chidambaram tweeted, \"Appeared before CBI. FIR contains no allegations against me.\" He added in another tweet, \"Questions and answers were based on the files of FIPB. Hence, there was little to add to the record\". Chidambaram, sources say, was confronted with the statements of Indrani Mukherjea and Peter Mukherjea recorded earlier this year, in which they had claimed that when they met the former finance minister in his North Block office in 2006, he guided them to his son Karti and suggested that they help Karti's business. Karti had allegedly asked the Mukerjeas for a bribe of $1 million when they met at a five-star hotel in Delhi. As per the plan worked out between the INX Media and Karti, the Mukerjeas engaged Karti's company Advantage Strategic Consulting Pvt Ltd (ASCPL). As part of the alleged quid pro quo, ASCPL and its associated companies around this time raised four invoices for $700,000 (Rs 3.10 crore) on INX Media and were reimbursed. Soon, FIPB gave its approval to fix the irregularities. The CBI has alleged that in March 2007, INX Media breached the condition on which it had been allowed by FIPB to raise 46 per cent equity through issue of shares. Against the permission to raise Rs 4.62 crore by issuing shares at face value, the company got in Rs 305 crore by issuing shares at a premium. In addition, it also bypassed FIPB to make 26 per cent downstream investment in INX News Private Limited. Karti has already been arrested in the case and is presently out on bail. Sources told TOI that P Chidambaram was also confronted with the finance ministry documents, statements of other witnesses and other evidence. Earlier in the day, when P Chidambaram came to CBI's Lodhi Road office, his car was stopped by CISF officials at the entry and he was asked to walk the rest of the way into the premises.",
"description": "The former finance minister was questioned in the INX Media case The Enforcement Directorate had questioned P Chidambaram in Aircel-Maxis case on Tuesday",
"time_scraped": "2018-08-20 03:00:21.941792",
"article_id": "64486498",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64486494,imgsize-35959,width-400,resizemode-4/64486494.jpg",
"path": "full/b5ac65d075e99f82f27c4902b85ecb10a74626af.jpg",
"checksum": "4efd8df16c93ce9da4502882bc1db2e9"
}
]
}