{
"source_article_link": "https://timesofindia.indiatimes.com/india/this-is-how-pm-narendra-modi-responded-when-rahul-gandhi-asked-him-to-address-farmers-issues/articleshow/64481297.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "This is how PM Narendra Modi responded to farmers’ issues, according to Rahul Gandhi",
"date_published": "2018-06-06T18:13:13+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64481308,imgsize-316236,width-400,resizemode-4/64481308.jpg"
],
"article_body": "NEW DELHI: A dead silence —This is how PMresponded, according tochief, when the latter had asked him to address farmers’ issues during their meeting in 2016.Addressing a Kisan Samridhi Sankalp rally in's Mandsaur, the Congress president recalled one of his conversations with the Prime Minister.In 2016, the Congress chief, along with several other leader's of his party, had gone to meet the PM to highlight the plight of the farmers in the country.\"Narendra Modi ji, this is the voice of every farmer of India. You should listen to this voice. Now, listen to Narendra Modi ji's reply...\" Rahul spoke about his meeting with the PM,Rahul's remark was followed by nearly twenty seconds of silence — symbolic of PM Modi's response to Rahul's question on the issues plaguing the farmers of the country.\"This was his answer,\" he broke the silence amidst a thundering applause from his supporters.The congress leader's scathing attack on the Prime Minister came during the rally where he promised farmers' loan waiver in Madhya Pradesh within 10 days, if his party comes to power. He also slammed the central and state government over the plight of the farmers.\"Kamal Nath (MP Congress President) and(the State poll campaign committee chairman) are sitting here. The day, the Congress comes to power in MP, count 10 days, I say with guarantee that farmers' loan will be waived within 10 days. It won't take even the eleventh day,\" he said.",
"description": "NEW DELHI: A dead silence —This is how PMresponded, according tochief, when the latter had asked him to address farmers’ issues during their meeting in 2016.Addressing a Kisan Samridhi Sankalp rally in",
"time_scraped": "2018-08-16 01:34:28.854512",
"article_id": "64481297",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64481308,imgsize-316236,width-400,resizemode-4/64481308.jpg",
"path": "full/69f29ab29b938afda4f289c10e0239682962c180.jpg",
"checksum": "5fa61c923253c780beae6518ce06c505"
}
]
}