{
"source_article_link": "https://timesofindia.indiatimes.com/india/arun-jaitley-questions-rahuls-knowledge/articleshow/64486731.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Arun Jaitley questions Rahul's knowledge",
"date_published": "2018-06-07T05:49:11+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: Soon after 's tirade against the Modi government in a speech in Madhya Pardesh, finance minister on Wednesday hit back, questioning the Congress President's knowledge about various national issues and ground realities. \"Every time I listen to the view of Shri Rahul Gandhi, both inside and outside Parliament, I ask myself the same question — how much does he know? When will he know,\" Jaitley said shortly after Rahul's speech in Mandsaur, which was the seat of farmers' protests last year in the state. \"Listening to his speech delivered in today reaffirms my curiosity about the answer. Is he being inadequately briefed or is he being a little too liberal with his facts,\" Jaitley wrote. The minister gave point-by-point rebuttal to virtually each of Rahul's charges against the Modi government. Jaitley described as \"completely false\" Gandhi's accusation that PM has waived the loans of Rs 2.5 lakh crore of the 15 top industrialists. The government, he said, has not waived a single rupee due from any industrialist. The facts are to the contrary. \"Those who owed money to the banks and other creditors have been declared insolvent and removed from their companies by IBC enacted by the government. These loans were given largely during the UPA Government,\" said Jaitley, who is recovering after a kidney transplant surgery. Congress shot back at Jaitley's post, saying it reflected BJP's arrogance as it had remained \"blind\" to farm distress. \"How much does Arun Jaitley know? ... How are empty-worded blogs an answer to betrayal of farmers by the Modi government?\" Congress spokesperson Randeep Surjewala said.",
"description": "NEW DELHI: Soon after 's tirade against the Modi government in a speech in Madhya Pardesh, finance minister on Wednesday hit back, questioning the Congress President's knowledge about various national issues and ground realities. \"Every time I listen to the view of Shri Rahul Gandhi, both inside and outside Parliament, I ask myself the same question — how much does he know? When will he know,\" Jaitley said shortly after Rahul's speech in Mandsaur, which was the seat of farmers' protests last year in the state. \"Listening to his speech delivered in today reaffirms my curiosity about the answer. Is he being inadequately briefed or is he being a little too liberal with his facts,\" Jaitley wrote.",
"time_scraped": "2018-08-19 21:00:17.430902",
"article_id": "64486731",
"article_category": "IndiaNews",
"image_details": []
}