{
"source_article_link": "https://timesofindia.indiatimes.com/india/maldivian-mp-sent-back-from-chennai-airport/articleshow/64484787.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Maldivian MP sent back from Chennai airport",
"date_published": "2018-06-06T22:47:24+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "CHENNAI: A Maldivian MP, who is a parliamentary group leader of the ruling, was denied entry into India at Chennai airport on Monday. Immigration authorities stoppedsoon after he arrived on a flight via. His co-passengers including Maldives president Abdulla Yameen's sister were allowed to enter. They had arrived for medical treatment at a Chennai hospital.Immigration authorities refused to comment on the reason for refusing him entry.On his return to the Maldives, Nahin alleged that he was detained for four hours when he told that he was part of the ruling party. He said it was an act of \"bullying\" by India. He also alleged that he was not given a reason though he submitted all documents for entry.The Union government maintains a list of high ranking people from every country under the category of banned for entry. \"In all probability the MP might have been stopped based on that. A lookout circular can pop up when the the passport is swiped. But we are not told the reason,\" the official said.Ahmed Mahloof, another Maldivian MP tweeted: \"Ruling party MPfeels that India bullied him bcos his entry was denied by Indian immigration...\"MPs of Maldives have diplomatic passports and enjoy entry without visa in SAARC countries.",
"description": "CHENNAI: A Maldivian MP, who is a parliamentary group leader of the ruling, was denied entry into India at Chennai airport on Monday. Immigration authorities stoppedsoon after he arrived on a flight via. His co-passengers including Maldives president Abdulla Yameen's sister were allowed to enter. They had arrived for medical treatment at a Chennai hospital.Immigration authorities refused to comment on the reason for refusing him entry.",
"time_scraped": "2018-08-16 01:34:39.912815",
"article_id": "64484787",
"article_category": "IndiaNews",
"image_details": []
}