{
"source_article_link": "https://timesofindia.indiatimes.com/india/entry-of-india-pakistan-strengthens-security-cooperation-of-sco-chinese-official/articleshow/64509965.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Entry of India, Pakistan strengthens security cooperation of SCO: Chinese official",
"date_published": "2018-06-08T17:43:59+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64509964,imgsize-111665,width-400,resizemode-4/64509964.jpg"
],
"article_body": "BEIJING: The entry of India and Pakistan into the will strengthen security cooperation in the eight-member grouping, a top Chinese official said ahead of the starting in Qingdao city tomorrow. SCO members include China, Russia, India, Pakistan, Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan. The upcoming meeting will be the first SCO summit after India and Pakistan were accepted as full members in June, 2017 at the Astana summit in Kazakhstan. The summit will focus on enhancing cooperation to address the challenges of terrorism, drug trafficking, cross-border crimes, information security threats, Liao Jinrong, head of the international cooperation department with the Ministry of Public Security, said at a media briefing ahead of the summit, state-run Xinhua news agency reported. The organisation is drawing up measures to tackle these challenges, he said. As India and Pakistan both have rich experience in maintaining security and combating crime, their entry will enhance the development potential and expand the room for cooperation between SCO members in terms of security, Liao said. After their entry, the SCO will be able to better respond to new expectations in the security domain from people within the region and the international community, he said. Terrorism is the most severe security challenge the SCO faces. Over the past years, SCO member states have jointly made achievements in deterring terrorist attacks and arresting members of international terrorist organisations, he said. Besides continuously fighting against \"three evil forces\" of terrorism, extremism and separatism, SCO members have been cooperating in terms of drug control, cracking down on cross-border crime, safeguarding information security and enhancing border controls, Liao said. Security will be one of the major topics at this summit, which will analyse international and regional security situations and discuss concrete measures to enhance cooperation, he added. \"We expect that documents on fighting terrorism, extremism and separatism, as well as drug control, will be deliberated at the summit,\" Liao said. Participants at the summit will discuss about issues including information security, combating cross-border crime and the formation of permanent bodies to ensure law enforcement and security, he said.",
"description": "BEIJING: The entry of India and Pakistan into the will strengthen security cooperation in the eight-member grouping, a top Chinese official said ahead of the starting in Qingdao city tomorrow. SCO members include China, Russia, India, Pakistan, Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan. The upcoming meeting will be the first SCO summit after India and Pakistan were accepted as full members in June, 2017 at the Astana summit in Kazakhstan.",
"time_scraped": "2018-08-19 18:00:18.154314",
"article_id": "64509965",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64509964,imgsize-111665,width-400,resizemode-4/64509964.jpg",
"path": "full/71f8192e0fc4859597f94b434cb32aa5cfad9cbb.jpg",
"checksum": "1b8391e826143a1ea50279551b54fac5"
}
]
}