{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-to-have-an-international-incubator-on-clean-energy-innovations/articleshow/64517625.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India to have an international incubator on clean energy innovations",
"date_published": "2018-06-09T11:32:18+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: Keeping to its role of being a key participant in the global initiative on clean energy research, India has announced setting up the first international incubator to promote innovation in this field. The incubator will come up in the capital with a total investment of around $5 million. \n“We, as part of the ‘Mission Innovation’ country, are setting up an international level incubator in Delhi. Stakeholders from across the world will come here and work in the field of clean energy innovation,” said Union science & technology minister Harsh Vardhan. The incubator, being set up in a public-private partnership, will promote entrepreneurship and innovations in the area of clean energy and provide opportunities to innovators across the Mission Innovation countries to test their technologies in the local market. The Mission Innovation is a global initiative of 22 countries and (EU) to accelerate clean energy innovation. It was launched on the sidelines of the UN climate change conference during the Prime Minister Narendra Modi’s visit to Paris in November 2015. US, China, Japan, , Australia, , , UAE, UK, , Sweden, France and Germany are among the other member countries of this group. The participating countries, as part of the initiative, have pledged to double their collective investments in energy R&D funding of over $15 billion annually to over $30 billion by 2021. These countries collectively, at present, account for more than 80% of the world’s total public financing of clean energy R&D. Vardhan said, “We have already announced $10 million for smart grid innovations and another $5 million for biofuels innovation as part of our commitments to promote clean energy.” Besides, India has launched the joint ‘virtual clean energy centre’ with the UK and the joint ‘clean energy research and development centre on energy storage and smart grids’ with the US.",
"description": "NEW DELHI: Keeping to its role of being a key participant in the global initiative on clean energy research, India has announced setting up the first international incubator to promote innovation in this field. The incubator will come up in the capital with a total investment of around $5 million. \n“We, as part of the ‘Mission Innovation’ country, are setting up an international level incubator in Delhi. Stakeholders from across the world will come here and work in the field of clean energy innovation,” said Union science & technology minister Harsh Vardhan. The incubator, being set up in a public-private partnership, will promote entrepreneurship and innovations in the area of clean energy and provide opportunities to innovators across the Mission Innovation countries to test their technologies in the local market. The Mission Innovation is a global initiative of 22 countries and (EU) to accelerate clean energy innovation. It was launched on the sidelines of the UN climate change conference during the Prime Minister Narendra Modi’s visit to Paris in November 2015. US, China, Japan,",
"time_scraped": "2018-08-21 03:00:29.842878",
"article_id": "64517625",
"article_category": "IndiaNews",
"image_details": []
}