{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-is-very-important-inspiration-united-nations-chief-antonio-guterres/articleshow/64517875.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India is very important inspiration: United Nations chief Antonio Guterres",
"date_published": "2018-06-09T11:57:44+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64517915,imgsize-54285,width-400,resizemode-4/64517915.jpg"
],
"article_body": "United Nations: Describing India as a \"very important inspiration\" for the international community, UN chief has commended the country for its leadership in a development partnership fund with the UN that he said has emerged as a vital example of deepening South-South cooperation. Guterres thanked India for its \"strong commitment to multilateralism\" and to partnership with the , which he said is expressed in many ways across the global agenda and seen through the activities of this \"important\" fund. \"India played a very important role in shaping the . And even before the Goals were crystallized, India's own development efforts and vision reflected many of the same priorities and aspirations. India is, for all of us, a very important inspiration,\" Guterres said in his remarks to an event marking the first anniversary of the India-UN Development Partnership Fund. \"The Fund shows the further deepening of South-South cooperation, an increasingly valuable dimension of our work for development,\" the Secretary General said. The UN Chief, who is expected to visit India later this year, commended India for its \"leadership and solidarity\", saying he looks forward to further engagement with the country on the fund. \"And I will have the opportunity soon in Delhi to congratulate the Indian government on this very very important initiative,\" he said at the event here on Friday attended by several UN Ambassadors and diplomats. The India-UN Development Partnership Fund was launched in 2017 with the aim of assisting projects for the implementation of the Sustainable Development Goals (SDGs) in partner countries. It supports Southern-owned and led, demand-driven, and transformational sustainable development projects across the developing world, with a focus on least developed countries and small island developing states. The fund is managed by the UN Office for South-South Cooperation and UN agencies implement the Fund's projects in close collaboration with partnering governments. The Indian Government has committed an amount of $100 million over 10 years. In April 2018, the Government of India established a separate Commonwealth Window under the Fund aimed at partnership with developing countries in the Commonwealth. Under this window, an additional sum of USD 50 million over the next five years has been committed for partnerships with developing country members of the Commonwealth. Projects supporting biomedical waste management in Grenada, clean energy in Tuvalu and census data collection in Vanuatu have been approved under this window. Guterres said that South-South cooperation between developing nations is not an instrument aimed at replacing North-South cooperation between developed and developing nations. \"South-South cooperation is not an instrument for the commitments that were made by developed countries now to be put aside. South-South cooperation must be a stimulus for an intensified North-South cooperation, for the agenda to be fully implemented and for everybody to assume their responsibilities in the context of a world in which we want a fair globalization, in which justice prevails in international relations,\" he said. India's permanent representative to the UN Syed Akbaruddin said that from the first project of a million dollars, the annual contribution and portfolio of projects has multiplied several times within the first year of the fund's operation. Calling for a \"1-2-3 process\", Akbaruddin urged the Secretary General to ensure that the speed of implementation of projects entrusted to the UN agencies is enhanced. Explaining the 1-2-3 process, Akbaruddin said funds are put up up-front and the mechanisms for assessing a project from the partner countries and accepting it in consultation with the South-South Fund has been cut down to less than a month. \"So that is part 1,\" he said. He added that Part 2 entails that each of the projects in this Fund are implemented quickly and completed within a two-year period, none going beyond the 3rd year. \"Only then can we call it the 1-2-3 process with true meaning and effectiveness. We look forward to the reformed system being put in place from January 1, 2018 providing greater efficiency and effectiveness to the UN's facilitation of sustainable development efforts across the world and ensuring a 1-2-3 process for triangular cooperation with the Global South,\" Akbaruddin said.",
"description": "The UN chief Antonio Guterres thanked India for its \"strong commitment to multilateralism\" and to partnership with the United Nations, which he said is expressed in many ways across the global agenda and seen through the activities of this \"important\" fund.  The UN chief is expected to visit India later this year. ",
"time_scraped": "2018-08-19 15:00:08.878656",
"article_id": "64517875",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64517915,imgsize-54285,width-400,resizemode-4/64517915.jpg",
"path": "full/521b05aff185b8ff509dd1c4db740b31157f916c.jpg",
"checksum": "8420e7c360a069b15a3095089a407ac6"
}
]
}