{
"source_article_link": "https://timesofindia.indiatimes.com/india/some-political-parties-using-maoist-against-nda-regrets-arun-jaitley/articleshow/64511576.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Some political parties using Maoist against NDA, regrets Arun Jaitley",
"date_published": "2018-06-08T20:28:17+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64511862,imgsize-212270,width-400,resizemode-4/64511862.jpg"
],
"article_body": "NEW DELHI: Union minister on Saturday flagged the \"dangerous tendency\" of expanding activities in areas beyond usual extremism affected regions and attacked \"some political parties\" for using them against the ruling . Jaitley, who is recuperating from a kidney transplant surgery at home, in a blog hit at some political parties for using Maoist as an instrument against the ruling NDA. His comments came a day after a letter was reportedly found in the house of a person arrested for alleged maoist \"links\" that talked about the ultras mulling \"Rajiv Gandhi-type incident\" and suggesting that Prime Minister should be targeted during his \"road shows\". \"Unfortunately some political parties see the Maoist as their instrument in the anti-NDA cause. The history of terrorism and extremism teaches us one basic fact. Never ride a tiger, you may be its first victim,\" Jaitley said. He said the past few days have witnessed evidence of increased Maoist activities in areas other than usual extremism affected areas. \"This is a dangerous tendency which all political parties must realise and react to. The Maoist believe in the violent overthrow of constitutional system and not just the government,\" he said, adding that in their perceived system there are no fundamental rights, no rule of law, no Parliament and no free speech. But, to expand their political base their sympathisers make full use of the democratic idioms, the minister said. Recalling a discussion in the during the UPA II regime, Jaitley said he had analysed that there were four kinds of Maoist in India. Firstly, those who ideologically indoctrinate. The second category is the weaponised Maoist who carry out the operations. The third category is innocent tribals or others who face injustice, who have been misled to believe that Maoist will get them relief. \"We seriously need to address this section,\" he said. The fourth category, Jaitley added is \"what I have always called 'half Maoist'\". \"Willingly or otherwise, they become over-ground face of the underground. They are a part of the democratic system. \"They masquerade as activist; they speak the language of democracy; they have captured the human rights movement in several parts of the country but always lend support to the Maoist cause. They are unwilling to condemn,\" he added. As per the Pune police, the letter was recovered from the house of Rona Wilson who was among five people arrested arrested from Mumbai, Nagpur and Delhi in connection with Elgar Parishad held in December and the subsequent Bhima-Koregaon violence in the district. The letter, addressed to one Comrade Prakash by sender who identifies himself as R, talks about the requirement of Rs 8 crore to procure M-4 rifle and along with four lakh rounds of ammunition for the purpose. Rajiv Gandhi, former prime minister, was killed by a woman suicide bomber during a public event in Sriperumbudur in Tamil Nadu on May 21, 1991.",
"description": "NEW DELHI: Union minister on Saturday flagged the \"dangerous tendency\" of expanding activities in areas beyond usual extremism affected regions and attacked \"some political parties\" for using them against the ruling . Jaitley, who is recuperating from a kidney transplant surgery at home, in a blog hit at some political parties for using Maoist as an instrument against the ruling NDA.",
"time_scraped": "2018-08-19 21:00:15.887576",
"article_id": "64511576",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64511862,imgsize-212270,width-400,resizemode-4/64511862.jpg",
"path": "full/8b7296164fb8f0b35478e8d2fe90d91c0c3d4d52.jpg",
"checksum": "d4d8082f4514c3a6eda4840759c030b4"
}
]
}