{
"source_article_link": "https://timesofindia.indiatimes.com/india/pm-modis-meetings-with-chinas-xi-jinping-a-timeline/articleshow/64510931.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "PM Modi's meetings with China's Xi Jinping: A timeline",
"date_published": "2018-06-08T19:13:09+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64511012,imgsize-124198,width-400,resizemode-4/64511012.jpg"
],
"article_body": "  Xi's three-day stay in India was one of many firsts. It was the first instance of an Indian PM receiving a foreign head of state outside New Delhi. Xi became the first Chinese leader in six decades to be feted at a public reception. A budding bonhomie between the two world leaders was on full display, as and sat side-by-side on a swing. Both sides inked 12 agreements, one of which will see China investing $20 billion in India's infrastructure over five years.   PM Modi became the first world leader to be hosted by Xi at his hometown Xian. In glimpses of rare chemistry, Xi and Modi were seen walking hand in hand and chatting amiably. The two also held wide-ranging discussions on matters like terrorism, the boundary dispute and confidence-building measures at the summit-level talks. Modi's selfie with Chinese Premier Li Keqiang was touted as one of the most \"power-packed selfie in history\" and racked up over 31 million views on Chinese microblogging site Weibo.   Meeting on the sidelines of the BRICS and (SCO) summits in Ufa, PM Modi and Xi held a \"comprehensive\" discussion on bilateral ties. Modi also raised strong concerns over China's decision to     PM Modi's fourth meeting with Xi was a significant one, as at the time India had applied for membership to the elite Nuclear Suppliers Group (NSG) that controls access to sensitive nuclear technology. During his talks with the Chinese president, Modi reportedly urged him to conduct a fair and objective assessment of India’s application on merit. However, China has since repeatedly opposed India's bid for entry into the NSG. Over the last few months, relations between the two Asian giants had been on a downward trajectory over China vetoing India's petitions to ban Jaish-e-Mohammad chief in the UN Security Council, and its blocking of India's NSG aspirations. In the bilateral meeting with Xi, PM Modi had raised India’s concerns over the multi-billion dollar China-Pakistan Economic Corridor (CPEC) being laid through PoK and told Xi that \"to ensure durable ties and their steady development, it is of paramount importance that we respect each other’s aspirations, concerns and strategic interests\". A month after the G20 summit, Modi and Xi came together in Goa where they held \"fruitful\" discussions on key issues including terrorism, NSG and enhancing trade and investment. The tone of the talks on the sidelines of the eighth BRICS summit was affirmative and positive unlike the bitterness and acrimony that had marked India-China relations in preceding months. The run-up to was fraught with tension as only a month ago, India had declined an invitation to a Belt and Road Initiative summit hosted by Beijing. A Xinhua report said the Chinese president had called for more high-level interactions, institutionalized exchanges, strategic communication and policy alignment between the two countries. At the SCO summit, India and formally joined the security bloc spearheaded by China and Russia. Amid a tense standoff between Indian and Chinese troops at the disputed border territory of Doklam, Prime Minister Narendra Modi informally met President Xi Jinping on the sidelines of the G20 summit in Germany and had a conversation on a range of issues. The fact that a formal bilateral meeting between the two leaders had not been scheduled was due to Beijing's view that the \"atmosphere was not right\" for official dialogue between Modi and Xi. After 73 days, the Doklam face-off was resolved through diplomatic channels and PM Modi and Xi Jinping held a substantive bilateral meeting at Xiamen. Setting the course for a new \"forward looking\" round of engagement anchored by fresh mechanisms to ensure calm at the borders, the two leaders reaffirmed their understanding that differences shouldn't be allowed to become disputes. At the BRICS summit, China, for the first time, did not object to the listing of Pakistan-based JeM, LeT and the Haqqani Network as international terror groups. Modi-Xi's camaraderie once again made waves during the 'Heart to Heart summit' in the central Chinese city of Wuhan, where the two leaders had a series of one-on-one informal interactions. With Doklam still weighing on their minds, Modi and Xi decided that they will issue strategic guidance to their respective militaries to strengthen communications and to build trust and understanding. No agreements were inked, nor any announcements made at the summit, since the focus of the two leaders was to take stock of and further strengthen bilateral relationships as well as the strategic and long term partnership between India and China.   PM Modi will fly to Qingdao on Saturday to attend the two-day SCO summit. He is scheduled to hold a bilateral meeting with Xi shortly after his arrival in the Chinese port city. The two leaders are expected to review the whole gamut of bilateral relations, as well as take stock of progress in implementation of decisions they had taken at the Wuhan summit.",
"description": "  Xi's three-day stay in India was one of many firsts. It was the first instance of an Indian PM receiving a foreign head of state outside New Delhi. Xi became the first Chinese leader in six decades to be feted at a public reception. A budding bonhomie between the two world leaders was on full display, as and sat side-by-side on a swing. Both sides inked 12 agreements, one of which will see China investing $20 billion in India's infrastructure over five years.",
"time_scraped": "2018-08-19 00:46:13.998820",
"article_id": "64510931",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64511012,imgsize-124198,width-400,resizemode-4/64511012.jpg",
"path": "full/560bffde4406fb2d288ea4a22187c394386619ea.jpg",
"checksum": "c806523c7b3bc3ae389d4048ddd39765"
}
]
}