{
"source_article_link": "https://timesofindia.indiatimes.com/india/pm-modi-meets-chinese-president-xi-in-qingdao/articleshow/64520329.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "PM Modi says his meeting with Xi Jinping will add further vigour to India-China ties",
"date_published": "2018-06-09T16:02:51+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64520936,imgsize-598697,width-400,resizemode-4/64520936.jpg"
],
"article_body": "QINGDAO: Prime Minister Narendra Modi on Saturday said he had detailed discussions with Chinese President Xi Jinping on bilateral and global issues which will add further vigour to the India-China friendship after their informal summit in Wuhan. During their meeting, which came nearly six weeks since the Wuhan summit, the two leaders discussed a blueprint for deepening bilateral relationship and reviewed the implementation of decisions they had taken in the central Chinese city. The meeting took place on the sidelines of the Shanghai Cooperation Organisation ( ) summit and covered key aspects of the bilateral engagement, reflecting the resolve by the two countries to reset relations and bring back trust in their ties which was hit by the Doklam standoff and several other thorny issues.   \"Met this year's SCO host, President Xi Jinping this evening. We had detailed discussions on bilateral and global issues. Our talks will add further vigour to the India-China friendship,\" Modi tweeted after the meeting. External affairs ministry spokesperson Raveesh Kumar described the meeting as \"warm\" and \"forward looking\" while Chinese envoy to India Luo Zhaohui said the two leaders focused on the implementation of the \"Wuhan consensus\" and drawing a blueprint for the future Sino-India relations. An MoU on sharing hydrological information of the Brahmaputra river by China to India and another pact on amendment of the protocol on phytosanitary requirements for exporting rice from India to China to include non-Basmati rice were signed after the Modi-Xi talks. \"Further strengthening the positive momentum in the bilateral relationship generated at the Wuhan informal summit, PM Narendra Modi had a warm and forward looking meeting with Chinese President Xi Jinping on the sidelines of the SCO Summit,\" Kumar tweeted. The meeting between the leaders of two Asian powers came after their informal summit in the Chinese city of Wuhan to solidify the relationship in a broad spectrum of areas and ensuring better coordination between the border guarding forces of the two countries after the Doklam standoff.   After their talks in Wuhan, Modi and Xi had decided to issue \"strategic guidance\" to their militaries to strengthen communications to build trust and understanding as part of efforts to avoid a Doklam-like situation in the future. The two leaders had also discussed ways to give impetus to their economic ties as well as people-to-people relations. Luo said it was the 14th meeting between our two leaders over past four years. Modi arrived here in the afternoon on a two-day visit to attend the annual SCO summit. The ties between the two neighbouring nuclear powers had nosedived following last year's Doklam standoff as well as due to a number of other issues issues including China blocking India's move to get Pakistan-based Jaish-e-Mohammed chief Masood Azhar banned by the UN and its opposition to India's bid for the Nuclear Suppliers Group membership. China's Belt and Road Initiative was also strongly opposed by India as part of it goes through Pakistan-occupied Kashmir. Troops of India and China were locked in the 73-day standoff in Doklam since June 16 last year after the Indian side stopped the construction of a road by the Chinese army in the disputed area. Bhutan and China have a dispute over Doklam. The face-off had ended on August 28. However, there have been concerted efforts by both sides to reset ties leaving behind the Doklam episode. Last week, Modi had said that Asia and the world will have a better future when India and China work together with trust and confidence while being sensitive to each other's interests. Modi also said that an \"Asia of rivalry\" will hold the region back while an Asia of cooperation will shape the current century. The Prime Minister's comments at the Shangri-La Dialogue in Singapore were appreciated by China. China's appreciation of what Modi said was conveyed by Chinese Foreign Minister Wang Yi to External Affairs Minister Sushma Swaraj during a meeting held on the sidelines of the BRICS Foreign Ministers Meeting in South Africa this week. It is for the first time the Indian Prime Minister will be attending the SCO summit after India along with Pakistan became full-fledged members of the grouping last year. The SCO currently has eight member countries which represents around 42 per cent of the world's population and 20 per cent of the global GDP. India was an observer at the SCO since 2005 and has generally participated in the ministerial-level meetings of the grouping which focus mainly on security and economic cooperation in the Eurasian region.",
"description": "Modi said that strong and stable relations between India and China can inspire a stable and peaceful world The two leaders had also discussed ways to give impetus to their economic ties as well as people-to-people relations",
"time_scraped": "2018-08-18 00:00:36.718828",
"article_id": "64520329",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64520936,imgsize-598697,width-400,resizemode-4/64520936.jpg",
"path": "full/4c8eff0f727fa1a4afdcfa3a636054ab8f80db31.jpg",
"checksum": "05a81341b164d4c4b0bf9a0da6c99084"
}
]
}