{
"source_article_link": "https://timesofindia.indiatimes.com/india/opposition-says-lateral-entry-will-undermine-constitution/articleshow/64534765.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Opposition says lateral entry will undermine Constitution",
"date_published": "2018-06-11T05:42:41+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: The Centre’s decision to notify lateral entry to 10 posts of joint secretaries invited criticism from some opposition leaders who alleged that the move is aimed at filling the with those who looked “favourably” at the government. Leader of Opposition in Bihar alleged the government will now appoint “favourites” through the lateral entry process which he called “unconstitutional” and “anti-reservation”. “Tomorrow, they will appoint the Prime Minister and Cabinet without holding polls,” he remarked. “ This is BJP’s attempt to get a grip over the bureaucracy through RSS infiltration. If joint secretaries are appointed from outside, what happens to the person who becomes eligible for the post through promotion?” said general secretary . Congress leader Tehseen Poonawalla said he will challenge the decision in court.",
"description": "NEW DELHI: The Centre’s decision to notify lateral entry to 10 posts of joint secretaries invited criticism from some opposition leaders who alleged that the move is aimed at filling the with those who looked “favourably” at the government. Leader of Opposition in Bihar alleged the government will now appoint “favourites” through the lateral entry process which he called “unconstitutional” and “anti-reservation”. “Tomorrow, they will appoint the Prime Minister and Cabinet without holding polls,” he remarked. “ This is BJP’s attempt to get a grip over the bureaucracy through RSS infiltration. If joint secretaries are appointed from outside, what happens to the person who becomes eligible for the post through promotion?” said",
"time_scraped": "2018-08-19 18:00:07.211250",
"article_id": "64534765",
"article_category": "IndiaNews",
"image_details": []
}