{
"source_article_link": "https://timesofindia.indiatimes.com/india/gauri-lankesh-murder-cops-make-another-arrest/articleshow/64559319.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Gauri Lankesh murder: Cops make another arrest",
"date_published": "2018-06-12T23:35:48+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64559284,imgsize-447386,width-400,resizemode-4/64559284.jpg"
],
"article_body": "The Special Investigation Team (SIT) probing the murder of journalist-cum-activist has detained a man from Sindhagi in north 's Bijapura. Twenty six-year-old Parshuram Wagmare, son of Ashok Wagmare, was arrested by SIT and produced before the 3rd ACMM court. He has been sent to 14-day police custody for further interrogation. However, SIT sources refused to divulge further details. \"What we can say now is, the person we have arrested may be the shooter himself. But we need time to prove it,\" a senior police officer said. Earlier in the day, office bearers of held a press meet in Bengaluru saying SIT had taken two men from north Karnataka for questioning. \"SIT have taken Parashuram Wagmore and Sunil Asgar for questioning in the case. Both are innocent. The probing team is trying to defame Hindu outfits,\" office bearers of the Samiti said.",
"description": "SIT probing the murder of Gauri Lankesh has detained a man - Parshuram Wagmare- from Sindhagi in north Karnataka's Bijapura Wagmare was produced before the 3rd ACMM court today He has been sent to 14-day police custody for further interrogation",
"time_scraped": "2018-08-17 15:00:16.486884",
"article_id": "64559319",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64559284,imgsize-447386,width-400,resizemode-4/64559284.jpg",
"path": "full/9de0af7106ba380400256f40ed12de4edc0900d1.jpg",
"checksum": "5224fe15444fa5a8043019def9ed9d12"
}
]
}