{
"source_article_link": "https://timesofindia.indiatimes.com/india/cricket-diplomacy-doon-to-be-afghanistan-teams-new-home/articleshow/64580503.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Cricket diplomacy: Doon to be Afghanistan team’s new home",
"date_published": "2018-06-14T06:05:49+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: From the to the Himalayan foothills, Afghanistan has just found a new home. Dehradun, the capital of , will serve as the home ground of the cricket team according to an understanding which New Delhi and Kabul have arrived at, government sources here said. Afghanistan recently acquired test status and will play its first test match against India in Bangalore on June 14-18. Afghanistan Chief Executive Abdullah Abdullah will be the chief guest for the event. Afghanistan recently played a T 20 series against Bangladesh in Dehradun. The same stadium, official sources said, has been lent to Afghanistan to serve as its official home ground where it can host international matches. India is hoping that this piece of cricket diplomacy will help it earn more goodwill with the Afghan people at a time there is increasing uncertainty not just about the political situation in Kabul but also India’s role in it. As government officials here said, India has been associated with the development of cricket in Afghanistan since 2001 when Afghanistan joined ICC. In 2015, India allowed the Afghan cricket team to shift base to Greater Noida from Shariah. However, now with Afghanistan qualified to play test matches, the Indian government realised it was important for their team to have its own exclusive cricket stadium which would host their international matches. “Most of the Afghan players have received training from Indian coaches in their formative years. India had also helped in construction of cricket stadiums and grounds in Afghanistan, like in Kandahar,” said an official. Unlike Pakistan cricketers, Afghan players like Rashid Khan and Mohammed Nabi feature regularly in IPL and even have a fan following here. The Indian establishment is investing in Afghan cricket as it believes the game can act as a unifying force in a country otherwise torn apart by politics of ethnicity. According to another understanding reached last month, all teams touring India will now play one practice game against Afghanistan, an arrangement which will provide international exposure to the team.",
"description": "NEW DELHI: From the to the Himalayan foothills, Afghanistan has just found a new home. Dehradun, the capital of , will serve as the home ground of the cricket team according to an understanding which New Delhi and Kabul have arrived at, government sources here said.",
"time_scraped": "2018-08-17 18:00:15.071918",
"article_id": "64580503",
"article_category": "IndiaNews",
"image_details": []
}