{
"source_article_link": "https://timesofindia.indiatimes.com/india/pm-posts-fitness-video-dares-h-d-kumaraswamy-ips-officers/articleshow/64580256.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "PM posts fitness video, dares H D Kumaraswamy, IPS officers",
"date_published": "2018-06-14T04:36:08+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64580261,imgsize-103943,width-400,resizemode-4/64580261.jpg"
],
"article_body": "NEW DELHI: Responding to the fitness challenge posed to him by Indian cricket captain , PM posted a video of his routine on Wednesday, but also tagged Karnataka CM H D Kumaraswamy, table tennis player Manika Batra and IPS officers, especially those above 40. The video on Twitter showed the PM walking a track, meditating, stretching and doing yoga. “I am delighted to nominate the following for the fitness challenge: Karnataka’s CM Shri H D Kumaraswamy, India’s pride and among the highest medal winners for India in the 2018 CWG Manika Batra and the entire fraternity of brave IPS officers, especially those above 40,” he tweeted.   The move to tag HDK has clear political overtones as the Karnataka CM has referred to his health as a factor in JD(S) hesitating to take up the post. The challenge to police officials is seen to test their willingness to be part of the ‘Hum Fit Toh India Fit’ promotion. While posting the video, Modi said, “Apart from yoga, I walk on a track inspired by the Panchtatvas or five elements of nature — Prithvi, Jal, Agni, Vayu, Aakash. This is extremely refreshing and rejuvenating. I also practice breathing exercises.”   Karnataka chief minister H D Kumaraswamy replied to the fitness challenge thrown at him by PM Modi saying he was fitter that the PM and that he was “more concerned about the development and fitness of his state”. Responding to the PM’s video, the CM replied that yoga and treadmill were part of his daily workout, but did not assure him that he would post a fitness regime video. Later, HDK told mediapersons: “I am more fit than Modi and meet hundreds of people each day. I don’t need to learn about fitness from the PM.” On the table headed by Congress chief , the chatter among political leaders in between bites veered towards the news trending on social media — PM Modi’s fitness video. Talking about the usual subjects, Rahul suddenly asked a guest if he had seen Modi’s video, only to answer the query himself. “Did you see the PM’s fitness video? It is ridiculous... I mean... It is bizarre... This is bankruptcy,” he said. The remark provoked hearty guffaws from CPM chief and TMC’s , who were sharing the table with Gandhi.",
"description": "Responding to the fitness challenge posed to him by Virat Kohli, Modi posted a video of his routine on Wednesday The video on Twitter showed the PM walking a track, meditating, stretching and doing yoga The PM also tagged Karnataka CM Kumaraswamy, table tennis player Manika Batra and IPS officers",
"time_scraped": "2018-08-20 00:00:10.537207",
"article_id": "64580256",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64580261,imgsize-103943,width-400,resizemode-4/64580261.jpg",
"path": "full/5fe8f5e003d0b4230677f6c61292fc15b0247e62.jpg",
"checksum": "8a45898ce02fc2575708d6a9631c2312"
}
]
}