{
"source_article_link": "https://timesofindia.indiatimes.com/india/arun-jaitley-takes-jibe-at-rahul-gandhi-says-upa-to-blame-for-bad-loans/articleshow/64580554.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Arun Jaitley takes jibe at Rahul Gandhi, says UPA to blame for bad loans",
"date_published": "2018-06-14T06:10:17+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: Taking a jibe at for his anti-Narendra Modi tirade, Union minister hit out at the Congress president over the latter’s allegation that the NDA government had waived off loans of 15 corporate houses and raised questions about his ability to make sense of governance issues. “It was the which, during 2008-2014, indiscriminately lent money through banks to these 15 defaulters. Congress president prefers the Goebbelsian traditions to say the exact opposite,” the minister said. Jaitley said Rahul’s statements raised question marks about his wisdom. “Why does he believe that Rs 2.5 crore of bank loans have been waived? It is because of his inability to understand that where a ‘performing asset’ is not served by the debtor after 90 days, it becomes a non-performing asset. Chances of its recovery, as per RBI guidelines, decline. There is a shift in a column which takes place and the bank has to make a provisioning on the basis of the diminished possibility of recovery. But the debtor liability remains. There is no waiver and the entry gets reversed when, either through the IBC or through legal process, the debt is recovered,” he said. “For the president of a national party not to understand this basic procedure of bank functioning should be a matter of concern not just to his party but also to the country. In dynastic parties, positions are heritable but, unfortunately, wisdom is not,” he added. Hitting back at Union minister Arun Jaitley, Congress said the leader is writing “hollow and wasteful” blogs to regain political relevance.",
"description": "NEW DELHI: Taking a jibe at for his anti-Narendra Modi tirade, Union minister hit out at the Congress president over the latter’s allegation that the NDA government had waived off loans of 15 corporate houses and raised questions about his ability to make sense of governance issues. “It was the",
"time_scraped": "2018-08-19 21:00:12.304779",
"article_id": "64580554",
"article_category": "IndiaNews",
"image_details": []
}