{
"source_article_link": "https://timesofindia.indiatimes.com/india/two-gujarat-police-officers-depose-in-sohrabuddin-trial/articleshow/64592767.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Two Gujarat  police officers depose in Sohrabuddin trial",
"date_published": "2018-06-14T22:52:11+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64592778,imgsize-1232254,width-400,resizemode-4/64592778.jpg"
],
"article_body": "MUMBAI: Two Gujarat police officers deposed before a special trial court as prosecution witnesses in the Sheikh and Tulsiram Prajapati alleged fake encounter cases on Thursday. One of them, Khanibhai Jadeja testified that he was called by senior IPS officer D G Vanzara, an accused, and was sent to the house of co-accused, police inspector, Ashish Pandya but on reaching there he couldn't found him. The other witness was a police personel, Meghjibhai Maheshwari, who drove him there. It is the case of the prosecuting agency, Central Bureau of Investigation (CBI), that Pandya had taken leave and gone to carry out the encounter in 2005. A few defence lawyers cross examined the witnesses and suggested that they were lying about having gone to Pandya’s house as there was no entry in police diary. So far, 65 prosecution witnesses have turned hostile before special CBI court judge S J Sharma, in Mumbai where the trial is on. Sohrabuddin’s brother, Rubabbudin Shaikh, had moved the challenging orders of the trial court that had dropped the case against half a dozen accused, all police officers, from Gujarat and Rajasthan including senior IPS officers D G Vanzara, Rajkumar Pandian, Dinesh MN. Meanwhile Sohrabuddin’s biological brother Shahanawazuddin, has moved the trial court to be allowed to be depose as a primary witness in the case. The court has reserved its orders on his plea. The case will now proceed next week.",
"description": "MUMBAI: Two Gujarat police officers deposed before a special trial court as prosecution witnesses in the Sheikh and Tulsiram Prajapati alleged fake encounter cases on Thursday. One of them, Khanibhai Jadeja testified that he was called by senior IPS officer D G Vanzara, an accused, and was sent to the house of co-accused, police inspector, Ashish Pandya but on reaching there he couldn't found him. The other witness was a police personel, Meghjibhai Maheshwari, who drove him there. It is the case of the prosecuting agency, Central Bureau of Investigation (CBI), that Pandya had taken leave and gone to carry out the encounter in 2005. A few defence lawyers cross examined the witnesses and suggested that they were lying about having gone to Pandya’s house as there was no entry in police diary. So far, 65 prosecution witnesses have turned hostile before special CBI court judge S J Sharma, in Mumbai where the trial is on. Sohrabuddin’s brother, Rubabbudin Shaikh, had moved the",
"time_scraped": "2018-08-20 09:00:35.405736",
"article_id": "64592767",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64592778,imgsize-1232254,width-400,resizemode-4/64592778.jpg",
"path": "full/a8a9aa4c454b923489106f87e8e6e46ded8b43af.jpg",
"checksum": "aa8772c02bffd8516ad26e29c8d31ac8"
}
]
}