{
"source_article_link": "https://timesofindia.indiatimes.com/india/vajpayees-condition-improving-aiims/articleshow/64605635.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Vajpayee's condition improving: AIIMS",
"date_published": "2018-06-15T20:36:54+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64605630,imgsize-123691,width-400,resizemode-4/64605630.jpg"
],
"article_body": "NEW DELHI: Former Prime Minister's condition is improving and he is being monitored by a team of doctors round-the-clock, sources at the AIIMS said on Friday.The BJP stalwart continues to be in the ICU of the Cardio-thoracic Centre at the hospital.\"Former Prime Minister Atal Bihari Vajpayee is stable. He continues to show improvement and is being monitored by the team of doctors,\" the All India Institute of Medical Sciences (AIIMS) said in a statement.AIIMS director Randeep Guleria had, on Wednesday, said the 93-year-old leader was showing significant improvement and the doctors were hopeful of his full recovery in the next few days.Vajpayee was admitted to the premier hospital on June 11 with a kidney tract infection, chest congestion and the urine output on the lower side.He was immediately evaluated by a team of doctors and put on injectable antibiotics.Vajpayee, a diabetic, has one functional kidney. He had suffered a stroke in 2009 that had weakened his cognitive abilities. Subsequently, he had developed dementia.Political leaders, including Union minister Anupriya Patel, met the ailing leader at the hospital today.Prime Minister, BJP chief Amit Shah, RSS chief Mohan Bhagwat, former Prime Ministersand H D Deve Gowda,chief minister Vasundhara Raje and Congress president Rahul Gandhi have visited Vajpayee at the AIIMS over the past four days.Vajpayee was thrice elected the prime minister between 1996 and 1999 and is the only non-Congress prime minister to complete the full term of five years, from 1999 to 2004. As his health deteriorated, he had slowly withdrawn himself from public life and was confined to his residence for years.",
"description": "NEW DELHI: Former Prime Minister's condition is improving and he is being monitored by a team of doctors round-the-clock, sources at the AIIMS said on Friday.The BJP stalwart continues to be in the ICU of the Cardio-thoracic Centre at the hospital.\"Former Prime Minister Atal Bihari Vajpayee is stable. He continues to show improvement and is being monitored by the team of doctors,\" the All India Institute of Medical Sciences (AIIMS) said in a statement.AIIMS director Randeep Guleria had, on Wednesday, said the 93-year-old leader was showing significant improvement and the doctors were hopeful of his full recovery in the next few days.",
"time_scraped": "2018-08-16 01:32:54.408976",
"article_id": "64605635",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64605630,imgsize-123691,width-400,resizemode-4/64605630.jpg",
"path": "full/e45901bf7b23340ca3640ed7de750865e7c47f35.jpg",
"checksum": "eb3c8ca95d027abb95d21709c75d9707"
}
]
}