{
"source_article_link": "https://timesofindia.indiatimes.com/india/mamata-seeks-time-from-lg-to-meet-kejriwal-permission-denied/articleshow/64616382.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Mamata denied permission to meet Kejriwal by Delhi LG: AAP",
"date_published": "2018-06-16T21:20:34+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64616388,imgsize-566139,width-400,resizemode-4/64616388.jpg"
],
"article_body": "NEW DELHI: Lt Governor Anil Baijal on Saturday denied permission to chief minister for meeting her Delhi counterpart , who has been protesting at the LG's office in the national capital, an AAP leader alleged. \"Permission denied by LG. Extremely sad state of affairs,\" (AAP) leader Raghav Chadha tweeted.    Kejriwal alleged that the Prime Minister's Office (PMO) has directed Baijal to refuse permission to Banerjee to meet him. \"I don't think Hon'ble LG can take such a decision on his own. Obviously, the PMO has directed him to refuse permission. Just like IAS strike is being done at the PMO's instance.\" \"We live in a democracy. Can PM deny Hon'ble CMs of other states to meet CM of another state? Raj Niwas is none's personal property. It belongs to the people of India,\" he said in a series of tweets. Kejriwal, accompanied by his deputy Manish Sisodia and ministers Satyendar Jain and Gopal Rai, have stayed put at the LG office demanding that Baijal direct IAS officers to end what the AAP described as their \"strike\" and approve doorstep ration delivery scheme.",
"description": "NEW DELHI: Lt Governor Anil Baijal on Saturday denied permission to chief minister for meeting her Delhi counterpart , who has been protesting at the LG's office in the national capital, an AAP leader alleged. \"Permission denied by LG. Extremely sad state of affairs,\"",
"time_scraped": "2018-08-18 06:01:03.400791",
"article_id": "64616382",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64616388,imgsize-566139,width-400,resizemode-4/64616388.jpg",
"path": "full/333d668360d6773b3e2456acd614a0b061c5ee3d.jpg",
"checksum": "81abdf75d0efb550ea201355855286c0"
}
]
}