{
"source_article_link": "https://timesofindia.indiatimes.com/india/president-ram-nath-kovind-leaves-on-3-nation-visit-to-greece-suriname-cuba/articleshow/64616074.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "President Ram Nath Kovind to deliver India's Europe policy in Athens",
"date_published": "2018-06-17T04:25:06+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64616112,imgsize-132017,width-400,resizemode-4/64616112.jpg"
],
"article_body": "NEW DELHI: As President Ram Nath Kovind makes his first trip to countries outside Africa, the Indian government is using the President to deliver an important policy speech in on Monday. To be seen as a complement to the prime minister’s Dialogue speech where he outlined India’s approach to the Indo-Pacific, the President is expected to affirm the governing principles of India’s Europe policy. Kovind is travelling to Greece, and Suriname this week. At the Hellenic Foundation for Europe and Foreign Policy in Athens, Kovind will say what Modi said in Singapore — that India is committed to a “rules-based international order” and “multipolarity in international governance”; connectivity and investment that are viable, transparent and sustainable and don’t leave behind mountains of debt. he will emphasise the role of development assistance that has worked between Europe and India — India, for instance, is expected to pick up a big slice of development assistance in the coming decades. He will join forces with Europe to push back against unilateralism and protectionism, and ask to preserve the global trading system. A third area where Kovind will indicate Indian alignment with Europe is in economy and ecology marching together in the development space. In 2017, Modi made a distinct turn towards making Europe India’s major sustainable development and environment partner after it became clear that Trump’s US was moving away from those goals. According to joint secretary Subrata Bhattacharjee in the MEA, Kovind will hold discussions with his counterpart, Greek president Prokopis Pavlopoulos and visit the Phaleron Commonwealth war cemetery to lay a wreath for 74 Indian soldiers who fought there in World War 2. Diaspora issues will dominate Kovind’s visit to Suriname where he is scheduled to celebrate the international day of yoga with Indian expatriates. Prime minister will also travel to Latin America later this year, when he goes to Argentina for the G-20 summit.",
"description": "President Kovind is expected to spell out the governing principles of India's Europe policy as he embarks on a tour of Greece, Cuba and Suriname next week Diaspora issues will dominate Kovind’s visit to Suriname where he is scheduled to celebrate the international day of yoga with Indian expatriates",
"time_scraped": "2018-08-20 18:00:54.849720",
"article_id": "64616074",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64616112,imgsize-132017,width-400,resizemode-4/64616112.jpg",
"path": "full/7b2c1d2eddf9b4077545746a375a5e995093b761.jpg",
"checksum": "c80c1886db7d6356ebdfe339c429afe1"
}
]
}