{
"source_article_link": "https://timesofindia.indiatimes.com/india/centre-may-face-chandrababu-naidu-ire-for-cheating-andhra-pradesh/articleshow/64618094.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Centre may face Chandrababu Naidu ire for 'cheating' Andhra Pradesh",
"date_published": "2018-06-17T04:04:18+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64618093,imgsize-722502,width-400,resizemode-4/64618093.jpg"
],
"article_body": "NEW DELHI: CM Chandrababu Naidu is set to hit out at the government at Sunday's meeting of the Niti Aayog governing council, blaming the Centre for \"misleading\" the people of the state on granting special category status, making them feel \"cheated\". Naidu, until recently a NDA ally, is seeking to become a rallying point for opposition parties ahead of next year's elections. He is hoping to use the Modi government's \"failure\" to \"honour its commitment\" as a key issue in the Andhra elections that coincide with the Lok Sabha polls. A 20-page speech prepared for the Niti Aayog meeting, to be chaired by Modi, will begin with the need for a special package for Andhra after Telangana was created and will accuse the Centre of refusing to implement the assurance of a Special Category Status given to Andhra Pradesh made by the then PM (Manmohan Singh)in the Rajya Sabha. \"Reacting to the repeated demands of the Government of Andhra Pradesh for issuing orders according Special Category Status, the Union Government tried to mislead the people of Andhra Pradesh by announcing Special Assistance Measure in lieu of Special Category Status, on the ground that the 14th Finance Commission had done away with Special Category Status. On one hand the Government of India states that considering the recommendations of the 14th Finance Commission, special category status cannot be given to any state, on the other hand it has extended the benefits of special category status to the 11 erstwhile special category states. Therefore, the people of Andhra Pradesh feel cheated...,\" a document prepared for the meeting said. Naidu will also point to BJP manifesto that had \"assured\" of special category status for 10 years.",
"description": "Naidu is set to hit out at the Modi govt, blaming the Centre for \"misleading\" the people Andhra on granting special category status, making them feel \"cheated\" Naidu will also point to BJP manifesto that had \"assured\" of special category status for 10 years",
"time_scraped": "2018-08-17 09:00:44.302543",
"article_id": "64618094",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64618093,imgsize-722502,width-400,resizemode-4/64618093.jpg",
"path": "full/fd57424f037c9c800a9961cef1b976659ae28ec6.jpg",
"checksum": "b197c8febc312b34adc906cf67eb925b"
}
]
}