{
"source_article_link": "https://timesofindia.indiatimes.com/india/rajiv-assassination-convicts-mother-seeks-mercy-killing-of-son/articleshow/64620613.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Rajiv assassination convict's mother seeks 'mercy killing' of son",
"date_published": "2018-06-17T12:19:26+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "CHENNAI: With President Ram Nath Kovind reportedly rejecting government's plea to release seven assassination convicts, the mother of one of them has demanded \"mercy killing\" of her son. Arputhammal, the mother of A G Perarivalan, recalled the recent assertion by the Tamil Nadu government that it was for the release of the convicts including her son. The seven convicts -- Murugan, Perarivalan, Santhan, Jayakumar, Robert Payas, Ravichandran and Nalini have been in jail for over 20 years now. Speaking to reporters in , Arputhammal said \"we are now frustrated\" following the prolonged legal battles and the latest development. \"We don't want this life anymore. I am planning to petition the Central and the state governments to kill us. I am going to do that... please do mercy killing of my son,\" she said. Arputhammal recalled an earlier statement of an ex-CBI official, who recorded Perarivalan's statement, to a court that part of the convict's confession was \"omitted.\" \"My son was taken by police on the pretext of an inquiry (in connection with the case) when he was 19-year-old and now he is 47. His youth and prime (of his life) have been lost,\" she said. Arputhammal said even Congress President has forgiven the convicts. As per the prosecution's case, Perarivalan had procured two batteries that were used in the belt bomb used to kill the former Prime Minister at in Tamil Nadu in May 1991 during an election rally. The Tamil Nadu government had on June 5 said that it was for the release of Rajiv Gandhi assassination case convicts but the matter was pending before the Supreme Court. \"There is no second opinion\" that the convicts in the case should be freed, Law Minister C Ve Shanmugam had told the state assembly during a debate.",
"description": "CHENNAI: With President Ram Nath Kovind reportedly rejecting government's plea to release seven assassination convicts, the mother of one of them has demanded \"mercy killing\" of her son. Arputhammal, the mother of A G Perarivalan, recalled the recent assertion by the Tamil Nadu government that it was for the release of the convicts including her son. The seven convicts -- Murugan, Perarivalan, Santhan, Jayakumar, Robert Payas, Ravichandran and Nalini have been in jail for over 20 years now.",
"time_scraped": "2018-08-21 03:00:35.422388",
"article_id": "64620613",
"article_category": "IndiaNews",
"image_details": []
}