{
"source_article_link": "https://timesofindia.indiatimes.com/india/yoga-ensures-wellness-peace-of-mind-pm-modi/articleshow/64638187.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Yoga ensures wellness, peace of mind: PM Modi",
"date_published": "2018-06-18T21:39:42+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64638168,imgsize-149850,width-400,resizemode-4/64638168.jpg"
],
"article_body": "NEW DELHI: Ahead of the fourth Yoga Day celebrations on June 21, Prime Minister on Monday said it makes people better individuals in thought, action, knowledge and devotion. He also said that yoga is not just a set of exercises that keeps the body fit, it is a \"passport\" to health assurance and a key to fitness and wellness. In a video message posted on his Twitter handle, the prime minister said yoga is one of the most precious gifts given by the ancient Indian sages to humankind. \"Yoga is not only what you practise in the morning. Doing your day-to-day activities with diligence and complete awareness is a form of yoga as well,\" he said. Free from illness, a path to wellness -- that is the path of yoga, he said. \"...it teaches us to see others the same as ourselves, yoga makes us better individuals in thought, action, knowledge and devotion,\" he said.  He said the set of exercises bring about oneness among the mind, body and intellect. \"We begin to understand ourselves much better, which also makes us understand others better.\" Referring to the \"problems of modern lifestyle\", he said that people suffer from stress-related ailments and also lifestyle-related diseases such as diabetes and hypertension. \"Stress and depression have become silent killers,\" he said. He said, in a world of excess, yoga promises restraint and balance. \"In a world suffering from mental stress, yoga promises calm; in a distracted world, yoga helps focus; in a world of fear, yoga promises hope, strength and courage,\" he said in his message. He said yoga offers a solution to ailments and practising it helps combat stress and find peace. On June 21, he will lead a massive mass yoga event in Dehradun.",
"description": "NEW DELHI: Ahead of the fourth Yoga Day celebrations on June 21, Prime Minister on Monday said it makes people better individuals in thought, action, knowledge and devotion. He also said that yoga is not just a set of exercises that keeps the body fit, it is a \"passport\" to health assurance and a key to fitness and wellness. In a video message posted on his Twitter handle, the prime minister said yoga is one of the most precious gifts given by the ancient Indian sages to humankind. \"Yoga is not only what you practise in the morning. Doing your day-to-day activities with diligence and complete awareness is a form of yoga as well,\" he said.",
"time_scraped": "2018-08-19 00:45:04.622705",
"article_id": "64638187",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64638168,imgsize-149850,width-400,resizemode-4/64638168.jpg",
"path": "full/8203c03a52ce58edea7bcacf366c208dcc40e854.jpg",
"checksum": "807469a1b3f5580f172808357bba87be"
}
]
}