{
"source_article_link": "https://timesofindia.indiatimes.com/india/who-authorised-the-dharna-delhi-high-court-asks-aap-ministers/articleshow/64630757.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "'Who authorised the dharna?' Delhi high court asks AAP ministers",
"date_published": "2018-06-18T17:09:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64630740,imgsize-28740,width-400,resizemode-4/64630740.jpg"
],
"article_body": "NEW DELHI: (HC) today asked who authorised the , or 'dharna', that Delhi's Aam Aadmi Party (AAP) government ministers including Delhi chief minister (CM) have been on since June 11 at the Lieutenant Governor's official residence. The observation by a bench of Justices A K Chawla and Navin Chawla came during the hearing of two petitions, one against the sit-in by and the others against the alleged strike by the IAS officers of Delhi government. The HC was also today approached by MLA Vijender Gupta who's seeking a court order to Kejriwal to end his 'dharna'. The AAP leaders are demanding that IAS officers in the Capital end their 'undeclared strike'. Kejriwal, deputy chief minister Manish Sisodia and cabinet minister Gopal Rai and have been on a sit-in strike at Raj Niwas, the official residence of Lieutenant Governor Anil Baijal, since June 11. They want Baijal to issue a directive to the civil servants to end their strike, among other demands. The lawyer representing the Delhi government ministers told the court that these IAS officers yesterday acknowledged they aren't attending meetings called by ministers. The HC turned the question on the AAP leaders. \"Thing is that you're sitting on a 'dharna'. Who authorized to sit on a dharna like this?\" asked the HC.   When the Delhi government lawyer said it was the ministers' individual decision, the HC again demanded to know, \"Is it authorised?\", and added that such a demonstration can't be termed a strike. \"This can’t be called a strike. You can’t go inside someone’s office or house and hold a strike there,\" the HC added. The bench pointed out that the CM and others are sitting inside the LG's office and not outside his office or at the door. The bench also decided to make the IAS association a party to the proceedings and adjourned the case for Friday. The Capital's bureaucrats are allegedly on strike to protest an alleged assault on chief secretary Anshul Prakash in February by two AAP MLAs at Kejriwal's residence. Delhi's IAS association yesterday held an unprecedented press conference to counter AAP's claim that its officers are on strike and said that they are being \"targeted \"and \"victimised\". The officers were addressing the media after Delhi government alleged that bureaucrats in the national capital have been \"hindering\" the work of the AAP-led government and have alleged that they have been staging a strike for the last four months. Last week, Kejriwal wrote to Prime Minister , seeking his intervention to end the IAS officers' \"strike\" claiming that Lt Governor Baijal was doing \"nothing\" to break the impasse. In his letter to Modi, Kejriwal cited instances when the government work was stuck as the officers have not been attending meetings with ministers for the past three months. He said cleaning of drains before monsoon, setting up of mohalla clinics and measures to curb air pollution in Delhi are stuck because of the alleged strike by the IAS officers. Two days ago, several opposition chief ministers came out in support of the Kejriwal government. CMs , N Chandrababu Naidu, Pinarayi Vijayan and H D Kumaraswamy urged PM Modi to resolve Kejriwal's standoff with the bureaucracy in the Capital. The CMs sought Modi out during the meeting of the Niti Aayog's governing council here on Sunday with Banerjee tweeting, \"I, along with CMs of Andhra Pradesh, and Kerala, have requested PM today to resolve problems of the Delhi government immediately.\"",
"description": "AAP leaders are demanding IAS officers in the Capital end their 'undeclared strike' They  have been on a protest sit-in since June 11 in the LG's official residence  'This sit-in can’t be called a strike. You can’t go inside someone’s office or house and hold a strike there,\" the HC said",
"time_scraped": "2018-08-19 09:00:22.696011",
"article_id": "64630757",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64630740,imgsize-28740,width-400,resizemode-4/64630740.jpg",
"path": "full/aa30bb200b1f5c07479eee3e4aff72bf468ff549.jpg",
"checksum": "fd598cb419335ea3809c58f44bc42e1a"
}
]
}