{
"source_article_link": "https://timesofindia.indiatimes.com/india/indian-coast-guard-fleet-4th-largest-in-the-world/articleshow/64636279.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Indian Coast Guard fleet 4th largest in the world",
"date_published": "2018-06-18T18:57:09+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "VISAKHAPATNAM: Additional Director General (Operations and Coastal Security) of V Sri Ramachandra Murthy said that fleet has steadily grown over the years and now stood at fourth largest CG in the world. Now, it has plans to achieve the fleet strength of 200 ships and 100 aircraft by the year 2023. Nearly, 60 surface platforms and 15 work boats are under construction at various Indian Shipyards. Presently, the CG has 136 ships, 62 aircraft and over 13,000 personal, he said. Addressing the gathering after commissioning the Fast Patrol Vessel (FPV) , the fifth and last of the FPV series constructed by the Limited (HSL) here at the Coast Guard jetty, the ADG VSR Murthy said five more ships will be based at Vizag, Kakinada and Krishnapatnam of Andhra Pradesh in the next two years. The first Telugu man to hold one of the highest posts in the Coast Guard, additional director general Murthy said that they have plans to build a jetty jointly with at Kakinada. As part of coastal security network phase II, six more radar stations on the coastline of AP would be established to ensure near gap-free electronic surveillance. He further said that the present security scenario in the maritime domain dictates the need to maintain a constant vigil and preparedness to varies maritime challenges. Indian Coast Guard is not just safeguarding India’s maritime interests round the clock, but also emerged as credible agency in combating maritime crimes, conducting maritime search and rescue, pollution response at sea and also inter-operability of men and platform in testing times, the three-star rank officer said. The ADG said ICG has institutionalised cooperation with various coastguards by signing MoU with seven countries towards strengthening regional cooperation in the field of maritime safety and environmental protection. It has also signed an MoU for cooperation on response to oil and chemical pollution in South Asian Sea region covering India, Pakistan, Bangladesh, Sri Lanka and Maldives. The coast guard commander eastern seaboard ADG KR Nautiyal said that coast guard is prepared to face any challenge in the present scenario and it has been saving one life at sea every alternative day apart from its other duties. The HSL CMD Sarat Babu said that they have faced many hurdles in achieving the maximum speed of the vessel and finally met with the requirements. The 51 meter ship is equipped with most advanced and sophisticated navigational and communication sensors and other equipment. It is propelled by three MTU 4000 series engines of 2720 KW capacity each, coupled with three Rolls Royce Kamewa Jets and can achieve a maximum speed of 34 knot. The vessel has a complement of 4 officers and 34 men commanded by Commandant Navdeep Safaya will be based at Vizag.",
"description": "VISAKHAPATNAM: Additional Director General (Operations and Coastal Security) of V Sri Ramachandra Murthy said that fleet has steadily grown over the years and now stood at fourth largest CG in the world. Now, it has plans to achieve the fleet strength of 200 ships and 100 aircraft by the year 2023. Nearly, 60 surface platforms and 15 work boats are under construction at various Indian Shipyards. Presently, the CG has 136 ships, 62 aircraft and over 13,000 personal, he said. Addressing the gathering after commissioning the Fast Patrol Vessel (FPV)",
"time_scraped": "2018-08-19 21:00:26.218871",
"article_id": "64636279",
"article_category": "IndiaNews",
"image_details": []
}