{
"source_article_link": "https://timesofindia.indiatimes.com/india/all-eyes-on-chinas-reachout-to-mamata-banerjee/articleshow/64647779.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "All eyes on China’s reachout to Mamata Banerjee",
"date_published": "2018-06-19T15:33:51+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64641824,imgsize-331663,width-400,resizemode-4/64641824.jpg"
],
"article_body": "KOLKATA: China is readying to roll out the red carpet for West Bengal chief minister , who is all set to visit the country for a week from June 22. This comes at a time when the Trinamool Congress leader is positioning herself as the leader of the anti-BJP alliance, the Communist parties appear to have weakened further and the Narendra Modi government at the Centre is showing no signs of softening its stance on the Xi Jinping’s regime’s expansive (BRI). Banerjee will be accompanied by the state finance minister and she will visit two of China’s biggest cities, Beijing and Shanghai, according to people privy to the details of the trip. China’s consul general in Kolkata, Ma Zhanwu, told ET, “West Bengal chief minister is our guest in China and we will be organising several meetings with the delegation led by the chief minister. There will be three-phase meetings. Political leaders, government functionaries, business leaders and industry chambers will meet her there. We are expecting some important MoUs to be signed.” Banerjee will also interact with university students, he said. Although Banerjee had received several invitations in the past two years from Chinese companies, provinces and government of China, this is the first time the Ministry of External Affairs (MEA) has given its assent to such a trip, said one of the persons cited earlier. He said that there can be informal discussions on the BRI during Banerjee’s visit as West Bengal had featured in the document of the 19th national congress of the Communist Party of China. This was because the state lies in the region covered by the BRI and the BCIM (Bangladesh-China-India-Myanmar Economic Corridor), he said. A senior MEA official ruled out any formal discussion on the BRI during Banerjee’s visit saying India’s foreign policy is the exclusive domain of the central government. The official further said all MoUs would probably be vetted by the MEA, which is facilitating the visit. “It will surely enhance better understanding of opportunities and challenges at political leadership level. The focus has to be on developing win-win partnerships for promoting growth and employment in West Bengal and helping bridge national trade deficit,” said Ashok Dhar, director at Observer Research Foundation, Kolkata.",
"description": "KOLKATA: China is readying to roll out the red carpet for West Bengal chief minister , who is all set to visit the country for a week from June 22. This comes at a time when the Trinamool Congress leader is positioning herself as the leader of the anti-BJP alliance, the Communist parties appear to have weakened further and the Narendra Modi government at the Centre is showing no signs of softening its stance on the Xi Jinping’s regime’s expansive (BRI). Banerjee will be accompanied by the state finance minister",
"time_scraped": "2018-08-17 21:00:23.187960",
"article_id": "64647779",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64641824,imgsize-331663,width-400,resizemode-4/64641824.jpg",
"path": "full/f894642b30a0c5884f1521e8247e760f3a11dd21.jpg",
"checksum": "247d4a2d8898bcb83fd92a6abf4b7558"
}
]
}