{
"source_article_link": "https://timesofindia.indiatimes.com/india/lateral-entry-centre-working-on-rigorous-selection-model/articleshow/64647908.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Lateral entry: Centre working on rigorous selection model",
"date_published": "2018-06-19T15:39:21+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64639435,imgsize-64675,width-400,resizemode-4/64639435.jpg"
],
"article_body": "Barely a week after its notification on officially allowing into the administration, the Centre has started working towards putting a rigorous, testing mechanism for candidates seeking direct entry into senior . The process is likely to include vetting of the applications by independent teams of sectoral, governance and HR experts from the private and public sector. In addition, representatives from the government will scrutinize the personality and potential of the candidates. This system will slowly be made part of the institutionlised way of recruiting bureaucrats by the Union Public Services Commission, official sources told ET. The interview panels will comprise secretaries and other senior government officials, said a top official. The system will \"be far more rigorous than the present selection\", the official added. According to those in the know of the matter, the model being put together is a \"multi-dimensional, multi-level comprehensive screening procedure\" that will test all aspects of domain, functional and leadership capabilities of the candidates. It will include aptitude, personality and psychological testing, apart from mapping the candidate’s domain knowledge, sectoral experience, functional skills and behavioural competencies with the nature and needs of the positions in the government that he or she is being considered for. The government recently invited applications for appointments to 10 joint secretary-level posts from “outstanding individuals”, including from the private sector, with expertise in the areas of revenue, financial services, economic affairs, agriculture, cooperation and farmers’ welfare, road transport and highways, shipping, environment, forests and climate change, new and renewable energy, civil aviation, and commerce. According to top sources, despite criticism of the move from several fronts and even some in the IAS lobby warning against it, the Prime Minister and his team are determined to go ahead with it. The process of identifying best names from the corporate world and vetting them, including obtaining approvals from investigative agencies, has already begun, a senior official said. \"For instance, in a top-level meeting, the PM himself insisted on bringing in Indians into the system to build Team India, to specifically choose people who have not just unquestionable domain expertise experience but also a passion to serve the nation. The PM is keen that the talent pool has to be large enough for the government to choose the best from. Hence there is emphasis even on Indians deputed in foreign countries, taking care of important work,\" a senior official said. The PM has been clear that the search should not be constrained by any limitations of service, cadre or employment from across the public as well as private sectors, the official added. According to sources, the process of allowing lateral entry in a systematic way had started in 2014, when in November that year Prime Minister asked the secretaries of various ministries to evaluate and prepare for the allowing of lateral entry. After that, a group of secretaries discussed the idea over three meetings and listed it as central reform that the government should consider. The Department of Personnel and Training then put out a public notice to institutionalise a system of lateral entry in mid-2017. Besides studying the administrative setups in the US, UK, Belgium, Australia and New Zealand which are known to have many lateral entrants, top officials in the Modi government carefully looked into a UPSC-commissioned report of the Civil Services Examination Review Committee headed by YK Alagh (2001) that had recommended lateral entry into middle and senior levels of the government. The Justice BN Srikrishna-headed Sixth Central Pay Commission report (2006) said lateral entry could \"ensure entry and retention of talent in the government even for those jobs that have a high demand and premium in the open market\", sources said. \"Lateral entry is not a new phenomenon with people like Manmohan Singh, Mantosh Sondhi, V Krishnamurthy, PK Basu, PP Nambiar, MS Swaminathan, Verghese Kurien, Vijay Kelkar, Montek Singh Ahluwalia, Sam Pitroda, Nandan Nilekani, Raghu Raman, DV Kapur and RV Shahi making their way into the system through lateral entry. Even in the current government, we have had people like Param Iyer plus Rajesh Kotecha, Adil Zainulbhai, Arvind Panagariya, Kamal Kishore, R Ramanan and Arvind Gupta … By making lateral entry a part of the system, the PM has made an important political intervention,\" a senior official said.",
"description": "Barely a week after its notification on officially allowing into the administration, the Centre has started working towards putting a rigorous, testing mechanism for candidates seeking direct entry into senior . The process is likely to include vetting of the applications by independent teams of sectoral, governance and HR experts from the private and public sector. In addition, representatives from the government will scrutinize the personality and potential of the candidates. This system will slowly be made part of the institutionlised way of recruiting bureaucrats by the Union Public Services Commission, official sources told ET.",
"time_scraped": "2018-08-19 18:00:10.399098",
"article_id": "64647908",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64639435,imgsize-64675,width-400,resizemode-4/64639435.jpg",
"path": "full/9c7da32ed1937d4557982617592378643f9dd4de.jpg",
"checksum": "6623db9f0a32fa9467ec09280c08b42a"
}
]
}