{
"source_article_link": "https://timesofindia.indiatimes.com/india/us-postpones-22-dialogue-with-india/articleshow/64770170.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "US postpones '2+2 dialogue' with India",
"date_published": "2018-06-28T00:36:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: In a surprise late evening announcement, the US postponed the 2+2 dialogue between the foreign and defence ministers of India and US scheduled for July 6. MEA spokesperson, Raveesh Kumar tweeted, US @SecPompeo spoke to EAM @SushmaSwaraj a short while ago to express his regret and deep disappointment at the US having to postpone the 2+2 Dialogue for unavoidable reasons. “US @SecPompeo sought EAM @SushmaSwaraj understanding, and they agreed to identify new mutually convenient dates to hold the Dialogue at the earliest, in India or the US.” The dialogue between Mike Pompeo-James Mattis and Sushma Swaraj-Nirmala Sitharaman, which has already been postponed several times, would have been the first high level official dialogue between the two countries in a very long time. It also shows India has been relegated to the background in the Trump administration’s interests. Sources said while the minister was tight-lipped about the reasons, it appears the US has suddenly scheduled another high level meeting on that day which clashed with the India dialogue. Since India is not high on the US’ priorities right now, it has got pushed to the back. Sources said an announcement is expected from the US in the coming days. The postponement comes at a time when the dissonance between US and India is growing, both on the trade front and on Russia and , where US decisions are seen to be impacting India’s interests.",
"description": "NEW DELHI: In a surprise late evening announcement, the US postponed the 2+2 dialogue between the foreign and defence ministers of India and US scheduled for July 6. MEA spokesperson, Raveesh Kumar tweeted, US @SecPompeo spoke to EAM @SushmaSwaraj a short while ago to express his regret and deep disappointment at the US having to postpone the 2+2 Dialogue for unavoidable reasons. “US @SecPompeo sought EAM @SushmaSwaraj understanding, and they agreed to identify new mutually convenient dates to hold the Dialogue at the earliest, in India or the US.” The dialogue between Mike Pompeo-James Mattis and Sushma Swaraj-Nirmala Sitharaman, which has already been postponed several times, would have been the first high level official dialogue between the two countries in a very long time. It also shows India has been relegated to the background in the Trump administration’s interests. Sources said while the minister was tight-lipped about the reasons, it appears the US has suddenly scheduled another high level meeting on that day which clashed with the India dialogue. Since India is not high on the US’ priorities right now, it has got pushed to the back. Sources said an announcement is expected from the US in the coming days.",
"time_scraped": "2018-08-19 00:44:47.024547",
"article_id": "64770170",
"article_category": "IndiaNews",
"image_details": []
}