{
"source_article_link": "https://timesofindia.indiatimes.com/india/coffee-table-book-launched-on-kargil-war-hero/articleshow/64805724.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Coffee table book launched on Kargil War hero",
"date_published": "2018-06-30T15:58:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "HYDERABAD: A coffee table book on hero Major Padmapani Acharya was released here on Saturday. He was posthumously awarded the second highest Indian military decoration, the , for his actions during the Kargil War. Major Padmapani Acharya was a resident of Hyderabad and commissioned into 2 and led his company in the Kargil war. He placed his call for duty and service for nation above his life and made supreme sacrifice on June 28 1999, while leading a platoon to capture Tololing through raining artillery shells from the enemy, according to a statement. \"The book documents the collection of his letters to home, some photographs and a brief write up on his life,\" said Major Acharya's daughter Aparajita, who was born three months after his martyrdom. The book was jointly launched by Major N. Srinivas Rao, , Sub Area and Aparajita. \"Major Padmapani Acharya led his men through the enemy fire and artillery shelling and made supreme sacrifice to accomplish the mission assigned to him. He is not only a role model for the soldiers, he is a role model for the nation,\" said Major General Srinivas Rao.",
"description": "HYDERABAD: A coffee table book on hero Major Padmapani Acharya was released here on Saturday. He was posthumously awarded the second highest Indian military decoration, the , for his actions during the Kargil War. Major Padmapani Acharya was a resident of Hyderabad and commissioned into 2 and led his company in the Kargil war.",
"time_scraped": "2018-08-16 15:00:22.488184",
"article_id": "64805724",
"article_category": "IndiaNews",
"image_details": []
}