{
"source_article_link": "https://timesofindia.indiatimes.com/india/as-songachi-changes-colours-visitors-drawn-by-art-not-lust/articleshow/64811133.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "As Songachi changes colours, visitors drawn by art, not lust",
"date_published": "2018-07-01T05:15:33+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64811142,imgsize-197033,width-400,resizemode-4/64811142.jpg"
],
"article_body": "KOLKATA: seems to have undergone a transformation in the middle of the World Cup season, with its residents painting the in myriad hues of gold-and-green and blue-and-white to celebrate football. The transformation has been such that since the start of the World Cup, some of the visitors to the city’s biggest red-light area have been drawn by art and not lust, with even those who consider this area taboo dropping by to see for themselves the images that have taken social media by storm. The walls, streets and pavements have all been painted in colours of , with life-size posters and banners of Neymar, Coutinho and T Silva — as well as those of blue-and-white Argentine heroes, like Messi and Di Maria — adorning the bylanes. “I saw photographs of the decorated alleys in a Facebook post by a friend and found others sharing similar content. I could not resist shrugging off my inhibitions as I went there for the first time in my life last Thursday,” said software designer and avid photographer Diptadeep Bhattacharya. “Almost every street in north Kolkata used to boast of street art, be it political satire or football or cricket. Unfortunately, that had almost disappeared. It is so nice to see the boys here revive it,” said interior designer Subhamoy Roy. A group called the Weekend Heritage Photo Walk has lined up a visit to Sonagachhi on Sunday, an unthinkable proposition till last week. “A lot of the members are still iffy about it but once I showed them a few photographs that had been posted on Facebook, the inhibitions vanished,” said graphic designer Soumyajit Banerjee. There, however, has been another unlikely side-effect of this football mania. “When the matches are being played, customer count dips,” a Sonagachhi sex worker said. But that has not dampened the enthusiasm. Residents say Sonagachi has always had a close bond with football and the relationship has strengthened since the formation of the Durbar Football Academy, which campaigns for a better life for children of sex workers through the medium of football. “Football holds a special place for both sex workers as well as their children in this part of the city and we already have hundreds of children training in our academy. Several of them are playing professional football,” Durbar Mahila Samanway Committee chief advisor Smarajit Jana said.",
"description": "KOLKATA: seems to have undergone a transformation in the middle of the World Cup season, with its residents painting the in myriad hues of gold-and-green and blue-and-white to celebrate football. The transformation has been such that since the start of the World Cup, some of the visitors to the city’s biggest red-light area have been drawn by art and not lust, with even those who consider this area taboo dropping by to see for themselves the images that have taken social media by storm. The walls, streets and pavements have all been painted in colours of , with life-size posters and banners of Neymar, Coutinho and T Silva — as well as those of blue-and-white Argentine heroes, like Messi and Di Maria — adorning the bylanes.",
"time_scraped": "2018-08-17 03:00:56.352458",
"article_id": "64811133",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64811142,imgsize-197033,width-400,resizemode-4/64811142.jpg",
"path": "full/b61134938c0187310eb610ba889df9eaf6062759.jpg",
"checksum": "bfcfb24465e647fbc0a9ffd116eb19c5"
}
]
}