{
"source_article_link": "https://timesofindia.indiatimes.com/india/supreme-court-to-uttar-pradesh-over-fake-encounters/articleshow/64824250.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Supreme Court to Uttar Pradesh over fake encounters",
"date_published": "2018-07-02T12:50:45+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64824251,imgsize-85577,width-400,resizemode-4/64824251.jpg"
],
"article_body": "NEW DELHI: The on Monday sought a response from the Uttar Pradesh government on a plea alleging that several fake encounters have taken place in the state in recent past. A bench comprising Chief Justice and Justices A M Khanwilkar and D Y Chandrachud issued notice to the Uttar Pradesh government on the PIL filed by the NGO, People's Union for Civil Liberty (PUCL). Lawyer Sanjay Parikh, appearing for PUCL, alleged that as many as 500 encounters have been carried out in Uttar Pradesh recently, in which a total of 58 persons have been killed. The bench did not accept the plea that the National Human Rights Commission (NHRC), which had earlier issued notice to the state government on the issue, be also made a party in the present proceeding.",
"description": "NEW DELHI: The on Monday sought a response from the Uttar Pradesh government on a plea alleging that several fake encounters have taken place in the state in recent past. A bench comprising Chief Justice and Justices A M Khanwilkar and D Y Chandrachud issued notice to the Uttar Pradesh government on the PIL filed by the NGO, People's Union for Civil Liberty (PUCL). Lawyer Sanjay Parikh, appearing for PUCL, alleged that as many as 500 encounters have been carried out in Uttar Pradesh recently, in which a total of 58 persons have been killed.",
"time_scraped": "2018-08-17 06:00:20.194640",
"article_id": "64824250",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64824251,imgsize-85577,width-400,resizemode-4/64824251.jpg",
"path": "full/3d840edb4faeaf0047a3e047bd9306e571224c2d.jpg",
"checksum": "70b50fe116a5ea46e5ab2af2b797232a"
}
]
}