{
"source_article_link": "https://timesofindia.indiatimes.com/india/kottayam-woman-elated-with-saudi-driving-licence/articleshow/64842099.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Kottayam woman elated with Saudi driving licence",
"date_published": "2018-07-03T17:10:15+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "KOTTAYAM: For Telma Jose, driving is not just a passion, but a feeling of independence. She used to go for work, supermarket, attend PTA meeting of her children and friends’ place driving her own car. But she was highly disappointed ever since she had relocated from England to three years ago. But now, the 46-year-old hailing from is thanking the Saudi government for lifting the world's only ban on female driving. She is among the first Indian woman to obtain a Saudi driving licence. Telma did not think twice when the Saudi government issued a notice regarding giving licence for women drivers from June 24. \"Based on my online application I was asked to appear for a test drive on June 26,\" said Telma. Telma cleared the test and was issued a driving licence on the same day afternoon. Since Telma had a British licence, she did not have to write the theory examination. She only had to submit a medical certificate along with the application which was sent online. Telma has been in Saudi Arabia along with family since 2015. She is working as the nursing administrator of King Faisal Specialist Hospital and Research Centre in the Saudi capital city of . Prior to her Saudi job, Telma was in in England where she was working in and Norwich university hospitals. Her husband Johnykutty was running a bar and restaurant there. However, ever since Telma came to Saudi on Deputation, the family shifted to Saudi Arabia. Telma owned a Mini Cooper in England. “In England, I depended on my car to go to places. But in Saudi, I felt tied down. Had to depend on Taxi every time. But now I am feeling independent,” she said. She had applied for a licence for five years and it will expire on May 2, 2023. She also said that it is only the initial days since women have started driving in Saudi Arabia. \"People are apprehensive. They feel there will be more accidents,” she said. The couple has got two children, Dana and Diaz. Dana is doing her Pharmacy PG in England while son is doing class nine in Riyadh. The family is on a 45-day holiday in their native village Koratti, in the South East part of .",
"description": "KOTTAYAM: For Telma Jose, driving is not just a passion, but a feeling of independence. She used to go for work, supermarket, attend PTA meeting of her children and friends’ place driving her own car. But she was highly disappointed ever since she had relocated from England to three years ago. But now, the 46-year-old hailing from is thanking the Saudi government for lifting the world's only ban on female driving. She is among the first Indian woman to obtain a Saudi driving licence. Telma did not think twice when the Saudi government issued a notice regarding giving licence for women drivers from June 24. \"Based on my online application I was asked to appear for a test drive on June 26,\" said Telma. Telma cleared the test and was issued a driving licence on the same day afternoon. Since Telma had a British licence, she did not have to write the theory examination. She only had to submit a medical certificate along with the application which was sent online. Telma has been in Saudi Arabia along with family since 2015. She is working as the nursing administrator of King Faisal Specialist Hospital and Research Centre in the Saudi capital city of",
"time_scraped": "2018-08-19 03:00:41.109947",
"article_id": "64842099",
"article_category": "IndiaNews",
"image_details": []
}