{
"source_article_link": "https://timesofindia.indiatimes.com/india/relief-for-aap-supreme-court-says-delhi-lieutenant-governor-cant-act-independently/articleshow/64850784.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Relief for AAP: Supreme Court says Delhi lieutenant governor can't act independently",
"date_published": "2018-07-04T14:35:57+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64852206,imgsize-219794,width-400,resizemode-4/64852206.jpg"
],
"article_body": "NEW DELHI: In a relief for Delhi's (AAP) government, the ( ) on Wednesday ruled that the capital's ( ) cannot act independently, can't obstruct the government's policy decisions and is bound by the state government's aid and advice.  The top court's five-judge Constitution bench made it absolutely clear that the LG has no independent decision-making power and cannot behave as an obstructionist when the Constitution gives primacy to the representative of the government. And it categorically said neither the LG nor the chief minister (CM) \"should feel superior to the other\". Delhi's AAP CM tweeted that this ruling was a victory for democracy.   \"Aid and advice under Article 239AA means that the LG is bound by aid and advice of elected govt, \" said chief justice Dipak Misra, who read out the judgement of three of five judges of the SC bench, while reading out his judgement.   Still, Justice Chandrachud, of the five judges on the bench did say given the unique case of Delhi, the Centre may, in exceptional cases, block decisions of the council of ministers if it is to do with the national interest. The SC was delivering its verdict in a case to do with the turf war between the Centre and Delhi's Arvind Kejriwal government over who should have more power to administer Delhi. The SC said that except for the three issues including land and law and order, over which the Centre has exclusive power, the Delhi government must be allowed to legislate and govern on other issues and the LG cannot stall decisions mechanically. That is, the LG should not mechanically refer all decisions of Delhi's council of ministers to the President merely by citing a difference of opinion. It's only in exceptional situations that the LG can refer the issue to President when he had legitimate and serious difference of opinion with the decision taken by he council of ministers headed by the Delhi CM. The SC said the Constitution mandates the council of minister headed by the Delhi chief minister to communicate all decisions to the LG but they do not require the LG's concurrence. The LG can only refer it to President if he has difference of opinion but he cannot sit on it, the top court said. \"The relationship between Centre and State government should be healthy…The LG must work harmoniously with the state, the LG and council of ministers have to be constantly aligned,\" said chief justice Dipak Misra. \"All constitutional functionaries must uphold constitutional morality and must function within the spirit of the Constitution. Constitutional trust must be displayed by all constitutional functionaries,\" said chief justice Dipak Misra while reading out the verdict. The SC ruling has hopefully provided closure to a long running political battle between the Centre and Delhi's AAP government over who has primacy in the (NCT). The five-judge constitution bench that delivered the ruling today comprised chief justice Dipak Misra and Justices A K Sikri, A M Khanwilkar, D Y Chandrachud and Ashok Bhushan. Since assuming office with an overwhelming majority, the AAP government has been having an ugly public spat with the Centre's representative, that is, Delhi's lieutenant governor (LG). The government has accused successive LGs of stalling its policy decisions relating to development work in the NCT. Meanwhile, the LG has on several occasions said that AAP submits proposals that don't fulfil procedures or are simply outside its powers. The AAP government had sought to know through the SC's constitutional interpretation whether NCT Delhi was a state, a Union Territory (UT) or a hybrid. It complained to the SC that it was facing a crisis in governance because after the Delhi High Court's August 2016 ruling that \"LG is boss of administration in Delhi\" ruling, Delhi cadre officers were \"increasingly reluctant\" to report to ministers. AAP fielded a battery of senior advocates - Gopal Subramanium, Rajeev Dhavan and Indira Jaising - and sought interpretation of Article 239AA of the Constitution, which according to the Centre created a state in Delhi but gave a major say in governance to the LG who had been clearly mandated to take a decision when there was disagreement between him and the Delhi government over governance issues. Appearing for the Centre, additional solicitor general Maninder Singh had said provisions of Article 239AA were crystal clear and there was no ambiguity as it categorically stated that in case of difference of opinion, the LG's view will prevail. The AAP government said the HC in 2016 erred in characterising the NCT of Delhi as a UT without considering the democratic rights of Delhiites. It wondered before the SC whether the Delhi government had any power to legislate, despite the NCT of Delhi having an assembly, on any subject when the reins of governance were entrusted solely to the LG and, in turn, to the Centre. The Kejriwal government had argued that the HC's finding that the LG was not bound by the aid and advice of the council of ministers headed by the chief minister was unsustainable in view of the constitutional provisions in Article 239AA, which categorically provided that LG \"shall act on the aid and advice of the council of ministers in respect of matters for which the legislative assembly of Delhi has the powers to make laws\". If the LG is not bound by the aid and advice of the council of ministers, there can be no question of the council of ministers being collectively responsible to the legislative assembly or citizens of Delhi as they have no control over the process of government decision making,\" the AAP government had said.",
"description": "A five-judge constitution bench of the SC pronounced the verdict The verdict was on the vexed question of who should have a major say in governing the NCT Since assuming office, Delhi's AAP government has been having an ugly public spat with Delhi's LG",
"time_scraped": "2018-08-19 00:44:46.350107",
"article_id": "64850784",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64852206,imgsize-219794,width-400,resizemode-4/64852206.jpg",
"path": "full/2ae308941874682800be8e7692205aea8bf03ca0.jpg",
"checksum": "95ed9ec4f2a577ec0bff76bce2e4d951"
}
]
}