{
"source_article_link": "https://timesofindia.indiatimes.com/india/sunanda-pushkar-death-case-shashi-tharoor-granted-anticipatory-bail/articleshow/64864577.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Sunanda Pushkar death case: Shashi Tharoor granted anticipatory bail",
"date_published": "2018-07-05T12:24:45+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: Delhi's Court today granted anticipatory bail to Congress MP in the death case, two days before he's been ordered to appear in court to stand trial in the case in which he's an accused. Tharoor also can't leave the country without informing the court, in addition to which he will have to furnish a bail bond of Rs 1 lakh. On June 5, a ordered Tharoor to appear on July 7, after taking cognizance of the chargesheet filed in the Pushkar death case. The court took cognizance of Tharoor's alleged offences of abetment of suicide and committing cruelty towards Pushkar. Tharoor's then wife Pushkar was found dead in Delhi's Leela Hotel four years ago. The Congress MP had two days ago filed for anticipatory bail. At the hearing yesterday, the Special Investigation Team (SIT) probing Pushkar's death objected to him being given anticipatory bail. Tharoor's counsel earlier told news agency ANI yesterday that the MP getting bail is \"inevitable\". \"SIT categorically stated in charge sheet that probe is concluded, and no custodial interrogation of any person is required. Law is very clear that if chargesheet is filed without arrest, bail is inevitable,\" said Tharoor's counsel. One June 5, the court said there's sufficient grounds to proceed against the Congress MP. \"I have heard the prosecutor. I have gone through and perused the chargesheet and the documents filed along with it. On the basis of police report (chargesheet), I take cognizance of offence of abetment of suicide of late Sunanda Pushkar and committing cruelty upon her by Dr Shashi Tharoor,\" the judge said. \"There exists sufficient grounds to proceed against Tharoor for commission of offences of Section 306 and 498 A of IPC. Issue summons to him for appearance for July 7,\" the court added. Tharoor's lawyer and senior advocate Vikas Pahwa told reporters immediately after the court pronounced the order that no offence was made out against the Congress leader and the prosecution's case was \"absurd and preposterous\". In May, four years after Pushkar was found dead in suite number 345 of the Leela Hotel, the Delhi Police filed a chargesheet + and named her husband and Congress MP Tharoor as an accused in the case. According to the chargesheet, Pushkar killed herself by consuming an overdose of antidepressant pills, alprazolam (Alprax), and was driven to taking the extreme step by her husband Though it was a murder probe with the FIR registered under IPC Section 302 (murder), police have charged Tharoor under Sections 306 (abetment) and 498A (cruelty by husband) of the Indian Penal Code. The chargesheet was filed before Metropolitan Magistrate Dharmender Singh at the Patiala House court. Police have concluded that it was a case of suicide and not murder. The FIR in the case was filed under section 302 IPC.",
"description": "Two days ago, Tharoor applied for anticipatory bail in a Delhi court in connection with the Sunanda Pushkar death case His bail plea came 2 days before he's to stand trial as an accused in the case His alleged offences are abetment of suicide and committing cruelty towards Pushkar",
"time_scraped": "2018-08-21 03:00:12.985270",
"article_id": "64864577",
"article_category": "IndiaNews",
"image_details": []
}