{
"source_article_link": "https://timesofindia.indiatimes.com/india/isro-conducts-first-crew-escape-test-for-indias-manned-mission-to-space/articleshow/64867214.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Isro conducts first crew escape test for India's manned mission to space",
"date_published": "2018-07-06T20:22:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64867316,imgsize-12672,width-400,resizemode-4/64867316.jpg"
],
"article_body": "NEW DELHI: Taking a first step towards the country's human space flight programme,(Isro) on Thursday morning successfully tested a capsule that will carry an Indian astronaut to space in future. The experiment on 'Pad Abort' orwas conducted at a test facility in Sriharikota.Explaining the nature of the test, Isro chairman K Sivan told TOI: \"The experiment on the 'Pad Abort' or crew bailout system at 7 am in Sriharikota was a grand success. Instead of a person, a crew model was used. The model was kept in a capsule and this was attached to a rocket engine. When the solid engine motor was fired and launched into air, the crew capsule got detached from the engine in air after some time, moved away from it, a parachute was deployed and the capsule landed safely at a designated spot on the sea. The 259-second test on the crew capsule was significant as this would be a crucial component of the indigenous human space flight programme. The experiment on the critical technology was meant to check the safety mechanism of the human space capsule and to see if the crew can bail out easily if any untoward accident happens during the test-flight of the spacecraft.\"On the upcoming tests related to the manned mission, Sivan said, \"Our next test will focus on aborting the capsule at flight mode. Like today's test, many components needed for the country's first manned mission will be tested in near future.\"Casting a light on various systems required for the manned mission, the Isro chairman said, \"A human space programme focuses on taking a human to space and bringing him back to the Earth safely. For that purpose, we will have to provide a life support system to our crew within the spacecraft. Therefore, we will have to make arrangement for continuous oxygen supply, controlled pressure and environment system, food supply, human waste discharge system and crew protection system involving the escape capsule.\"On the project budget, Sivan said, \"After today's successful test, we will now prepare a project report and submit the same to the government for approval.\"Since its inception in 1962, the Indian space organisation (INCOSPAR and later rechristened Isro in 1969) never actively engaged in any human space programme as it mainly focused on launching satellites to fulfil the country's requirements in the field of communication, navigation and earth observation. Though Isro has been working on a demonstrator test on a reusable launch vehicle that can carry both a spacecraft or a human, this was the first time when it was directly involved in the testing of a critical component of the human space programme.Till now, only three countries- Russia, US and China- have been able to send humans to space. Thursday's test shows Isro has taken up the challenge for the manned mission seriously and the indigenous human space flight programme could become a reality in some years.Though India is yet to launch a manned mission, Rakesh Sharma was the first Indian to go to space aboard a Soviet spacecraft in 1984. The former IAF officer was one of the 80 space experts and scientists who attended an Isro meeting on the manned mission on November 7, 2006 and endorsed a proposal for the indigenous human space flight programme.",
"description": "The crew escape system is being developed as part of the proposed human spaceflight programmeThursday's test lasted 259 seconds, and involved aborting the shuttle after launch in an emergency situationTest on Crew Bailout System or 'Pad Abort' at Sriharikota a success: Isro chief ",
"time_scraped": "2018-08-16 01:33:03.640547",
"article_id": "64867214",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64867316,imgsize-12672,width-400,resizemode-4/64867316.jpg",
"path": "full/7c4ce2e1da4675ef7b655608d7abfe4fa2fea279.jpg",
"checksum": "a04d658e5afde1ea2f693aaf966c26a9"
}
]
}