{
"source_article_link": "https://timesofindia.indiatimes.com/india/home-ministry-panel-to-monitor-cybercrimes/articleshow/64868887.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Home Ministry panel to monitor cybercrimes",
"date_published": "2018-07-05T15:14:31+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64861384,imgsize-74263,width-400,resizemode-4/64861384.jpg"
],
"article_body": "NEW DELHI: Union has decided to constitute a panel under a joint secretary to periodically monitor cybercrimes and ensure compliance of complaints by platforms that are used to spread offensive content which could precipitate law and order issues, a senior official said. The panel under joint secretary, cyber and information security (CIS), would periodically monitor objectionable cyber content and push for better coordination among law enforcement agencies and state police to block, remove or take action against objectionable information, the home ministry official told ET on condition of anonymity. Information collated by the panel would be reviewed by home secretary Rajiv Gauba to take a call on whether any issue requires intervention for seeking cooperation of social media platforms in criminal investigations, the person said. The initiative comes at a time when rumours circulated through social media have led to lynching of several innocent people in the country. Last week, five people were lynched in Maharashtra’s Dhule district and two others in Tripura on suspicion — triggered by rumours spread mainly through WhatsApp — that they were child-lifters. Last month, Gauba had chaired meeting with representatives of social media platforms such as Google, and Twitter to discuss measures required to filter malicious content — such as hate speech and video linked to terror, child pornography and fake news — from appearing on social media. Officials have told the social media platforms to ensure compliance and also take voluntary action to adhere to the law of the land here as they do in other countries. In that meeting, officials showed a chart of number of cases taken up with social media instruments and action taken by them since last two years. If social networks are used to peddle information that contravenes Sections 69 and 79 of the IT Act, it has to be addressed in a time bound manner, the networks were told, according to ministry officials. If Facebook CEO can outline different strategies to deal with fake news in the US, why the same sensitivity respecting individual and country’s internal security cannot be displayed in India’s context, a senior MHA officer commented. MHA now plans another round of meeting with Facebook, Twitter and WhatsApp representatives to put in place a mechanism to address fake news and other disturbing content, officials said. The ministry is also sensitising law enforcement agencies to enhance coordination with department of telecom, which is the nodal body to flag violation of IT Act with social media platforms.",
"description": "NEW DELHI: Union has decided to constitute a panel under a joint secretary to periodically monitor cybercrimes and ensure compliance of complaints by platforms that are used to spread offensive content which could precipitate law and order issues, a senior official said. The panel under joint secretary, cyber and information security (CIS), would periodically monitor objectionable cyber content and push for better coordination among law enforcement agencies and state police to block, remove or take action against objectionable information, the home ministry official told ET on condition of anonymity. Information collated by the panel would be reviewed by home secretary Rajiv Gauba to take a call on whether any issue requires intervention for seeking cooperation of social media platforms in criminal investigations, the person said. The initiative comes at a time when rumours circulated through social media have led to lynching of several innocent people in the country. Last week, five people were lynched in Maharashtra’s Dhule district and two others in Tripura on suspicion — triggered by rumours spread mainly through WhatsApp — that they were child-lifters. Last month, Gauba had chaired meeting with representatives of social media platforms such as Google,",
"time_scraped": "2018-08-19 12:00:13.336340",
"article_id": "64868887",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64861384,imgsize-74263,width-400,resizemode-4/64861384.jpg",
"path": "full/277e1d82193e0d4fc221018e0db8042f5c808f65.jpg",
"checksum": "ca411062f9c76ea7f9c3db0be549d84b"
}
]
}