{
"source_article_link": "https://timesofindia.indiatimes.com/india/air-india-site-renames-taiwan-as-chinese-taipei/articleshow/64866267.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Air India site renames Taiwan as Chinese Taipei",
"date_published": "2018-07-05T12:46:03+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64866320,imgsize-22707,width-400,resizemode-4/64866320.jpg"
],
"article_body": "NEW DELHI: National carrier has changed the name of Taiwan to Chinese Taipei on its website, following instructions from the government, an airline spokesperson said. China had raised concerns about Taiwan being described as a separate region by various airlines worldwide.   The spokesperson said Air India followed the procedure as advised by the Ministry of External Affairs in updating the airline's website with respect to changing name of Taiwan.   Air India operates flights to two destinations in China region- Shanghai and Hong Kong.  While Air India does not have flights to Chinese Taipei, it has a code share with Air China. This is the reason that this destination is listed on Air India website. Now, Air India describes Taiwan as 'Taipei, Taoyuan International Airport, TPE, Chinese Taipei' on its website. Code sharing allows an airline to book its passengers on its partner carriers and provide seamless travel to destinations where it has no presence. In April, the Civil Aviation Authority of China had sent out letters to various foreign airlines asking them to change the way Taiwan was referred to in their websites, as per media reports. Chinese tabloid Global Times carried an opinion piece titled 'Indian scholars wrong in equating territory row with Taiwan status' on July 3. \"That Air India lists Taiwan as a country goes against India's official stance. \"Recognizing that there is only one China in the world, that the government of the People's Republic of China is the only legitimate government representing all of China, and that Taiwan is an inalienable part of Chinese territory is the condition on which China establishes diplomatic ties with all countries,\" the article had said.",
"description": "A spokesperson said  the airline followed the procedure as advised by MEA in updating the website with respect to changing name of Taiwan China had raised concerns about Taiwan being described as a separate region by various airlines worldwide",
"time_scraped": "2018-08-16 18:00:20.620765",
"article_id": "64866267",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64866320,imgsize-22707,width-400,resizemode-4/64866320.jpg",
"path": "full/4df23e9a61af46f756744bdbc2dc92b4c9dbe5dc.jpg",
"checksum": "ce9030abf7e90185d2cd3663b355fe50"
}
]
}