{
"source_article_link": "https://timesofindia.indiatimes.com/india/narayana-health-inspires-the-west/articleshow/64888480.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Narayana health inspires the West",
"date_published": "2018-07-06T20:54:31+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: Often developing or emerging economies learn from the West for advances in medical technology and creation of sustainable healthcare . However, it is now time for the developed world to drive some lessons from low cost and high quality healthcare business models from India, which has become exemplary for the global setting. Recognizing how Indian hospitals like Narayana Health have made healthcare affordable while also effectively managing commercial interest of business and profitability, two leading American professors Vijay Govindarajan and Ravi Ramamurti are set to launch their new book : ‘Reverse Innovation in Health Care: How to Make Value-Based Delivery Work’ ( Press). The book – to be launched on 10th July 2018 – highlights some of their learning from successful business models in India in the quest for high-quality, low-cost care for all. The book also unravels issues that the global healthcare industry is grappling with. Welcoming the international acknowledgement and appreciation, Narayana Health founder Dr said, “The future is not going to be what it has been like. The Indian healthcare scenario is soon going to be hit by a Tsunami where all of a sudden there will be a huge demand for treatment and care. We have to look at it as a great opportunity and try to cease it because while people in India now have the means to pay for treatment, there is no infrastructure and that is where the investment have to be.” Among other issues, the book discusses how countries such as India are transforming healthcare with unique business models that blend the social and commercial. “India has been inspiring the world with many innovative initiatives in the recent past including affordable healthcare. Bangalore headquartered hospital chain Narayana Health is a great example in offering affordable solution, with results that were impressive to Western observers. In doing so, Dr Devi Shetty fulfilled his high-minded purpose and also built a very profitable company. From the beginning, even the most expensive surgical at Narayana hospitals were priced 20%-40% less than the same offerings at any other private Indian hospitals. He did not do this by cutting cost but by being an innovator; he simply did it by stepping over traditional boundaries and painting outside the lines,” says Govindarajan. Govindarajan is Coxe Distinguished Professor at Tuck School, Dartmouth College and a former Marvin Bower Fellow at , while Ramamurti is University Distinguished Professor of International Business and Director, Center for Emerging Markets at . The book reveals four pathways being used by health-care organizations in the United States to apply Indian-style principles to attack the exorbitant costs, uneven quality, and incomplete access to health care. With rich stories and detailed accounts of medical professionals who are putting these ideas into practice, this book shows how value-based delivery can be made to work in the United States. It elaborates \"bottom-up\" change doesn't require a grand plan out of Washington, DC, agreement between entrenched political parties, or coordination among all players in the health-care system. It needs entrepreneurs with innovative ideas about delivering value to patients. Reverse innovation has worked in other industries. We need it now in health care, it says.",
"description": "NEW DELHI: Often developing or emerging economies learn from the West for advances in medical technology and creation of sustainable healthcare . However, it is now time for the developed world to drive some lessons from low cost and high quality healthcare business models from India, which has become exemplary for the global setting. Recognizing how Indian hospitals like Narayana Health have made healthcare affordable while also effectively managing commercial interest of business and profitability, two leading American professors Vijay Govindarajan and Ravi Ramamurti are set to launch their new book : ‘Reverse Innovation in Health Care: How to Make Value-Based Delivery Work’ ( Press). The book – to be launched on 10th July 2018 – highlights some of their learning from successful business models in India in the quest for high-quality, low-cost care for all. The book also unravels issues that the global healthcare industry is grappling with.",
"time_scraped": "2018-08-20 12:00:31.490902",
"article_id": "64888480",
"article_category": "IndiaNews",
"image_details": []
}