{
"source_article_link": "https://timesofindia.indiatimes.com/india/kt-rama-rao-plays-saviour-to-death-metal-band-godless-to-perform-in-germany/articleshow/64887626.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "KT Rama Rao plays saviour to death metal band Godless to perform in Germany",
"date_published": "2018-07-06T19:47:04+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64887739,imgsize-355243,width-400,resizemode-4/64887739.jpg"
],
"article_body": "HYDERABAD:'s IT minister, a film bluff, has come forward to play savior to a death metal band '' from Hyderabad to help them fly toto participate in a prestigious world event.The 'Godless' need Rs 4 lakh to meet expenditure to travel to perform at, Germany to represent India at the world's biggest metal festival from August 2-4. As a last resort, the 'Godless' could only pin their hopes on KT Rama Rao. The response from the minister was heartwarming for the band.\"Guys, will not be able to help you from Govt but will try and find a private sponsor for you to get to Germany,\" KT Rama Rao, who is known to respond quickly to requests on Twitter informed the band members when they approached him on the micro-blogging site.\"Proud to be the first band from Hyderabad, Telangana to ever represent India at the world's biggest metal festival - Wacken Open Air, Germany. We need the support of the government to get us there,\" the band said in a request to KTR asking for an audience with him. They directly got an assurance from the minister that he would help them get sponsors but not from the government.The 'Godless' describe themselves as a five-piece thrash/death metal band. The band with Ravi-guitars, Kaushal - vocals, Abbas- Bass, Aniketh- drums was formed a 2015.",
"description": "HYDERABAD:'s IT minister, a film bluff, has come forward to play savior to a death metal band '' from Hyderabad to help them fly toto participate in a prestigious world event.",
"time_scraped": "2018-08-16 01:34:25.481588",
"article_id": "64887626",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64887739,imgsize-355243,width-400,resizemode-4/64887739.jpg",
"path": "full/833154034cbfd24de0f3b45c5809b637f0acf99b.jpg",
"checksum": "945786acbea64567ef717ff2c762f180"
}
]
}