{
"source_article_link": "https://timesofindia.indiatimes.com/india/ak-56-seized-from-dawood-gang-members-house-wife-arrested/articleshow/64897692.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "AK-56 seized from Dawood gang member's house, wife arrested",
"date_published": "2018-07-07T17:50:26+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64897694,imgsize-102799,width-400,resizemode-4/64897694.jpg"
],
"article_body": "MUMBAI: An AK-56 rifle has been seized from the house of a member of gang in suburban Goregaon here, police said on Saturday. \" (35), wife of Dawood Ibrahim gang member Naim Khan, was arrested following the raid on the couple's house yesterday,\" a senior official of Thane Police said. Apart from an AK-56 assault rifle, three magazines, a 9 mm pistol and 13 live cartridges were seized from Khan's house by the Anti Extortion Cell (AEC) of Thane Police, he said.   The raid followed interrogation of two alleged drug peddlers, Jahid Zali Shoukat Kashmiri (47) and (47), arrested by the Thane AEC from Nagpada in central Mumbai two days ago. The assault rifle was lying at Khan's house for a long time, the official claimed. Naim Khan was arrested by the Mumbai Crime Branch under the Maharashtra Control of Organised Crime Act (MCOCA) in 2016. He and some others had allegedly planned to kill Iqbal Attarwala, a former gang member, on the instructions of fugitive gangster , the official said. They were arrested before the plan could be executed. Naim Khan is currently lodged in Thane prison, awaiting trial. AEC sleuths are questioning Yasmin Khan as to why the weapons and ammunition were stored at the house, the official said. She was today produced before a court in Thane which remanded her in police custody till July 11, he added.",
"description": "MUMBAI: An AK-56 rifle has been seized from the house of a member of gang in suburban Goregaon here, police said on Saturday. \" (35), wife of Dawood Ibrahim gang member Naim Khan, was arrested following the raid on the couple's house yesterday,\" a senior official of Thane Police said. Apart from an AK-56 assault rifle, three magazines, a 9 mm pistol and 13 live cartridges were seized from Khan's house by the Anti Extortion Cell (AEC) of Thane Police, he said.",
"time_scraped": "2018-08-21 06:00:38.817520",
"article_id": "64897692",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64897694,imgsize-102799,width-400,resizemode-4/64897694.jpg",
"path": "full/a43ce9d064cdd4e0c300562d98b7775822951e96.jpg",
"checksum": "3c3dc07f4ee3d1900003564e87fc50f6"
}
]
}