{
"source_article_link": "https://timesofindia.indiatimes.com/india/jk-police-files-chargesheet-against-4-let-terrorists-for-killing-3-youths/articleshow/64898297.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "J&K: Police files chargesheet against 4 LeT terrorists for killing 3 youths",
"date_published": "2018-07-07T19:01:57+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64898364,imgsize-167610,width-400,resizemode-4/64898364.jpg"
],
"article_body": "SRINAGAR: Police on Saturday filed a chargesheet against four (LeT) terrorists in connection with the killing of three youth in Baramulla district of Jammu and Kashmir in April this year. \"The chargesheet was filed in the Court of Principal District and Sessions Judge Baramulla against four Lashkar-e-Taiba terrorists,\" a police spokesman said here. Three youth - identified as Irfan Ahmad Sheikh alias Asif Sheikh, alias Afsar Khan and Haseeb Nabi Khan - all residents of Baramulla district of north Kashmir were killed during evening hours of April 30 this year. Police said LeT was behind their killing. Among the four charge-sheeted in the case, two terrorists have been arrested while two others are still at large, the spokesman said. \"Four accomplices who abetted in the commission of terror crime have also been arrested and charge-sheeted in the case,\" he said. Those charged include three LeT terrorists namely , and . While Gojri and Najar were arrested, Akhoon is still at large, the spokesman said. The spokesman said that weapons including two AK series rifles and a pistol, used in the commission of crime, have also been produced before the court. \"The copy of opinion from Forensic Science Laboratory confirming that bullets recovered on scene of crime have been fired by the same weapons has also been appended in the charge-sheet along with the other oral and scientific evidence including the vehicle used in the crime,\" he said. \"The Special Investigation team of Baramulla police has investigated the case, making all out efforts to gather evidence against the culprits involved in the crime,\" the spokesman said.",
"description": "SRINAGAR: Police on Saturday filed a chargesheet against four (LeT) terrorists in connection with the killing of three youth in Baramulla district of Jammu and Kashmir in April this year. \"The chargesheet was filed in the Court of Principal District and Sessions Judge Baramulla against four Lashkar-e-Taiba terrorists,\" a police spokesman said here. Three youth - identified as Irfan Ahmad Sheikh alias Asif Sheikh, alias Afsar Khan and Haseeb Nabi Khan - all residents of Baramulla district of north Kashmir were killed during evening hours of April 30 this year. Police said LeT was behind their killing.",
"time_scraped": "2018-08-19 00:43:44.664878",
"article_id": "64898297",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64898364,imgsize-167610,width-400,resizemode-4/64898364.jpg",
"path": "full/8df27d6888f12aa99303c3a3b508257eec96c9f3.jpg",
"checksum": "fe23976503e05cc8a69c0a27bc5269c8"
}
]
}