{
"source_article_link": "https://timesofindia.indiatimes.com/india/manned-mission-isros-dream-still-a-long-way-away/articleshow/64897407.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Manned mission, Isro’s dream, still a long way away",
"date_published": "2018-07-07T17:55:03+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64897546,imgsize-563083,width-400,resizemode-4/64897546.jpg"
],
"article_body": "BENGALURU: India’s proposedprogramme (HSP), something that has been on the table since 2004, is still a long way away despite advancements in some critical technologies in the past decade.The(), whose chairmanon Saturday said the mission was the agency’s dream, will submit a revised report on the preparations of the project in a few weeks. However, this report will be purely an internal document, with no other potential stakeholder involved.Answering a specific question on HSP on the sidelines of the LM Katre Memorial Lecture, Sivan said: “It is our imagination, our dream that it should happen. But right now we are only in the preparation stage where we are demonstrating critical technologies, there’s a lot to do.”Stating that Isro always anticipates and develops technologies for the future even before a project is on the cards, he said that the HSP is one such programme. Conceding that there is still a long way to go, Sivan said Isro was yet to even decide which rocket — GSLV MK-II or GSLV MK-III — it will use if the HSP gets the green signal from the government.“We are working on several combinations,” he said, and claimed that(PAT) of the crew escape system was a major success. He spoke of crucial technologies tested during the mission, including a new solid motor that will prove useful during other future missions.“We tested six new technologies in one mission. It was a very complex technology and very satisfying to see it succeed. While the pad abort test was done at the launch pad, we still need to do the same in on-flight condition,” he said, while pointing out that so far as the HSP goes, they were still at the documentation stage.Also, the said document is only a refined version of what Isro had submitted more than a decade ago. “We are making a few changes ... it is purely an internal document and there’s no other agency involved at this moment,” he said.Sivan, during the lecture spoke of several futuristic technologies space scientists across the world are discussing and said that Isro too is looking at working on several technologies including a light craft that can reach Mars in three days instead of two years.Speaking about Chandrayaan II — India’s second mission to Moon — Sivan said the agency won’t indulge in extraction of any mineral (Helium), but that the mission could pave way for future technology in that direction.",
"description": "Isro chairman K Sivan said the manned mission is the agency’s dreamConceding that there is still a long way to go, Sivan said Isro was yet to even decide which rocket it will use if the human spaceflight programme gets the green signal",
"time_scraped": "2018-08-16 01:32:59.166134",
"article_id": "64897407",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64897546,imgsize-563083,width-400,resizemode-4/64897546.jpg",
"path": "full/aa6e53e4abfc4a315833db96db21d49720958a03.jpg",
"checksum": "20c94766d97fd2dba4baca458ef8a0e8"
}
]
}