{
"source_article_link": "https://timesofindia.indiatimes.com/india/south-korean-president-moon-jae-in-visits-akshardham-temple-praises-its-architecture/articleshow/64909209.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "South Korean President Moon Jae-in visits Akshardham temple, praises its architecture",
"date_published": "2018-07-08T22:13:15+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64909232,imgsize-420512,width-400,resizemode-4/64909232.jpg"
],
"article_body": "NEW DELHI: South Korean President on Sunday kicked-off his India tour with a visit to the Akshardham temple here and said the two countries may have different cultures but share common values such as peace, harmony and unity in diversity. The president, accompanied by his wife Kim Jung-sook, arrived at the sprawling temple premises Sunday evening from the Delhi airport and spent an hour there, admiring its iconic architecture and listening to the stories behind it design. The two visiting dignitaries entered the temple premises through its beautiful Bharat Upwan, and were welcomed with garlands, a 'tika' and 'kalawa' (holy thread) on the wrist in front of the Mayur Swagat Dwar by Sadhu Gnanmunidas, Swami of the temple. \"I am very delighted to visit this grand temple as part of the first leg of my visit. After, seeing this, the feeling that I get is that India and Korea may be having different cultures, but the two countries share commonalities in values such as peace, harmony and unity in diversity,\" Moon said. The Korean president, after arriving at the Akshardham Temple, billed as the 'World's Largest Comprehensive Hindu Temple', posed for pictures and then went to the main temple where he paid floral tribute at the sanctum sanctorum and performed its 'parikrama' (circumambulation). \"The president admired the architecture, and he looked at the detailed carvings on its domed ceilings, pillars and the Gajendra Pithika ('elephant plinth') and exclaimed that the work seems 'beyond human capacity'. He really appreciated the craftsmanship that went into its making,\" Sadhu Gnanmunidas told PTI. He received the president at the temple and also gave him a tour of the temple complex that was built in 2005, and is one of the most-visited cultural sites in the country. Moon is on a four-day visit to India, during which he will hold talks with Prime Minister on several issues, including the situation on the Korean peninsula and ways to boost bilateral trade and defence cooperation. At the airport here, he was received by Minister of External Affairs V K Singh. Moon and his wife also went around the main temple on golf carts and later performed 'abhishek' by offering holy water. The South Korean leader admired the 'Gajendra Pithika' that includes 148 life-sized carved stone elephants.",
"description": "NEW DELHI: South Korean President on Sunday kicked-off his India tour with a visit to the Akshardham temple here and said the two countries may have different cultures but share common values such as peace, harmony and unity in diversity. The president, accompanied by his wife Kim Jung-sook, arrived at the sprawling temple premises Sunday evening from the Delhi airport and spent an hour there, admiring its iconic architecture and listening to the stories behind it design. The two visiting dignitaries entered the temple premises through its beautiful Bharat Upwan, and were welcomed with garlands, a 'tika' and 'kalawa' (holy thread) on the wrist in front of the Mayur Swagat Dwar by Sadhu Gnanmunidas, Swami of the temple. \"I am very delighted to visit this grand temple as part of the first leg of my visit. After, seeing this, the feeling that I get is that India and Korea may be having different cultures, but the two countries share commonalities in values such as peace, harmony and unity in diversity,\" Moon said.",
"time_scraped": "2018-08-20 09:00:36.975534",
"article_id": "64909209",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64909232,imgsize-420512,width-400,resizemode-4/64909232.jpg",
"path": "full/09a5d37cb4a8bfbfecb0ee942ca55a3bc81fc8a4.jpg",
"checksum": "7f5291075ec9cbfda58e474b8c399740"
}
]
}