{
"source_article_link": "https://timesofindia.indiatimes.com/india/telangana-cm-expresses-support-for-simultaneous-polls/articleshow/64907468.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Telangana CM expresses support for simultaneous polls",
"date_published": "2018-07-08T18:48:51+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64907578,imgsize-38502,width-400,resizemode-4/64907578.jpg"
],
"article_body": "HYDERABAD: chief minister and TRS leader has expressed his support for to the Lok Sabha and state legislature in the country. \"Many are of the belief that simultaneous polls to state Assemblies and Parliament is BJP agenda or (Prime Minister) Modi's agenda. But, the Law Commission has initiated the process long back,\" TRS MP from Karimnagar B Vinod Kumar told media in New Delhi, after submitting Rao's letter (in support of the proposal) to the Law Commission chairman today. \"Elected Prime Ministers have been spending their considerable time in campaigning for assembly elections every year,\" the TRS MP said pointing out as is evident from the fact that elections were held in different states in 2015, 2016, 2017 and 2018 after the elections to Lok Sabha and some states in 2014. \" party and KCR (as Rao is popularly known as) are of the opinion that polls at once would help development of states and the country. Our views (have been) told to the Chairman (before Law Commission Chairman) clearly today,\" Vinod said. Seeking to give shape to the central government's concept of \"one nation, one election\", the Law Commission's internal 'working paper' has recommended holding the Lok Sabha and Assembly polls simultaneously but in two phases beginning 2019.",
"description": "HYDERABAD: chief minister and TRS leader has expressed his support for to the Lok Sabha and state legislature in the country. \"Many are of the belief that simultaneous polls to state Assemblies and Parliament is BJP agenda or (Prime Minister) Modi's agenda. But, the Law Commission has initiated the process long back,\" TRS MP from Karimnagar B Vinod Kumar told media in New Delhi, after submitting Rao's letter (in support of the proposal) to the Law Commission chairman today.",
"time_scraped": "2018-08-17 09:00:20.382407",
"article_id": "64907468",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64907578,imgsize-38502,width-400,resizemode-4/64907578.jpg",
"path": "full/bcf9fd0f8424aca96ece28475ec5249c3f74e1ec.jpg",
"checksum": "f46665febf01aa7ce343b0c0e57f7046"
}
]
}