{
"source_article_link": "https://timesofindia.indiatimes.com/india/taxis-cabs-to-come-without-child-lock-from-next-year/articleshow/64911236.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Taxis, cabs to come without child lock from next year",
"date_published": "2018-07-09T04:52:49+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64911237,imgsize-189263,width-400,resizemode-4/64911237.jpg"
],
"article_body": "NEW DELHI: Child locks in cabs and taxis, which have been misused by drivers to confine women passengers and misbehave with them, will be a thing of the past from July next year. The will develop a new latch without the child lock function and it will be made available in the next one year, according to the minutes of a meeting of the government’s highest automobile standard making panel, CMVR-TSC. These latches can be installed at the dealers’ end. Sources said this would be the norm since car manufacturers could not predict which vehicle would be used for commercial purpose. “This feature will be available only in taxis and cabs. While all new vehicles will get them, there will be a provision for replacing the existing child lock in already registered vehicles. The regional transport officer (RTO) concerned, which registers vehicles, will be responsible to see that such vehicles don’t have child lock,” said an automobile expert who attended the meeting. He admitted that though there was concern about child safety in cabs once the existing locking system is done away with, the decision was taken with the assumption that a child would be accompanied by an adult while travelling in a cab. “It will not cover private vehicles at all,” he added. Sources since every commercial vehicle needed to renew its fitness certificate annually, the RTOs could easily deny permission if existing taxis didn’t take out the child lock and fixed the new latch. The demand for doing away with has gained momentum after recent incidents of women being harassed, including in Bengaluru, Mumbai and Delhi. Once a child lock is on, doors can be opened only from the outside. Though the ‘new taxi policy guidelines’ of 2017 specifies that every taxi must have GPS panic devices and the child lock must be disabled, there have been instances of cab drivers not following the norm. Secondly, some cab operators have started pasting stickers in cabs to remind passengers to ensure disabling of locks before the trip starts. But doing away with child lock is being seen as the remedy to the problem.",
"description": "NEW DELHI: Child locks in cabs and taxis, which have been misused by drivers to confine women passengers and misbehave with them, will be a thing of the past from July next year. The will develop a new latch without the child lock function and it will be made available in the next one year, according to the minutes of a meeting of the government’s highest automobile standard making panel, CMVR-TSC. These latches can be installed at the dealers’ end. Sources said this would be the norm since car manufacturers could not predict which vehicle would be used for commercial purpose. “This feature will be available only in taxis and cabs. While all new vehicles will get them, there will be a provision for replacing the existing child lock in already registered vehicles. The regional transport officer (RTO) concerned, which registers vehicles, will be responsible to see that such vehicles don’t have child lock,” said an automobile expert who attended the meeting. He admitted that though there was concern about child safety in cabs once the existing locking system is done away with, the decision was taken with the assumption that a child would be accompanied by an adult while travelling in a cab. “It will not cover private vehicles at all,” he added.",
"time_scraped": "2018-08-18 06:01:32.074597",
"article_id": "64911236",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64911237,imgsize-189263,width-400,resizemode-4/64911237.jpg",
"path": "full/97ce9d563dfb9778fc2b9d8ce5956e846227dc34.jpg",
"checksum": "5d2cd43066a0c757d427153281278b77"
}
]
}