{
"source_article_link": "https://timesofindia.indiatimes.com/india/godrej-refuses-to-cede-prime-land-for-bullet-train-project/articleshow/64925255.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Godrej refuses to cede prime land for bullet train project",
"date_published": "2018-07-10T07:29:41+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "MUMBAI: The , Mumbai’s biggest private land owner, has petitioned the to shift the alignment of the Mumbai-Ahmedabad by a few hundred metres to the east. The company is in court against the state’s move to acquire ten acres of its prime Vikhroli land. The company is opposing a notice issued earlier this year for acquisition of land to the west of the Eastern Express Highway. The cost of the land, say experts, could be Rs 200 crore, and its development potential worth much more. Godrej suggested a re-alignment of the route and is offering alternative land. The company is said to have now offered land on the eastern side of the highway, whose viability is yet to be ascertained. Whether this site has mangroves and falls under coastal regulation zone (CRZ) will be considered. If realigned, the land currently being eyed by the government will be open for development by Godrej. It is learned that National High Speed Rail Corporation Limited, a joint venture of the government and participating state governments for implementing the bullet train project, will first assess the feasibility of the alternative plot and verify if it falls in CRZ area or has any other impediments. Adi Godrej, when contacted by TOI, expressed his “inability” to speak on the matter.",
"description": "MUMBAI: The , Mumbai’s biggest private land owner, has petitioned the to shift the alignment of the Mumbai-Ahmedabad by a few hundred metres to the east. The company is in court against the state’s move to acquire ten acres of its prime Vikhroli land. The company is opposing a notice issued earlier this year for acquisition of land to the west of the Eastern Express Highway. The cost of the land, say experts, could be Rs 200 crore, and its development potential worth much more.",
"time_scraped": "2018-08-19 00:44:31.475531",
"article_id": "64925255",
"article_category": "IndiaNews",
"image_details": []
}