{
"source_article_link": "https://timesofindia.indiatimes.com/india/direct-flights-between-india-and-philippines-soon/articleshow/64939108.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Direct flights between India and Philippines soon",
"date_published": "2018-07-11T09:09:11+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64939107,imgsize-235156,width-400,resizemode-4/64939107.jpg"
],
"article_body": "NEW DELHI: The pristine islands of Philippines will soon be a direct flight away from India. The flying rights between the two countries, which currently allow seven flights a week airlines of each side, are going to be enhanced. At present no airline has a direct flight between India and Philippines but with enhanced bilaterals, that is going to change.\"have shown interest in starting flights to India. A team is going there this week to see the bilaterals required to have good connectivity between our two countries and then we may enhance it to that level,\" said a senior aviation ministry official.The's flag carrier Philippines Airlines (PA) is learnt to be planning to start direct flights from Delhi and Mumbai to Manila this year. And to do so, it needs the current limit of seven flights a week to be hiked.Indian tour majors say travel from the country to Philippines has been increasing in recent times. \"Philippines has also relaxed visa requirements for Indian nationals. Those who have a valid US, Canada, UK, Schengen, Australian and Singapore visa can enter the destination without a visa and stay for 14 days free of charge. Others, will have to secure a single entry visa from India, valid for 14 days. There are no direct flights between India and the Philippines. Indian travelers usually go by Singapore Airlines, Thai, Air Asia, and Silk Air among others. They use Manila as the main getaway and travel to Cebu, Palawan Islands and Coron Islands,\" said a senior official of a travel major.Karan Anand of Cox & Kings said: \"Philippines is emerging as a must visit destination for Indian families who have already visited other South East Asian countries. Lately, we have also seen a number of Corporate Incentive groups travelling to various islands such as Cebu, Palawan, using Manila as a gateway.\"According to Philippines Tourism, over 1 lakh Indians visited Philippines in 2017. There has been 18% growth in the first three months of this year and they expect to maintain this growth for the entire year, the official added. \"India is the 12th largest source market for Philippines. Beaches such as Cebu are the top draw for Indian tourists and there is also demand for soft adventure. The main target segments are families and MICE (meetings, incentives, conferencing, exhibitions) travel as conference organizers are looking for a more varied options after visiting the usual destinations such as Thailand and Malaysia,\" he added.Philippines has a strong aviation connect with India. A JV of Indian infra major GMR Group, which operates airports in Delhi and Hyderabad, recently opened a terminal at Mactan Cebu International Airport.",
"description": "NEW DELHI: The pristine islands of Philippines will soon be a direct flight away from India. The flying rights between the two countries, which currently allow seven flights a week airlines of each side, are going to be enhanced. At present no airline has a direct flight between India and Philippines but with enhanced bilaterals, that is going to change.\"have shown interest in starting flights to India. A team is going there this week to see the bilaterals required to have good connectivity between our two countries and then we may enhance it to that level,\" said a senior aviation ministry official.The's flag carrier Philippines Airlines (PA) is learnt to be planning to start direct flights from Delhi and Mumbai to Manila this year. And to do so, it needs the current limit of seven flights a week to be hiked.",
"time_scraped": "2018-08-16 06:03:00.512311",
"article_id": "64939108",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64939107,imgsize-235156,width-400,resizemode-4/64939107.jpg",
"path": "full/60398d8f2595e9dc6044a410be2506c7e815ee2e.jpg",
"checksum": "df8d2e49d6cd252ad7801b7f910ba65c"
}
]
}