{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-south-korea-sign-11-agreements/articleshow/64932386.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India, South Korea sign 11 agreements",
"date_published": "2018-07-10T16:36:39+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64932351,imgsize-107329,width-400,resizemode-4/64932351.jpg"
],
"article_body": "NEW DELHI: India and signed 11 agreements, including in the areas of trade, cultural and scientific and technological cooperation, during the visit of South Korean President to India. The two sides signed a joint statement on Early Harvest Package of the upgraded Comprehensive Economic Partnership Agreement (CEPA), the external affairs ministry said on Tuesday. The Early Harvest facilitates ongoing negotiations on upgrading the India-South Korea CEPA, that came into operation in 2010, by identifying key areas for trade liberalisation. A memorandum of understanding (MoU) was signed that is aimed at anti-dumping, subsidy, countervailing and safeguard measures through consultations and exchange of information through the establishment of a cooperation committee comprising government officials and domain experts. Another MoU was signed for the formation of a Future Strategy Group for cooperation in development of cutting edge technologies for commercialization to reap benefits of the 4th Industrial revolution. Thrust areas include Internet of Things (IOT), (AI), Big Data, Smart Factory, 3D printing, electric vehicles, advance materials and affordable healthcare for the elderly and disabled. A cultural exchange programme for the period 2018-2022 was signed to deepen cultural and people-to-people relations by providing for institutionalised cooperation in fields of music and dance, theatre, art exhibitions, archives, anthropology, mass media programmes and museum exhibits. A MoU was signed on similar lines to facilitate upgrade and expansion of the existing monument in commemorating Princess Suriratna (Queen Hur Hwang-ok), a legendary princess of Ayodhya, who went to Korea in 48 A.D and married King Kim-Suro. A large number of Koreans trace their ancestry to this legendary princess and the new monument will be a tribute to the shared cultural heritage between the two countries. Other MoUs signed include cooperation in the areas of scientific and technological research, railway research, biotechnology and bio-economics, ICT and telecommunications, and micro, small and medium enterprises.",
"description": "The two sides signed a joint statement on Early Harvest Package of the upgraded Comprehensive Economic Partnership Agreement  Another MoU was signed for the formation of a Future Strategy Group for cooperation in development of cutting edge technologies A cultural exchange programme for the period 2018-2022 was signed to deepen cultural and people-to-people relations",
"time_scraped": "2018-08-16 09:00:30.790266",
"article_id": "64932386",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64932351,imgsize-107329,width-400,resizemode-4/64932351.jpg",
"path": "full/e2652243a83c9f98f1af203fafc68d654010ee98.jpg",
"checksum": "6cd471894ac0b95d281c31fe2e981d59"
}
]
}