{
"source_article_link": "https://timesofindia.indiatimes.com/india/sc-refuses-to-pass-interim-order-on-plea-on-reservation-to-sc/st-in-govt-jobs/articleshow/64943980.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "SC refuses to pass interim order on plea on reservation to SC/ST in govt jobs",
"date_published": "2018-07-11T12:59:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64943981,imgsize-33521,width-400,resizemode-4/64943981.jpg"
],
"article_body": "NEW DELHI: The today refused to pass an interim order against its 2006 verdict which dealt with the application of the 'creamy layer' for reservations to SC and ST categories in government job promotions. A bench of Chief and Justices A M Khanwilkar and said a seven-judge Constitution bench is needed to consider the 2006 verdict M Nagraj verdict. Attorney General K K Venugopal, appearing for the Centre, said the matter should be heard urgently by a seven-judge Constitution bench as lakhs of jobs in Railways and services are stuck due to confusion over various judicial pronouncements. The bench said one Constitution bench is already seized of various matters and the issue can only be taken up in the first week of August. On November 15 last year, the top court had said a five-judge Constitution bench will examine the limited issue of whether the 2006 verdict delivered in M Nagaraj and other versus Union of India was required to be re-looked at or not. The M Nagaraj verdict had said the creamy layer concept cannot be applied to the Scheduled Castes and Scheduled Tribes for promotions in government jobs like two earlier verdicts -- 1992 Indra Sawhney and others versus Union of India (popularly called Mandal Commission verdict) and 2005 E V Chinnaiah versus State of Andhra Pradesh -- which dealt with creamy layer in the Other Backward Classes category. However, on June 5, in a major relief to the Centre, the apex court allowed it to go ahead with reservations in promotion for employees belonging to the SC and ST category in \"accordance with law\". The top court took into account the Centre's submissions that the entire process of promotions had come to a \"standstill\" due to the orders passed by various high courts and the apex court had also ordered for \"status quo\" in a similar matter in 2015. A vacation bench of Justices Adarsh Kumar Goel and Ashok Bhushan said the Centre was not \"debarred\" from making promotions in accordance with law in the matter. The government had said there were separate verdicts by the high courts of Delhi, Bombay and Punjab and Haryana on the issue of reservation in promotion to SC/ST employees and the apex court had also passed different orders on appeals filed against those judgement.",
"description": "NEW DELHI: The today refused to pass an interim order against its 2006 verdict which dealt with the application of the 'creamy layer' for reservations to SC and ST categories in government job promotions. A bench of Chief and Justices A M Khanwilkar and said a seven-judge Constitution bench is needed to consider the 2006 verdict M Nagraj verdict.",
"time_scraped": "2018-08-16 15:00:17.851863",
"article_id": "64943980",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64943981,imgsize-33521,width-400,resizemode-4/64943981.jpg",
"path": "full/bf42d738e81d086b5bc80d9d0560db2cc7558f46.jpg",
"checksum": "23ae9f14532a26f91af5b25418c00a64"
}
]
}