{
"source_article_link": "https://timesofindia.indiatimes.com/india/mos-hrd-upendra-kushwaha-visits-marshall-islands-holds-talks-to-boost-ties/articleshow/64947590.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "MoS HRD Upendra Kushwaha visits Marshall Islands; holds talks to boost ties",
"date_published": "2018-07-11T17:07:51+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64947580,imgsize-111133,width-400,resizemode-4/64947580.jpg"
],
"article_body": "NEW DELHI: Minister of state for human resource development Kushwaha held wide-ranging talks with the foreign minister of , as the two sides vowed to boost cooperation in key sectors such as blue economy, climate change and renewable energy. Kushwaha, on a two-day visit to the Republic of Marshall Islands (RMI) from July 10-11, held discussions with foreign minister John M Silk and several Cabinet members of the country. \"Both sides reviewed bilateral relations and reaffirmed their commitment to further advance ties in a host of areas such as blue economy, adaptation-mitigation practices for climate change, disaster preparedness, health, education, renewable energy among others,\" a Ministry of External Affairs (MEA) statement said. During the visit, Kushwaha also called Marshall Islands President Hilda Heine. The RMI shared its interest in joining the International Solar Alliance (ISA) at the earliest, the statement said. The island nation also expressed strong support for India's permanent membership at a reformed United Nations Security Council (UNSC). During the visit, based on a request from the RMI side, India committed to extending a grant of USD 300,000 for a Water and Sanitation Project Proposal of Aur Atoll Local Government. Since 2005, India has extended grant assistance to the tune of USD 1.35 million for various projects relating to purchase of equipment, disaster relief, national export strategy, community and local government projects harnessing solar energy, among others. On behalf of the Indian government, Kushwaha extended an invitation to the RMI President to visit India. This was the first ministerial visit from India to , RMI. India was one of the first countries to establish diplomatic relations with the Republic of Marshall Islands in April 1995.",
"description": "NEW DELHI: Minister of state for human resource development Kushwaha held wide-ranging talks with the foreign minister of , as the two sides vowed to boost cooperation in key sectors such as blue economy, climate change and renewable energy. Kushwaha, on a two-day visit to the Republic of Marshall Islands (RMI) from July 10-11, held discussions with foreign minister John M Silk and several Cabinet members of the country.",
"time_scraped": "2018-08-19 15:00:26.997630",
"article_id": "64947590",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64947580,imgsize-111133,width-400,resizemode-4/64947580.jpg",
"path": "full/730d540d4e993e38b81d4987da23cf132adb740d.jpg",
"checksum": "ac29596fdeeb8ddb860ba88ee32f7f6f"
}
]
}