{
"source_article_link": "https://timesofindia.indiatimes.com/india/body-of-indian-student-killed-in-kansas-arrives-in-hyderabad/articleshow/64954662.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Body of Indian student killed in Kansas arrives in Hyderabad",
"date_published": "2018-07-12T07:05:57+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64954663,imgsize-18763,width-400,resizemode-4/64954663.jpg"
],
"article_body": "HYDERABAD: The body of , an Indian student who was killed during an attempted robbery in Kansas City in the US last week, arrived here on Wednesday night. The body arrived at the Rajiv Gandhi International airport and former Union Minister was among those who paid homage to the departed soul. According to authorities in Kansas, Koppu, 25, hailing from Telangana, was fatally shot during a suspected incident of robbery at a restaurant where he worked. He died shortly after being taken to a hospital on Friday. Kansas City police announced a $10,000 reward for information leading to the suspect and released a brief video of the suspect inside the restaurant moments before the shooting.",
"description": "HYDERABAD: The body of , an Indian student who was killed during an attempted robbery in Kansas City in the US last week, arrived here on Wednesday night. The body arrived at the Rajiv Gandhi International airport and former Union Minister was among those who paid homage to the departed soul. According to authorities in Kansas, Koppu, 25, hailing from Telangana, was fatally shot during a suspected incident of robbery at a restaurant where he worked. He died shortly after being taken to a hospital on Friday.",
"time_scraped": "2018-08-19 00:45:20.633960",
"article_id": "64954662",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64954663,imgsize-18763,width-400,resizemode-4/64954663.jpg",
"path": "full/198ac874924dd76af9eace8b02aeb1e3c98ce587.jpg",
"checksum": "0cb0cbb76500f740f4b423efbe64249b"
}
]
}