{
"source_article_link": "https://timesofindia.indiatimes.com/india/11-feared-killed-in-manipur-landslides-flooded-river/articleshow/64952399.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "11 feared killed in Manipur landslides, flooded river",
"date_published": "2018-07-11T23:21:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64952391,imgsize-226769,width-400,resizemode-4/64952391.jpg"
],
"article_body": "IMPHAL: At least 11 persons, including six children, were feared dead in landslides as well as a swollen river in , State Disaster Management Authority Vice Chairman Adim Panmei said on Wednesday. He said that at least seven persons, including three girls and two boys, were killed when three landslides hit a village in Tamenglong district on Wednesday morning. He said a disaster management team rushed to the district for rescue and relief work. Tamenglong district collector Ravindra Singh said efforts were on to locate two missing children. However, officials said the chances of finding them alive were slim. Police said that a young woman Chalimaya Khadka and her nine-year-old daughter Monica were swept away by the strong currents of the on Tuesday afternoon. Their bodies have not been recovered so far.",
"description": "IMPHAL: At least 11 persons, including six children, were feared dead in landslides as well as a swollen river in , State Disaster Management Authority Vice Chairman Adim Panmei said on Wednesday. He said that at least seven persons, including three girls and two boys, were killed when three landslides hit a village in Tamenglong district on Wednesday morning. He said a disaster management team rushed to the district for rescue and relief work. Tamenglong district collector Ravindra Singh said efforts were on to locate two missing children. However, officials said the chances of finding them alive were slim.",
"time_scraped": "2018-08-20 12:00:30.082171",
"article_id": "64952399",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64952391,imgsize-226769,width-400,resizemode-4/64952391.jpg",
"path": "full/333111fc8ba8cf2107900da40ec07eb0ead26ac4.jpg",
"checksum": "823be515faf086674eb327bb1b0cc692"
}
]
}