{
"source_article_link": "https://timesofindia.indiatimes.com/india/sc-says-delhi-under-mountains-of-garbage-slams-lg-for-inaction/articleshow/64961164.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "SC says Delhi under 'mountains of garbage', slams LG for inaction",
"date_published": "2018-07-12T16:17:02+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64961189,imgsize-308773,width-400,resizemode-4/64961189.jpg"
],
"article_body": "NEW DELHI: The on Thursday said \"mountains of garbage\" in Delhi indicate that the city is facing a grave situation and slammed the lieutenant governor (LG) for not taking appropriate action on the issue of solid waste management. Referring to the \"mountains of garbage\" at the three landfill sites — Ghazipur, Okhla and Bhalswa — the court said no action has been taken by authorities, including the office of the LG due to which Delhi was facing the serious problem. The office of LG and Delhi government told a bench comprising justices MB Lokur and Deepak Gupta that municipal corporations have the responsibility to deal with the issue of solid waste management. \"This is nothing but passing on the buck,\" an anguished bench said. The bench also termed as \"utopian\" the 'state policy on solid waste management strategy' which has been framed by the LG office and observed that perhaps it would be impossible to implement as the East Delhi Municipal Corporation and the North Delhi Municipal Corporation don't have funds to carry out their day-to-day affairs. Coming down hard on the LG, the court said that despite convening 25 meetings on the issue, Delhi was still under \"mountains of dumps\". The bench directed the office of the LG to file an affidavit by July 16 indicating the time frame on the steps it is supposed to take to deal with the situation. The Delhi government and the LG also informed the bench that the LG has the power to issue directions to authorities concerned under the provisions of Delhi Municipal Corporation Act on disposal of solid waste. The apex court had on the last date of hearing asked the Centre and the Delhi government to clarify who could be held responsible for clearing the \"mountain loads of garbage\" in the national capital — those reporting to LG Anil Baijal or to Chief Minister Arvind Kejriwal. The top court's direction came days after its verdict on the power tussle between the Lieutenant Governor and the Aam Aadmi Party government in which it held that the LG has no independent power to take decisions and is bound by the elected government's aid and advice. It had also slapped fines on 10 states and two union territories for not filing their affidavits on their policies for solid waste management strategy. On March 27, the top court had said that days are not far when garbage mounds at the Ghazipur landfill site in Delhi will match the height of the iconic 73-metre high Qutub Minar and red beacon lights will have to be used to ward off aircraft flying over it.",
"description": "Coming down hard on the LG, SC said that despite convening 25 meetings on the issue, Delhi was still under \"mountains of dumps\" SC bench directed the office of the LG to file an affidavit by July 16 indicating the time frame on the steps it is supposed to take to deal with the situation",
"time_scraped": "2018-08-19 00:44:47.198669",
"article_id": "64961164",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64961189,imgsize-308773,width-400,resizemode-4/64961189.jpg",
"path": "full/9d8da7441ed08b244922ac7f284eb262a76e9026.jpg",
"checksum": "eb5ab6da85df861dc53a14f5a41a913a"
}
]
}