{
"source_article_link": "https://timesofindia.indiatimes.com/india/first-batch-of-800-hajj-pilgrims-from-jammu-kashmir-leaves-for-madina/articleshow/64988460.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "First batch of 800 Haj pilgrims from Jammu & Kashmir leaves for Medina",
"date_published": "2018-07-14T17:52:26+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64988468,imgsize-141756,width-400,resizemode-4/64988468.jpg"
],
"article_body": "SRINAGAR: The first batch of 800 from today left for the Muslim holy city of Medina in . As many as 10,000 pilgrims from the state are scheduled to perform the pilgrimage this year. \"Governor was at the airport to see off the pilgrims of the first batch. Governor's advisor Khursheed Ganai and other senior officials were also present at the airport,\" an official of the state Committee said. While 340 pilgrims were on the first flight, the second and third flights carried 150 pilgrims each. The official said 10,183 pilgrims from Jammu and Kashmir have been selected this year to undertake the Haj pilgrimage, considered to be one of the five basic pillars of Islam. Pilgrims will be flown from here to Delhi in four daily flights with last flight scheduled to take off on 25 July, he said. The Haj pilgrimage culminates on Eidul Azha, which will fall on 22nd or 23rd of August depending on appearance of crescent. The first flight carrying the pilgrims back home from Saudi Arabia is scheduled to arrive here on August 25 while last return flight is on September 7.",
"description": "SRINAGAR: The first batch of 800 from today left for the Muslim holy city of Medina in . As many as 10,000 pilgrims from the state are scheduled to perform the pilgrimage this year.",
"time_scraped": "2018-08-20 09:00:42.883272",
"article_id": "64988460",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64988468,imgsize-141756,width-400,resizemode-4/64988468.jpg",
"path": "full/1a9ea56cf0010d49ebe54bbf14b64d1d04538c4c.jpg",
"checksum": "48bde3f46d8ba44f72760345250c038c"
}
]
}