{
"source_article_link": "https://timesofindia.indiatimes.com/india/is-congress-party-only-for-muslim-men:-pm-modi-attacks-rahul-gandhi/articleshow/64988148.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "'Is Congress party for Muslim men alone?': PM Modi attacks Rahul Gandhi",
"date_published": "2018-07-14T20:10:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64988259,imgsize-69510,width-400,resizemode-4/64988259.jpg"
],
"article_body": "NEW DELHI/AZAMGARH: Prime Minister on Saturday criticised the Congress over its stand on and asked \"if it was a party for Muslim men alone.\" Speaking at a rally in UP's , PM Modi launched a scathing attack on the opposition parties for stalling Parliament and blocking important legislations like the triple talaq.   Taking a dig at Rahul Gandhi, the PM said \"I have read in newspaper that Congress president has said that Congress is a party of Muslims, I am not surprised by this. All I want to ask is, is their party only for Muslim men or for women too?\" The Congress hit back at the Prime Minister and accused him of lying to the people of India. \"Prime Minister continues to lie to the people of India. His insecurities are getting the better of him. What are you scared of Modi ji?,\" the Congress alleged in a tweet.   PM Modi was speaking at a rally in Azamgarh after laying the foundation stone for the 340-km . \"The stand of these parties on triple talaq have exposed them. On one side the Centre is trying to make the lives of women easy, on the other side these people have grouped together to make the lives of women, especially Muslim women, difficult, the PM said. Prime minister's criticism of Congress comes just days ahead of the monsoon session of Parliament during which the NDA government is likely to push for the passage in the Rajya Sabha of a bill against instant triple talaq. The bill has already been passed in the Lower House, but remains pending in the Rajya Sabha amid opposition reservations over it. \"Is there any place for the dignity and the rights of Muslim women? They have stalled legislation in the Parliament and they do not allow Parliament to run,\" Modi said. Congress rejected PM Modi's charges and posted an old tweet which specified its stand on the triple talaq bill.   Slamming the opposition moves for unity, PM Modi said \"Those who didn't even like looking at each other earlier, are now chanting Modi Modi. These people, out on bail, & the dynast parties now want to create obstacles on your path to development.\" The Prime Minister is on a two-day tour of eastern . He will also inaugurate other development projects and address rallies in Varanasi and Mirzapur during the tour, his second visit to the politically crucial state.",
"description": "PM Modi is on a two-day tour of eastern Uttar Pradesh He was addressing a rally in Azamgarh after laying the foundation stone for the 340-km Purvanchal Expressway Modi is also scheduled to inaugurate other development projects and address rallies in Varanasi and Mirzapur",
"time_scraped": "2018-08-19 00:43:55.055427",
"article_id": "64988148",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64988259,imgsize-69510,width-400,resizemode-4/64988259.jpg",
"path": "full/c77d02d875107e6aee52fb8716ebe41b36d185ee.jpg",
"checksum": "706f1b04318d4007a1edef13a6b38c3b"
}
]
}