{
"source_article_link": "https://timesofindia.indiatimes.com/india/new-rule-allows-deportation-if-h-1b-extension-is-rejected/articleshow/64982365.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "New rule allows deportation if H-1B extension is rejected",
"date_published": "2018-07-14T13:47:14+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64982372,imgsize-298942,width-400,resizemode-4/64982372.jpg"
],
"article_body": "MUMBAI: Many holders could find themselves facing deportation proceedings if their application for a visa extension or change of status has been rejected and the tenure of stay granted originally by the US authorities (as reflected in Form 1-94) has expired. To make matters worse, despite no longer holding on to a job, they would have to stay on in the US for several months, waiting to be heard by an immigration judge. A policy memorandum, dated June 28, which came into the public domain last week, permits the US Citizenship and Immigration Services to issue “notices to appear” (NTA) in cases “whereupon denial of an application or petition, the applicant is ‘unlawfully present’ in the US”. Such a notice is the starting point for removal or deportation proceedings. According to an immigration counsel at an IT company, “It appears that all cases where an application for visa extension is denied, post expiry of the original tenure of stay that was granted, will be issued an NTA.”   Notices for were restricted to cases relating to fraud, criminal charges or denial of asylum or refugee status, but the ambit now stands widened. On being served notices to appear (NTA), the nightmare begins. “Once an NTA has been served, the individual must remain in the US and appear before an immigration judge. A failure to appear for removal proceedings carries a five-year ban on re-entry to the US,” says Snehal Batra, managing attorney, NPZ Law Group. Read also: Earlier, on being denied an extension, the employee concerned could immediately return to India without the NTA-related hassles. His employers could reapply for a fresh H-1B in the next season. “Even international students are not immune to deportation proceedings. Unauthorised employment, failure to enrol in classes or failure on part of the educational institute to update a student’s records could result in an unlawful status for students and issue of a NTA,” adds Batra.   Benjamin Johnson, executive director, American Immigration Lawyers Association, points out that the immigration court backlog, as of May 31, exceeded seven lakh cases. Typically, a majority of H-1B holders are not those on initial visas but on extended visas. Statistics show that during the 12-month period ended September 30, 2017, US authorities approved 3.65 lakh H-1B visa applications, of which only 1.08 lakh, or 29.5%, were for initial employment. Nearly two lakh Indians got visas for continued employment. “The revised policy could result in a horrendous situation. As the H-1B extension has been denied, the employee can’t work, but he has to linger on in the US for several months to appear before the immigration court,” says the corporate counsel. “Once removal proceedings have commenced, the individual concerned can leave only after an immigration judge grants voluntary departure,” says Cyrus D Mehta, managing partner of Cyrus D Mehta and Partners, an immigration law firm. “As the dockets of these judges are backlogged, it can take a few months to get a first hearing and then qualify for a voluntary departure,” he adds. In case of H-1B workers, the trigger for denial of visa extension, would typically result in an NTA being served. The two are intricately linked in more ways than one. Mehta explains: “After denial, the erstwhile H-1B worker starts accruing unlawful presence. If the grant of voluntary departure is issued more than one year from the date of denial, there will be a ten-year bar to re-entry.” The denial of extension of the visa by the USCIS can be appealed against, but this itself is time consuming. Assuming that, the denial is reversed, the immigration judge may drop the deportation hearing, or the individual can move court for termination of the deportation process. “A pending green card application, provides no protection against issuance of an NTA for a denied H-1B request. The only point at which an individual becomes safe from this consequence is when they are at the last step of the green card processing, referred to as ‘Adjustment of Status’. This step kicks in only as and when someone’s priority date becomes current, which for Indian born applicants can be decades,” says Rajiv S. Khanna, managing attorney at Immigration.com It remains to be seen how this will pan out. David Nachman, managing attorney at NPZ Law Group says, “This guidance policy memorandum may be more of a wish list by the administration. Or it could be attempt to send another chilling effect through the industry to establish a warning to H-1B holders that they need to be mindful that they do not fall out of status. It would also let the voters know that the Trump administration will not tolerate individuals who are not in proper H-1B status.”   An H-1B holder can continue to live and work in the US for up to 240 days while the application for extension of his visa is pending as long as the extension application was filed prior to expiry of the tenure in his original H-1B visa. As USCIS takes considerable time to process the extension applications, it’s likely that the period in the original H-1B visa has expired and the employee’s stay in the US is solely dependent on the 240-day work authorisation. If the application for extension is denied, the individual would be held as “unlawfully present” as on the date of denial and USCIS can issue an NTA and deportation proceedings would commence. Visa extension applications can no longer be taken lightly as the denial rate, on various grounds, is on the rise. Says Rajiv S Khanna, managing attorney at Immigration. com: “USCIS takes more than . In many cases it is inevitable that the previous H-1B status will expire while the application is still pending. Thus, applications should be filed at the earliest. For extension of H-1B visas, applications can be filed up to six months before the expiry of the existing visa tenure. Second premium processing must be opted for, which is more expensive but entails a shorter processing timeline.”",
"description": "Many H-1B holders could face deportation if their application for extension or change of status is rejected They may have to stay on in the US for several months, waiting to be heard by an immigration judge Notices for commencement of deportation proceedings were restricted to criminal cases but the ambit now stands widened",
"time_scraped": "2018-08-21 03:00:07.342786",
"article_id": "64982365",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64982372,imgsize-298942,width-400,resizemode-4/64982372.jpg",
"path": "full/e9744bdb1531445f097234b03a0cd4f933c284dc.jpg",
"checksum": "f604b1182b68c3300c0e9bf767aa60dc"
}
]
}