{
"source_article_link": "https://timesofindia.indiatimes.com/india/be-smart-like-mallya-union-minister-tells-tribals/articleshow/64982407.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Be smart like Mallya, Union minister tells tribals",
"date_published": "2018-07-14T11:11:50+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64982408,imgsize-552707,width-400,resizemode-4/64982408.jpg"
],
"article_body": "HYDERABAD: Encouraging tribals to not just be ‘hard workers’ but become ‘smart workers’, Union tribal affairs minister on Friday urged the tribal community to foster the spirit of entrepreneurship and even went on to cite the example of , who built a successful business empire before he ended up on the wrong side of the law. “You abuse Vijay Mallya. But who is Vijay Mallya? He is a smart guy. He employed some intelligent people and influenced bankers, politicians, government…. Who prevented you (from being smart)? Who asked Adivasis not to influence the system? Who prevented you from influencing bankers,” Oram said in a tongue-and-cheek manner, while delivering the keynote at the first National Tribal Entrepreneurs Conclave 2018 in Hyderabad. He pointed out that there are advantages as well as disadvantages of being a tribal. While there is reservation for tribals in educational institutions and government jobs, they can avail of these and grow in life. The disadvantage is that their merit is not recognised and even if they succeed in life, their success is attributed to reservations alone due to which they are not treated at par with others. As many tribals feel discriminated due to this, Oram added, many have stopped using their surnames. However, Oram later clarified that he should have taken someone else's name and it was his mistake.   “We should become entrepreneurs, we should become intelligent. We should become smart. We should gain information. Information is power. Those who possess information, control power,” he said. Over 1,000 tribal entrepreneurs attended the event. finance minister Eatala Rajender, who was also present, said bankers oftendiscriminate against tribals and they need to improve their overall lending activity. He also referred to Mallya, stating that banks do not blink an eye before lending thousands of crores to the likes of him but hesitate before lending even Rs 1 crore to a genuine tribal entrepreneur.",
"description": "Jual Oram urged the tribal community to foster the spirit of entrepreneurship and went on to cite the example of Mallya \"Mallya influenced bankers, politicians, government ... who asked  Adivasis not to influence the system?\" he said He pointed out that there are advantages as well as disadvantages of being a tribal",
"time_scraped": "2018-08-16 12:00:49.937834",
"article_id": "64982407",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64982408,imgsize-552707,width-400,resizemode-4/64982408.jpg",
"path": "full/71fbe459ac213dbb711ad6ff71782fa980c4fa84.jpg",
"checksum": "eb033526f53eec0c5df761ad0aa58c1d"
}
]
}