{
"source_article_link": "https://timesofindia.indiatimes.com/india/sushma-swaraj-arrives-in-bahrain-for-joint-commission-meet/articleshow/64991025.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Sushma Swaraj arrives in Bahrain for joint commission meet",
"date_published": "2018-07-14T21:26:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64991018,imgsize-94238,width-400,resizemode-4/64991018.jpg"
],
"article_body": "MANAMA: External Affairs Minister was on Saturday accorded a warm welcome as she arrived here on her two-day visit to . Swaraj, who is visiting Bahrain for the third time, will co-chair the second joint commission meeting with her Bahraini counterpart . The first meeting of the High Joint Commission (HJC) was held in New Delhi in February, 2015. \"A warm and personal welcome! In a special gesture reflecting our close ties, EAM Sushma Swaraj received at Manama airport by the Foreign Minister of Bahrain Shaikh Khalid bin Ahmed Al Khalifa,\" ministry of external affairs spokesperson Raveesh Kumar said in a tweet. \"This is EAM's 3rd visit to Bahrain in her capacity as External Affairs Minister,\" he tweeted. Swaraj also inaugurated the new Chancery-cum-Residential complex. \"A testimony of close cooperation between India and Bahrain! Joint inauguration of the impressive Embassy of India Complex in Manama by EAM Sushma Swaraj and Foreign Minister of Bahrain Shaikh Khalid bin Ahmad bin Khalifa,\" Kumar tweeted. Issues of trade, investment and counter-terror cooperation are likely to be discussed at the joint commission meeting. India is Bahrain's fifth largest trading partner. Terrorism and counter-terror cooperation are also key areas of strategic cooperation between the two countries. The Indian community of about 3,50,000-4,00,000 people forms nearly one-fourth of Bahrain's population.",
"description": "MANAMA: External Affairs Minister was on Saturday accorded a warm welcome as she arrived here on her two-day visit to . Swaraj, who is visiting Bahrain for the third time, will co-chair the second joint commission meeting with her Bahraini counterpart .",
"time_scraped": "2018-08-19 15:00:06.379052",
"article_id": "64991025",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64991018,imgsize-94238,width-400,resizemode-4/64991018.jpg",
"path": "full/ae938a9e87be3b900399d09ab6026fe24f3be1f2.jpg",
"checksum": "f24b20cfcaf2cf742711257c89160ae5"
}
]
}