{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-should-not-miss-digital-revolution-ravi-shankar-prasad/articleshow/64999404.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India should not miss digital revolution: Ravi Shankar Prasad",
"date_published": "2018-07-15T20:28:38+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-64999459,imgsize-19713,width-400,resizemode-4/64999459.jpg"
],
"article_body": "PANAJI: Union Information Technology Ministersaid today India should not miss thelike it did the Industrial and Entrepreneurial revolutions and should be a leader in it.Addressing the Goa IT Day event here, Prasad said fundamentals of a digital India were laid when Prime Ministerwas campaigning for the 2014 Lok Sabha polls.\"He is IT-savvy for the past 25 years. He said if I came to power, I would create an India where IT plus IT is equal to IT. It means India Startup plus Information Technology is equal to India Tomorrow,\" the minister said.\"We missed the, we missed the Entrepreneurial Revolution which happened in the 70s and 80s because of the licence permit quota raj. But we don't want to miss the digital revolution. We want to be a leader in that,\" he said.He said Digital India would ensure delivery of services, and digital inclusion of people would bridge the divide between haves and have-nots.\"We are linking 2.5 lakh gram panchayats in the country through optical fibre. One lakh gram panchayats have already been linked and the rest will be connected by the end of this year,\" he said.Prasad added that the government was creating IT villages by providing services like wi-fi.Corporates were also being roped in to spend funds as part of their Corporate Social Responsibility.The event was attended by Goa Chief Ministerand state IT Minister Rohan Khaunte.",
"description": "PANAJI: Union Information Technology Ministersaid today India should not miss thelike it did the Industrial and Entrepreneurial revolutions and should be a leader in it.Addressing the Goa IT Day event here, Prasad said fundamentals of a digital India were laid when Prime Ministerwas campaigning for the 2014 Lok Sabha polls.",
"time_scraped": "2018-08-16 05:27:09.341521",
"article_id": "64999404",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-64999459,imgsize-19713,width-400,resizemode-4/64999459.jpg",
"path": "full/81c0110d420cd15dc12522e5753a2d24f0d35f82.jpg",
"checksum": "f5efb083794f90ebed37fed401b69be4"
}
]
}