{
"source_article_link": "https://timesofindia.indiatimes.com/india/officer-cadre-restructuring-army-mulls-doing-away-with-brigadier-rank/articleshow/65016582.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Officer cadre restructuring: Army mulls doing away with Brigadier rank",
"date_published": "2018-07-17T09:53:27+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65016584,imgsize-105329,width-400,resizemode-4/65016584.jpg"
],
"article_body": "NEW DELHI: The Army, as part of its ongoing exercise to restructure its officer cadre after a long wait of 35 years, is mulling the radical step of doing away with the rank of Brigadier to ensure better career prospects and parity with the civil services as well as arrest its greying profile of commanders.As per the internal paper drafted for the cadre review in the over 12-lakh strong Army, which has a little over 42,000 officers at present, the force would like to cut down the number of its ranks from nine to six or seven. In effect, this would mean Colonels who are approved for promotions directly become Major-Generals instead of Brigadiers in-between.\"The civil services have just six designations or ranks. While armed forces have stuck to their old rank structures, the civil services and the IPS have proliferated their higher ranks with impunity to meet aspirations of their cadres. Relatively, this has led to systematic degradation of the ranks in armed forces as well as lower pay scales,\" said an officer.Army chief Generalhad last month ordered a high-level committee headed by the Military Secretary, a Lt-General rank officer, to study all aspects of theand submit a report by November-end.\"The proposal to abolish the Brigadier rank is just a proposal as of now. It requires comprehensive analysis before a final decision is taken. All modern armies routinely undertake such studies to remain dynamic and effective,\" said an Army spokesperson.But the Army's internal paper, accessed by TOI, suggests drastic measures. It says the rank of Lieutenant should be assigned to its \"gentlemen cadets\" in their last year of training at thein Dehradun. Consequently, officers on being commissioned into the Army should directly get the rank of Captain instead of first becoming Lieutenants.With the rank of Brigadier being abolished, the paper says the Colonels who are approved for the next rank should become Major-Generals and command brigades (which have three battalions of 800-1,000 soldiers each). Senior Major-Generals, in turn, will command divisions (each has three brigades).This is in line with the existing practice of junior Lt-Generals commanding a corps (which include three divisions), while senior ones command the six regional and one training commands. Apart from the seven commands, the Army currently has 14 corps, 49 divisions and over 240 brigades.\"This will also help in restoring the status of a brigade commander, who is higher in the warrant of precedence than an inspector-general of police. But police IGs have been made equivalent to joint-secretaries and enjoy a higher pay grade than Brigadiers,\" said the officer.The Army contends an officer in the civil services reaches the joint secretary level with just 18 years of service, while it takes 32-33 years for a military officer to reach the equivalent rank of a Major-General in the steeply pyramidical promotion structure of the armed forces. \"Almost 80 out of 100 IAS officers become joint secretaries. Only five to six of military officers out of 100 become Major-Generals,\" said another officer.",
"description": "The force would reportedly like to cut down the number of its ranks from nine to six or sevenThe step comes as a way to ensure better career prospects and parity with the civil servicesArmy chief General Bipin Rawat had last month ordered a high-level committee to study all aspects of the officer cadre restructuring",
"time_scraped": "2018-08-16 01:33:35.734975",
"article_id": "65016582",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65016584,imgsize-105329,width-400,resizemode-4/65016584.jpg",
"path": "full/d587e69d36d67b17994ca05e082e392d9e342f86.jpg",
"checksum": "14e30c06bc2af9ad0934012ce694ae7c"
}
]
}