{
"source_article_link": "https://timesofindia.indiatimes.com/india/sardar-sarovar-release-of-water-from-ibpt-stopped-after-heavy-rains-in-mp-gujarat/articleshow/65020369.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Sardar Sarovar: Release of water from IBPT stopped after heavy rains in MP, Gujarat",
"date_published": "2018-07-17T12:10:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65020448,imgsize-67142,width-400,resizemode-4/65020448.jpg"
],
"article_body": "VADODARA: The (SSNNL) in has stopped releasing water from the (IBPT) following heavy rains in the dam's catchment areas in the state and Madhya Pradesh, a top official has said. Due to drinking water crisis, the SSNL had started releasing Sardar Sarovar dam water from the IBPT in February this year and it was scheduled to continue till the end of this month, Dr J N Singh, Chief Secretary of the Gujarat government told PTI over the phone yesterday. \"However, owing to heavy rains in the dam's catchment areas in Madhya Pradesh and Gujarat, the SSNNL yesterday stopped releasing water from the IBPT. As per the earlier schedule, the release of water was supposed to continue till July 31,\" he said. As a result of good rainfall, the water level of the dam went up to 110.95 metres on Monday afternoon, he said. He said more rainfall is expected in these two neighbouring states as per the (IMD). \"Gujarat had to release water from the IBPT in February as the dam level had plunged. The step was necessary to provide drinking water to people in several cities and villages in the state,\" Singh said. S S Rathore, chairman and managing director of the SSNL said that for the first time in the last 13 years,the water level of the dam had plunged very low. \"It was the worst water level recorded in the last 13 years. It led to drinking water crisis in parts of the state and therefore we were compelled to release water from the IBPT from February 22,\" he added.",
"description": "VADODARA: The (SSNNL) in has stopped releasing water from the (IBPT) following heavy rains in the dam's catchment areas in the state and Madhya Pradesh, a top official has said. Due to drinking water crisis, the SSNL had started releasing Sardar Sarovar dam water from the IBPT in February this year and it was scheduled to continue till the end of this month, Dr J N Singh, Chief Secretary of the Gujarat government told PTI over the phone yesterday.",
"time_scraped": "2018-08-19 09:00:32.222501",
"article_id": "65020369",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65020448,imgsize-67142,width-400,resizemode-4/65020448.jpg",
"path": "full/4fc6979a9c1e969191e0f9fb0fe5e93e3ee5d6b0.jpg",
"checksum": "a85f1802cf75b8f1158aa8251d402c44"
}
]
}