{
"source_article_link": "https://timesofindia.indiatimes.com/india/swami-agnivesh-attacked-by-mob-in-jharkhand/articleshow/65022733.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Swami Agnivesh attacked by mob in Jharkhand, probe ordered",
"date_published": "2018-07-17T19:58:43+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "PAKUR: Self-proclaimed spiritual and social activist Swami was assaulted by a mob while on a visit to of Jharkhand, allegedly by activists of BJP’s youth wing Yuva Morcha, according to news agency ANI. State BJP spokesperson P Shahdeo denied involvement of his partymen in the incident. However he added that such an outburst is not unlikely, given Swami Agnivesh's 'track record.' Jharkhand chief minister Raghubar Das has ordered a probe into the matter, reports ANI.   Swami Agnivesh has alleged that there was no police presence at the venue, and the local SP and the district magistrate did not heed to his request to come to the spot. He has demanded that the guilty be identified from the footage available and action taken against them.   In the video footage obtained from the site of attack, a large crowd is seen setting themselves upon Agnivesh as he emerges out of a building. “A group of people had gathered before the hotel where Swami Agnivesh was staying, and attacked him as he was about to take part in a program,” a source told . Sometime back, Agnivesh had angered some fringe groups with his comments on the Sanatan Dharam. Concidentally, the attack came on a day that the Supreme Court severely condemned mob violence and recent lynching incidents, and asked the Parliament to draft a law to punish offenders. The top court also said that horrendous acts of 'mobocracy' cannot be tolerated and allowed to become a new norm. \"It has to be curbed with an hand… no citizen can take law into his hands or become a law on to himself,\" said the top court. A bench of Chief Justice (CJI) and Justices A M Khanwilkar and D Y Chandrachud said state and central governments have to take preventive, punitive and remedial measures to stop lynching incidents in future. CJI Misra said the Centre and states have to file compliance report on a series of directions given by the SC to prevent and punish lynching. Earlier this month, the SC said that mob lynching is a crime no matter what the motive is and added that it is a law and order issue that is the responsibility of state governments.",
"description": "PAKUR: Self-proclaimed spiritual and social activist Swami was assaulted by a mob while on a visit to of Jharkhand, allegedly by activists of BJP’s youth wing Yuva Morcha, according to news agency ANI. State BJP spokesperson P Shahdeo denied involvement of his partymen in the incident. However he added that such an outburst is not unlikely, given Swami Agnivesh's 'track record.' Jharkhand chief minister Raghubar Das has ordered a probe into the matter, reports ANI.",
"time_scraped": "2018-08-17 15:00:15.214813",
"article_id": "65022733",
"article_category": "IndiaNews",
"image_details": []
}