{
"source_article_link": "https://timesofindia.indiatimes.com/india/china-builds-unmanned-weather-station-near-arunachal-tibet-border/articleshow/65026749.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "China builds unmanned weather station near Arunachal-Tibet border",
"date_published": "2018-07-17T21:00:46+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65027860,imgsize-18281,width-400,resizemode-4/65027860.jpg"
],
"article_body": "BEIJING: China has set up an unmanned automatic weather observation station in Tibet near Arunachal Pradesh border to provide meteorological support to its military and assist operations of aircraft and missiles in case of \"regional live-fire conflicts\", a media report said today.The station in Yumai township under Lhunze county of Shannan Prefecture in Tibet will eliminate a blind area of meteorological services, state-run Global Times reported.It will also provide strong meteorological support for national defence and further promote border development as well as military-civilian integration, according to a statement by the Tibet weather bureau.\"The station can observe six factors, including air temperature, air pressure, wind speed, wind direction, humidity and precipitation, with more accuracy than before,\" Tashi Norbu, a technician in charge of the station, was quoted as saying by the daily.\"Yumai is at the border. The station could provide data to help with transportation and communication in national defence. It could also offer support during regional live-fire conflicts,\" Tashi said.Regional weather is an important factor that could influence the take-off and landing of aircraft and the launch of missiles during a battle, Song Zhongping, a military expert, told the Global Times.The small weather observation station could provide such information, Song said.Grasping accurate weather information could help seize good opportunities in the battles, Song added.The Line of Actual Control (LAC) between India and China covered 3488 kms which includes Arunachal Pradesh, claimed by China as part of southern Tibet.With nine households and 32 residents, Yumai is China's smallest township in terms of population.Yumai is located in the southern foothills of the Himalayas and affected by the monsoon climate of the Indian Ocean.\"We are now receiving accurate information sent by meteorological departments every day. The station is necessary as it fills the gaps in meteorological and hydrological information, which could support our development,\" Dawa, the secretary of the ruling Communist Party of China's Yumai committee, told the daily, noting that the station would help a lot in local pasture and road construction.The only road linking Yumai and the outside world has been under construction since 2017. More weather stations will be set up when the road is completed, Dawa said.The construction of the station began in early 2018. However, due to bad weather in the area, the construction could be completed in June. The first weather data was transmitted from the station on June 22, the report said.",
"description": "Weather station to provide meteorological support to military and assist operations of aircraft and missiles in case of \"regional live-fire conflicts, Chinese state media reports saidThe station is located in Yumai township under Lhunze county of Shannan Prefecture in Tibet ",
"time_scraped": "2018-08-16 01:35:25.999750",
"article_id": "65026749",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65027860,imgsize-18281,width-400,resizemode-4/65027860.jpg",
"path": "full/c4ff18ba2e424c9ff3c7cd30046bf606ae07bb8a.jpg",
"checksum": "b4dc27f8dc0caac23c23bb3c1fb8c71e"
}
]
}