{
"source_article_link": "https://timesofindia.indiatimes.com/india/protests-disrupt-rajya-sabha-proceedings/articleshow/65228289.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Protests disrupt Rajya Sabha proceedings",
"date_published": "2018-08-01T15:56:40+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65228290,imgsize-55520,width-400,resizemode-4/65228290.jpg"
],
"article_body": "NEW DELHI: Vociferous protests by members of the on Wednesday forced the adjournment of the for the day, as it failed to complete a discussion on and the reply to it by Home Minister . The House had witnessed an adjournment in the morning When the House reconvened at 2 PM after the lunch break, Sukhendu Shekhar Roy of the Trinamool Congress stood up and raised a point of order as BJP President Amit Shah was asked to conclude his speech he had started yesterday. Chairman M Venkaiah Naidu responded to the point of order, saying he has allowed Shah to complete his speech which could not be completed yesterday due to continued disruptions. Roy said \"if any member who is so called upon does not speak, he shall not be entitled except with the permission of the Chair. Here, in this case, one honourable member has already spoken. How can he speak twice? There is no provision in the rules.\" Soon thereafter, Trinamool Congress members stormed the Well of the House raising slogans, with Naidu asking them to go back to their seats, saying he has allowed Shah to conclude his speech. Congress member Bhubaneshwar Kalita said his party members from Assam have not spoken on the NRC and should be given an opportunity to do so. With disruptions continuing, Naidu said: \"Are we at the mercy of one party? Why have your people (from Assam) have not spoken (when) an opportunity came to your party. Your party should have first given the opportunity to Assam members.\" \"You create disorder and raise a point of order,\" Naidu said, and asked Shah to speak. However, the BJP chief was unable to speak amidst the slogan shouting and disruption. Naidu then said that the conduct of the protestors was unbecoming of Parliamentarians. \"There seems to be a system, that you spoke, you had your say, it has gone on record, now you come and disrupt the House. So you don't want to hear the reply,\" Naidu said, asking Shah again to speak. However the BJP President said if his speaking caused \"so much fear, he can let go of the opportunity\" to enable Naidu to run the House. \"I know why they (opposition) do not want me to speak,\" requesting Naidu to ask the Home Minister to make a statement. Then Naidu asked the Home Minister to reply to the debate. However, the TMC members who were shouting slogans from the Well remained unrelenting. Amid the unabated slogan shouting and disruption, Rajnath Singh sought the Chair's permission to table his entire speech, saying that some members did not wish to hear the reply to the discussion on the NRC. \"As some of the members do not want the debate to continue and are not willing to hear the reply of the Home Minister, I would like to thank the Home Minister for continuously coming here for three days,\" Naidu said and then adjourned the House for the day. The Rajya Sabha was earlier adjourned till noon as Congress members created an uproar, insisting on removal from House records certain remarks made by BJP MP Amit Shah in connection with the Assam National Register of Citizens. Soon after scheduled papers were laid, senior Congress MP Anand Sharma raised a point of order and insisted on removal of certain comments made by Shah yesterday in the Upper House. Several other Congress members were on their feet to support Sharma.",
"description": "NEW DELHI: Vociferous protests by members of the on Wednesday forced the adjournment of the for the day, as it failed to complete a discussion on and the reply to it by Home Minister .",
"time_scraped": "2018-08-19 06:00:21.731591",
"article_id": "65228289",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65228290,imgsize-55520,width-400,resizemode-4/65228290.jpg",
"path": "full/211479cc15603178988a722ca32a7428fe528235.jpg",
"checksum": "79637bcf1f3a3b31dad0ccc41de54f3a"
}
]
}