{
"source_article_link": "https://timesofindia.indiatimes.com/india/pti-sends-invites-to-indian-celebrities-waits-for-nod-on-modi/articleshow/65233934.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Kapil, Gavaskar, Sidhu, Aamir get Imran invite",
"date_published": "2018-08-03T17:46:42+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "ISLAMABAD: Pakistan Tehreek-i-Insaf (PTI) party on Wednesday was waiting for a government nod to invite Indian Prime Minister even as it has already sent out invitations to some of the Bollywood and Indian cricket stars, for the prime minister-elect Imran Khan’s oath ceremony next week. The PTI is likely to form a coalition government headed by 65-year-old cricketer turned politician, . The guest list for the swearing-in ceremony, sources said, includes some of Khan’s contemporaries in the cricket world, the legendary Indian cricketers, Kapil Dev, , and actor Aamir Khan whose blockbuster movie ‘Lagaan’ was centered around cricket in colonial India. Sources said the invitations to the Indian celebrities were sent out on the basis of the good rapport Khan shares with them. In his victory speech, following the July 25 general elections in which the PTI emerged as the single largest party, Khan reminded his critics in media that his connection with Indians was from the days of playing cricket and traveling in India. Though the invites to the non-governmental guests have already been sent, the PTI has asked the Foreign Office (FO) to confirm whether foreign heads of states could be invited to the prime minister’s swearing-in ceremony, scheduled to take place in Islamabad on August 11, three days before the country’s Independence Day. Sources said the PTI leaders in a meeting with the Foreign Office today sought permission to invite Modi and other foreign heads of Saarc states to the ceremony. However, a day earlier, the PTI had denied news reports that it was considering inviting Indian Prime Minister Narendra Modi and other heads of Saarc countries. In an informal conversation with reporters outside the Supreme Court after meeting the chief justice of Pakistan Mian Saqib Nisar, the PTI’s spokesperson Fawad Chaudhry said that the party has asked the FO if it would be possible to invite foreign dignitaries, including Indian PM Narendra Modi, at a short notice. “The FO is yet to respond on the matter and we are waiting for it,” Chaudhry said. He said the party had already invited celebrities like Amir Khan, Kapil Dev and Sunil Gavaskar for the ceremony. On Tuesday, Iftikhar Durrani, PTI’s media head, said, “We have note extended any invite nor was this issue discussed during Monday night’s telephonic conversation between Khan and Modi.” The trend of inviting Saarc heads was started by Prime Minister Modi in 2014 for his oath ceremony. Former Prime Minister Nawaz Sharif travelled to New Delhi to attend the event. However, the India-Pakistan relations went south after Pathankot and Uri cross-border attacks by Pakistan based terror groups.",
"description": "The guest list for Imran Khan's swearing-in ceremon includes some of Khan’s contemporaries in the cricket world- Kapil Dev, Sunil Gavaskar, Navjot Singh Sidhu and actor Aamir Khan Khan's party on Wednesday was waiting for a government nod to invite Indian PM Narendra Modi  The swearing-in ceremony is scheduled to take place in Islamabad on August 11",
"time_scraped": "2018-08-18 06:00:27.968756",
"article_id": "65233934",
"article_category": "IndiaNews",
"image_details": []
}