{
"source_article_link": "https://timesofindia.indiatimes.com/india/support-mamata-banerjee-on-nrc-deve-gowda/articleshow/65231321.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Support Mamata Banerjee on NRC: Deve Gowda",
"date_published": "2018-08-01T18:53:52+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65231320,imgsize-124075,width-400,resizemode-4/65231320.jpg"
],
"article_body": "NEW DELHI: Former prime minister and Janata Dal (Secular) chief H D Deve Gowda said on Wednesday that his party would support chief minister 's stand against the National Register of Citizens (NRC) process in . In a meeting with the Trinamool Congress (TMC) chief here, Gowda said Banerjee discussed the prevailing situation in the country and emphasised the need to bring together all non-BJP parties. \"Absolutely, I will stand by Mamata Banerjee on the issue of NRC,\" Gowda told reporters after the meeting. This is Banerjee's first meeting with Gowda after the TMC chief shared a stage with him during the swearing in ceremony of H D Kumaraswamy as chief minister. Speaking to reporters, Banerjee, who is in the national capital to meet leaders of various parties, said, \"Politics was also discussed in the meeting.\" The TMC supremo has strongly opposed the central government's NRC project in Assam, in which around 40-lakh names of applicants did not figure in the final draft published on Monday. The TMC, along with other opposition parties like Congress, have been vociferously protesting on this issue in the ongoing session of the Parliament. The West Bengal government has also passed a motion against the final draft of the NRC.",
"description": "NEW DELHI: Former prime minister and Janata Dal (Secular) chief H D Deve Gowda said on Wednesday that his party would support chief minister 's stand against the National Register of Citizens (NRC) process in . In a meeting with the Trinamool Congress (TMC) chief here, Gowda said Banerjee discussed the prevailing situation in the country and emphasised the need to bring together all non-BJP parties.",
"time_scraped": "2018-08-17 21:00:23.051695",
"article_id": "65231321",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65231320,imgsize-124075,width-400,resizemode-4/65231320.jpg",
"path": "full/6c1b21e39ac3b9f7a984ce908b5b858191b2c9e7.jpg",
"checksum": "e72ef97c8422b6fd49d29f8deff3f2e2"
}
]
}