{
"source_article_link": "https://timesofindia.indiatimes.com/india/armies-of-india-china-hold-meeting-in-nathu-la/articleshow/65231395.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Armies of India, China hold meeting in Nathu La",
"date_published": "2018-08-01T18:58:08+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65231396,imgsize-73243,width-400,resizemode-4/65231396.jpg"
],
"article_body": "NEW DELHI: Armies of India and China on Wednesday held a meeting at Nathu La in Sikkim sector with an aim to strengthen peace and tranquillity along the Sino-India border. The Special Border Personnel meeting took place as part of celebrations to commemorate the 91st anniversary of foundation of China's People's Liberation Army (PLA), the Army said here. The Indian delegation, comprising several officers and soldiers of the Army, attended the celebration following an invitation by the PLA. \"The PLA troops interacted with the visiting Indian delegation and presented a cultural programme comprising several events to celebrate the occasion,\" the Army said. \"As a gesture of goodwill, the Indian side also reciprocated with traditional cultural events to mark the occasion. Celebrations took place in a very festive environment and provided an opportunity to both sides to display their rich culture,\" it said. The meeting between the two armies took place three months after Prime Minister and Chinese President held an informal summit in Wuhan in China with an aim to bolster bilateral ties which nosedived in the wake of the Doklam standoff. \"Such interactions between both armies have resulted in promoting mutual understanding and contributed towards achieving common goals of peace and tranquillity along the borders,\" the Army said. In their informal summit, Modi and Xi had decided to issue \"strategic guidance\" to their militaries to strengthen communication and build trust and understanding between the border guarding forces of the two countries. Troops of India and China were locked in the 73-day standoff in Doklam since June 16 last year after the Indian side stopped the construction of a road in the disputed area by the Chinese Army. and China have a dispute over Doklam. The face-off ended on August 28. The two sides hold Border Personnel Meetings at five points -- Daulat Beg Oldie in northern Ladakh, Kibithu in Arunachal Pradesh, Chusul in Ladakh, Bum-La near Tawang in Arunachal Pradesh and Nathu-La in Sikkim.Armies of India, China hold meeting in Nathu La",
"description": "NEW DELHI: Armies of India and China on Wednesday held a meeting at Nathu La in Sikkim sector with an aim to strengthen peace and tranquillity along the Sino-India border. The Special Border Personnel meeting took place as part of celebrations to commemorate the 91st anniversary of foundation of China's People's Liberation Army (PLA), the Army said here. The Indian delegation, comprising several officers and soldiers of the Army, attended the celebration following an invitation by the PLA. \"The PLA troops interacted with the visiting Indian delegation and presented a cultural programme comprising several events to celebrate the occasion,\" the Army said. \"As a gesture of goodwill, the Indian side also reciprocated with traditional cultural events to mark the occasion. Celebrations took place in a very festive environment and provided an opportunity to both sides to display their rich culture,\" it said.",
"time_scraped": "2018-08-18 00:00:34.476919",
"article_id": "65231395",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65231396,imgsize-73243,width-400,resizemode-4/65231396.jpg",
"path": "full/6196686a9c5fe9b4ef95f23bd7ab17b619bdb5f4.jpg",
"checksum": "73fbfab26f1dcef05b430069b583ffc8"
}
]
}