{
"source_article_link": "https://timesofindia.indiatimes.com/india/navjot-singh-sidhu-to-attend-imran-khans-swearing-in/articleshow/65240118.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Navjot Singh Sidhu to attend Imran Khan's swearing-in",
"date_published": "2018-08-02T12:08:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65240101,imgsize-764577,width-400,resizemode-4/65240101.jpg"
],
"article_body": "CHANDIGARH: Punjab cabinet minister said on Wednesday that he has accepted the invitation extended by for attending his swearing-in ceremony as the prime minister of . \"It is (a) great honour, I accept the invitation. Men of genius are admired, men of power are feared, but men of character are trusted. Khan Sahab is a man of character. He can be trusted. Sportsmen build bridges, break barriers, unite people,\" Sidhu said in a statement issued here. Sidhu was among other personalities who had reportedly been invited by Khan to attend his oath-taking ceremony. Khan's party, (PTI), has emerged as the single-largest party in the National Assembly after last week's general election in the neighbouring country. Khan had said he would take oath as Pakistan's prime minister on August 11.",
"description": "CHANDIGARH: Punjab cabinet minister said on Wednesday that he has accepted the invitation extended by for attending his swearing-in ceremony as the prime minister of . \"It is (a) great honour, I accept the invitation. Men of genius are admired, men of power are feared, but men of character are trusted. Khan Sahab is a man of character. He can be trusted. Sportsmen build bridges, break barriers, unite people,\" Sidhu said in a statement issued here.",
"time_scraped": "2018-08-18 06:00:31.683340",
"article_id": "65240118",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65240101,imgsize-764577,width-400,resizemode-4/65240101.jpg",
"path": "full/c40de578718143b74b28ec4968d16a6b1b00028b.jpg",
"checksum": "a904b1ee63ce189812636e78f8bae072"
}
]
}