{
"source_article_link": "https://timesofindia.indiatimes.com/india/how-muzaffarpur-case-accused-brajesh-thakur-built-his-clout/articleshow/65242507.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "How Muzaffarpur case accused Brajesh Thakur built his clout",
"date_published": "2018-08-02T14:54:25+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65234912,imgsize-24669,width-400,resizemode-4/65234912.jpg"
],
"article_body": "PATNA/MUZZAFARPUR: Two failed attempts at entry into politics from the party of a convicted gangster, starting three newspapers in as many languages with his son and daughter as editors and entering the “NGO circuit” five years ago to bag government contracts as well as advertisements for both his businesses – worked persistently to build his clout in Muzaffarpur and Patna. The main accused in the horrific sexual assault and rape incidents with more than three dozen girls in his shelter homes in Muzaffarpur, Thakur has government on the back foot owing to the largesse of contracts and advertisements doled out to him. Kumar’s party now dubs him the “most notorious person”, in the words of senior Janata Dal (United) leader . “He has no connection with the JD U. He is not our party’s member. We arrested him within days of his involvement coming to light and he has been in jail for the last two months and his bail has been rejected by courts. Nitish Kumar would never protect such a person. But yes, our heads do hang in shame over the horrific . We are very embarrassed over this,” Tyagi told ET. Convicted gangster Anand Mohan’s erstwhile People Party was the vehicle for Thakur’s attempt to enter politics in 1995 and 2000 on an assembly ticket from a seat in Muzaffarpur – he lost on both occasions, getting just 200 votes in 1995. Thakur then focused on his father’s small-time newspaper, Pratay Kamal.   He got a Press Information Bureau accreditation two decades ago – which the Centre cancelled on Wednesday – and sat on the state committee that decided who got press accreditation in the state. “The target was government advertisements, which he got in good numbers. Buoyed by the clout he built up, he started two new newspapers in 2012, NewsNext in English and Haalat-e-Bihar in Urdu, and made his son and daughter their editors,” a local journalist in Muzaffarpur told ET on condition of anonymity. In 2013, Thakur started a non-governmental organisation, Sewa Sankalp Aur Vikas Samiti, and bagged the job from to run child shelter homes in Muzaffarpur. Thakur’s palatial house in the town has an adjoining printing press that houses his three newspapers and a small staircase leads up to the shelter home. Thakur co-opted the district child welfare committee, which is supposed to survey such child shelter homes and raise red flags in case of maladministration. Till 2015, there were five people on this committee including three women. But since 2015, only three men have been on the committee. “No surveys were done. The committee chairman, Dilip Verma, is on the run while one member, Vikas Kumar, is in jail. The local child protection officer, Ravi Roshan, is in jail too for covering up these crimes,” a senior Central Bureau of Investigation (CBI) official in Muzaffarpur told ET. A key person whom the CBI is also looking for is a woman named Madhu, who ran Thakur’s shelter. The agency has decided to record statements of all 44 girls housed in Thakur’s shelter home before a magistrate and will interrogate all jailed accused again. The Bihar government is getting doctors from the All India Institute of Medical Sciences in Delhi to counsel the victims.",
"description": "PATNA/MUZZAFARPUR: Two failed attempts at entry into politics from the party of a convicted gangster, starting three newspapers in as many languages with his son and daughter as editors and entering the “NGO circuit” five years ago to bag government contracts as well as advertisements for both his businesses – worked persistently to build his clout in Muzaffarpur and Patna. The main accused in the horrific sexual assault and rape incidents with more than three dozen girls in his shelter homes in Muzaffarpur, Thakur has government on the back foot owing to the largesse of contracts and advertisements doled out to him. Kumar’s party now dubs him the “most notorious person”, in the words of senior Janata Dal (United) leader . “He has no connection with the JD U. He is not our party’s member.",
"time_scraped": "2018-08-18 06:00:27.703456",
"article_id": "65242507",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65234912,imgsize-24669,width-400,resizemode-4/65234912.jpg",
"path": "full/b788ead9b28e3d3fa62b0abafb8e10e5080c1a26.jpg",
"checksum": "8aa76f45e70848f60cfc9f7ab97524a6"
}
]
}