{
"source_article_link": "https://timesofindia.indiatimes.com/india/sushma-swaraj-meets-kyrgyzstan-counterpart-discusses-ways-to-boost-ties/articleshow/65269164.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Sushma Swaraj meets Kyrgyzstan counterpart, discusses ways to boost ties",
"date_published": "2018-08-04T13:53:38+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65269166,imgsize-431651,width-400,resizemode-4/65269166.jpg"
],
"article_body": "BISHKEK: External Affairs Minister on Saturday held talks with her Kyrgyzstan counterpart on deepening cooperation in a number of areas, including trade, energy and defence and security. Swaraj arrived yesterday at Issyk Kul in eastern Kyrgyzstan on a two-day visit after wrapping up her tour to Kazakhstan. She was received by Abdyldaev. \"Taking steps to tap the huge potential that exists between our two countries! EAM Sushma Swaraj and Kyrgyzstan Foreign Minister Abdyldaev discussed opportunities for cooperation in fields of trade and investment, defence and security, IT, health, HRD, tourism and joint film production,\" Raveesh Kumar, the Ministry of External Affairs spokesperson, tweeted. \"Walking together to take our relationship to new heights! EAM Sushma Swaraj and Foreign Minister of Kyrgyzstan Erlan Abdyldaev proceed to the restricted format meeting in Issyk Kul,\" he had said in a tweet before the meeting.  Swaraj has interacted with Abdyldaev on a number of occasions, including on the margins of the UN General Assembly in New York. The minister is on a three-nation tour to Kazakhstan, Kyrgyzstan and Uzbekistan as part of India's efforts to boost strategic partnership with the resource-rich Central Asian nations. India and Kyrgyzstan share multi-dimensional relations including political, parliamentary, defence, science and technology and health. The visits of Prime Minister to Kyrgyzstan in July 2015 followed by Kyrgyzstan President Almazbek Sharshenovich Atambayev's trip to India and interactions on the margins of (SCO) Summits, have consolidated the traditionally cordial and close ties between the two countries. It has provided impetus to further strengthening of bilateral ties, according to an official statement. In the last segment of her three-nation Central Asian tour, Swaraj would arrive in the Uzbek capital of Tashkent today.",
"description": "BISHKEK: External Affairs Minister on Saturday held talks with her Kyrgyzstan counterpart on deepening cooperation in a number of areas, including trade, energy and defence and security. Swaraj arrived yesterday at Issyk Kul in eastern Kyrgyzstan on a two-day visit after wrapping up her tour to Kazakhstan. She was received by Abdyldaev. \"Taking steps to tap the huge potential that exists between our two countries! EAM Sushma Swaraj and Kyrgyzstan Foreign Minister Abdyldaev discussed opportunities for cooperation in fields of trade and investment, defence and security, IT, health, HRD, tourism and joint film production,\" Raveesh Kumar, the Ministry of External Affairs spokesperson, tweeted.",
"time_scraped": "2018-08-20 21:00:12.037806",
"article_id": "65269164",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65269166,imgsize-431651,width-400,resizemode-4/65269166.jpg",
"path": "full/f60335ee24208e85fe76b07c1dba7870165f79e1.jpg",
"checksum": "fbb80db31036361fce56fd3bdff92764"
}
]
}