{
"source_article_link": "https://timesofindia.indiatimes.com/india/states-dont-have-quantifiable-data-of-inadequate-representation-of-scs/sts-in-govt-jobs-sc/articleshow/65262027.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "States don't have quantifiable data of inadequate representation of SCs/STs in govt jobs: SC",
"date_published": "2018-08-03T21:58:46+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65262015,imgsize-63443,width-400,resizemode-4/65262015.jpg"
],
"article_body": "NEW DELHI: The Supreme Court on Friday asked the Centre as to why states have not come forward with any quantifiable data to decide the inadequacy of representation of Scheduled Castes and Scheduled Tribes in government services even 12 years after its verdict on the 'creamy layer'. The apex court's query came after the Centre said that M Nagaraj verdict of 2006, which had dealt with the issue of 'creamy layer' for reservations to SC and ST categories in government job promotions, has virtually stopped the promotions by putting criteria like backwardness, inadequate representation and overall administrative efficiency, and it requires reconsideration by a larger bench. The Centre, however, contended these criteria should be done away with as SCs and STs are presumed as backward and there was no need to have a quantifiable data to prove that such categories of employees suffered from backwardness. A five-judge bench headed by Chief Justice clarified that the reference order to the Constitution bench is very limited that whether the M Nagaraj verdict requires reconsideration or not. The bench, also comprising Justices Kurian Joseph, R F Nariman, Sanjay Kishan Kaul and Indu Malhotra, said that Centre's stand is that 2006 verdict requires reconsideration. \"If that is the case, then you (Centre) have to prove that the 2006 judgement was wrong in asking the states to first get quantifiable data to prove backwardness of SCs and STs before granting reservation in promotions in government jobs,\" the bench said. The five-judge Constitution bench is examining whether its 12-year-old verdict that had dealt with the issue of 'creamy layer' for reservations to SC and ST categories in government job promotions needs to be re-visited by a seven-judge bench. \"Why no state after the 2006 verdict till now, have not undertaken any exercise of collating the quantifiable data about inadequacy of SCs and STs representations in promotion for each cadre of government jobs,\" the bench said. Attorney General K K Venugopal, appearing for Centre, said that SCs and STs are presumed as backward and there was no need to have a quantifiable data to prove that such categories of employees suffered from backwardness. \"The 1992 verdict in Indra Swahney case (popularly called Mandal Commission verdict), had said that test of backwardness cannot be applied on SCs and STs as they are presumed to be backward,\" he said. The bench, said that Article 16(4) of the Constitution deals with considerable representation and if there is a quantifiable data then state is within its right to grant reservations in appointments. It said that the 2006 verdict said that accelerated promotion to SCs/STs can only be given by the state, if they are inadequately represented and it is necessary for overall efficiency of administration. \"These all should be based on quantifiable data,\" it said. Article 16(4) says \"nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favour of any backward class of citizens which, in the opinion of the State, is not adequately represented in the services under the State\". Venugopal said that in job promotions also the SCs and STs must account for 23 per cent or the real motive for reservations will get defeated. He said that the reservations were given to SCs and STs categories to correct a wrong as they had suffered for more than 1000 years. The bench said that if you (Centre) go by enabling provisions then there is need for quantifiable data and the 2006 verdict had dealt about these requirements. The AG said that Nagaraj verdict dealt with adequacy of representations but it does not contemplate who are backward and who are not backward. Justice Nariman said, \"to sum up you (Centre) are saying that the quantifiable data only shows inadequate representations but not backwardness\". The bench, then asked the AG, about inadequate representation to which he said, \"They (SCs/STs) could not enter services like the upper castes. They are not being considered. State has to protect them. Their representation has to be proportional to the population otherwise it will be inadequate representation\". The AG on the question of states not coming forward with quantifiable data replied that such data is not static but dynamic as people keep retiring or they die and the data keeps fluctuating. The hearing remained inconclusive and would continue on August 16. The apex court had on July 11 refused to pass any interim order against its 2006 verdict and said that a five-judge bench would first see whether it needs to be examined by a seven-judge bench or not. The M Nagaraj verdict of 2006 had held that the 'creamy layer' concept cannot be applied to the Scheduled Castes and Scheduled Tribes for promotions in government jobs, like two earlier verdicts of 1992 Indra Sawhney and others versus Union of India (popularly called Mandal Commission verdict) and 2005 E V Chinnaiah versus State of which had dealt with creamy layer in Other Backward Classes category. It had reiterated that the ceiling-limit of 50 per cent, the concept of the creamy layer and the compelling reasons like backwardness, inadequacy of representation and overall administrative efficiency were all constitutional requirements, without which the structure of equality of opportunity in Article 16 would collapse.",
"description": "SC sought to know why states have not come forward with quantifiable data to decide the inadequacy of representation of SC/STs in jobs The Centre, however, contended these criteria should be done away with as SCs and STs are presumed as backward and there was no need to have a quantifiable data",
"time_scraped": "2018-08-16 15:00:17.516232",
"article_id": "65262027",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65262015,imgsize-63443,width-400,resizemode-4/65262015.jpg",
"path": "full/cd53988e9436645346a5e7c6fcad202fdb88fb78.jpg",
"checksum": "a31d80d50a93a02f59c96c35393668e6"
}
]
}