{
"source_article_link": "https://timesofindia.indiatimes.com/india/ls-passes-bill-to-restore-original-provisions-of-sc/st-act/articleshow/65299664.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "LS passes bill to restore original provisions of SC/ST Act",
"date_published": "2018-08-07T03:43:09+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65299667,imgsize-232160,width-400,resizemode-4/65299667.jpg"
],
"article_body": "NEW DELHI: On a day Parliament passed a bill giving constitutional status to the backward classes commission, Lok Sabha cleared a bill to overturn a Supreme Court order which allegedly ‘diluted’ some provisions of the law protecting Dalits and tribals from atrocities.The Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Bill, 2018, rules out any provision for anticipatory bail for a person accused of atrocities against SCs/STs, notwithstanding any court order. It also provides that no preliminary enquiry will be required for registering a criminal case and an arrest under this law would not be subject to any approval.Social Justice and Empowerment minister Thaawar Chand Gehlot said the amendment would strengthen legislative provisions to protect SCs/STs. Union minister and LJP chiefsaid he was hopeful ofpassing the bill unanimously.Gehlot said after the Supreme Court put some restrictions on Article 18 of the Act, the law lost its importance. “The review petition filed by the government is still pending. Due to delay in the Supreme Court and rising anger among the Dalit community, there was a need to amend Article 18,” the minister said.He accepted that 6-7% cases under theand 10-12% cases under the SC/ST Act were misused. “But citing misuse of the Act, we can't allow 88% of Dalits to suffer,” Gehlot said.Leader of Congress in the House Mallikarjun Kharge said the government should have brought this bill as an ordinance much earlier. “In recent times, the government has brought as many as six ordinances, they could have brought the seventh ordinance as well. If there was no public pressure, then the government would not have brought this bill,” he said. He urged the government to include the SC/ST Act in the ninth schedule of Constitution so that courts could not touch it.The bill is politically significant as the government has been struggling to counter opposition criticism that it did not work strenuously enough to argue against any dilution of the SC/ST Act in the apex court and it came days before a nation-wide agitation planned by Dalit groups on August 9.Deliberations in BJP and RSS recognised that Dalit sentiment was agitated over the ruling and the perception that the government was not doing enough needed to be countered energetically.",
"description": "NEW DELHI: On a day Parliament passed a bill giving constitutional status to the backward classes commission, Lok Sabha cleared a bill to overturn a Supreme Court order which allegedly ‘diluted’ some provisions of the law protecting Dalits and tribals from atrocities.The Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Bill, 2018, rules out any provision for anticipatory bail for a person accused of atrocities against SCs/STs, notwithstanding any court order. It also provides that no preliminary enquiry will be required for registering a criminal case and an arrest under this law would not be subject to any approval.Social Justice and Empowerment minister Thaawar Chand Gehlot said the amendment would strengthen legislative provisions to protect SCs/STs. Union minister and LJP chiefsaid he was hopeful ofpassing the bill unanimously.",
"time_scraped": "2018-08-16 05:27:08.967482",
"article_id": "65299664",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65299667,imgsize-232160,width-400,resizemode-4/65299667.jpg",
"path": "full/a7d02bc902ff6b2aba7d96c7a96a984dfee48fee.jpg",
"checksum": "70fb55cc43af702b960df1cf2cc22819"
}
]
}