{
"source_article_link": "https://timesofindia.indiatimes.com/india/al-qaida-linked-ansar-ghazwat-ul-hinds-attempt-to-disturb-independence-day-celebrations-in-delhi-foiled-igp-jammu/articleshow/65291077.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Al-Qaida linked Ansar Ghazwat-ul-Hind's attempt to disturb Independence Day celebrations in Delhi foiled: IGP Jammu",
"date_published": "2018-08-06T14:34:44+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65291087,imgsize-215427,width-400,resizemode-4/65291087.jpg"
],
"article_body": "JAMMU: The Police on Monday claimed to have foiled an attempt by Al-Qaida linked Ansar Ghazwat-ul-Hind terror group to disrupt the Independence Day celebrations in Delhi with the arrest of a terrorist. Inspector General of Police, (Jammu) told reporters that Irfan Hussain Wani, who hailed from Dangerpora-Awantipora village of south Kashmir, was arrested from Gandhi Nagar locality of Jammu city yesterday. He said a police squad noticed him moving under suspicious circumstances at Chatri point. Eight grenades were seized from his bag after a search and he was immediately taken into custody and interrogated. \"He was carrying this cache of grenades to Delhi to hand it over to a contact. These grenades would have been used to disturb the Independence Day celebrations,\" Jamwal said, adding that he was also carrying Rs 60,000. The Jammu police chief said that during questioning, the 25-year-old revealed his affiliation with Ansar Ghazwat-ul-Hind led by Zakir Mussa and added that he was in touch with number two of the outfit, Rehan. \"A BA dropout and radicalised, the terrorist was active in militancy for the last one year. With his arrest, a major chance of disturbing the Independence day celebrations in Delhi and parts of Jammu was foiled,\" he said. Terming the arrest a \"major success\", the IGP said it was the result of robust security measures put in place by the police to ensure peaceful Independence Day celebrations in Jammu. The IGP said the interrogation of the terrorist was going on and revealing anything more would hamper the investigation. He said that they were looking into all aspects and they were also checking his mobile phone for more information. Meanwhile, the Delhi Police said that it would be questioning the accused. A team of the Special Cell is in Jammu. In reply to a question, the IGP said that Wani was not onboard a Delhi-bound bus but on foot when he was intercepted by alert policemen. The police official said that Wani had received the consignment in Kashmir and was planning to hand over the same to somebody in Delhi and added that there was no security lapse. \"His arrest was the result of the robust security structure which is in place,\" he said. Asked whether the arrest of the Ansar Ghazwat-ul-Hind terrorist was linked to an intelligence alert about a terrorists' plan to trigger serial blasts in Delhi or Jammu, he said, \"Maybe it is a part of that but we have maintained high alert and the major success was the result of that alertness.\" On a grenade attack at the Jammu bus stand on May 24 which left two policemen and a pedestrian injured, he said it was a separate incident and not linked with this arrest. \"We have already solved the case and arrested the accused. We will share details of the same separately,\" the officer said. The policemen were on high alert and Independence Day celebrations would pass off peacefully, the IGP said. About hideout and presence of sleeper cells in Jammu, he said, \"Investigation is going on and once we get any concrete information we will share it with you.\" Asked whether the Amarnath yatra was suspended from Jammu due to the separatist sponsored strike in Kashmir valley in support of Article 35A, he said the annual pilgrimage was going on for the last over one month and had seen a decline in the number of the pilgrims visiting the 3,880 metre high holy cave shrine. \"As per our administrative arrangement, once the number of intending pilgrims goes up, the yatra will resume,\" he said.",
"description": "Terming the arrest a \"major success\", the IGP said it was the result of robust security measures put in place by the police to ensure peaceful Independence Day celebrations in Jammu The IGP said the interrogation of the terrorist was going on and revealing anything more would hamper the investigation",
"time_scraped": "2018-08-20 21:00:39.092543",
"article_id": "65291077",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65291087,imgsize-215427,width-400,resizemode-4/65291087.jpg",
"path": "full/c30b4cf64ed9318dc464395a8aa819add8dcd755.jpg",
"checksum": "7701e05431c589b90ee51102dae05b43"
}
]
}