{
"source_article_link": "https://timesofindia.indiatimes.com/india/bombay-high-court-rejects-abu-salems-plea-for-parole-to-marry/articleshow/65303499.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Bombay High Court rejects Abu Salem's plea for parole to marry",
"date_published": "2018-08-07T13:48:11+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65303506,imgsize-243554,width-400,resizemode-4/65303506.jpg"
],
"article_body": "NEW DELHI: (HC) on Tuesday rejected 1993 serial blasts Abu Salem's plea for to get married. Salem had approached the Bombay high court seeking 45 days' parole to marry Mumbra resident Kausar Bahar. The authorities had rejected his application in April on the grounds of security. The convict, who is lodged in Taloja jail, had then challenged in the Bombay HC the order rejecting his parole plea. Salem, represented by advocate Farhana Shah, claimed that the Konkan divisional commissioner and the appellate authorities rejected his plea for parole without \"applying their mind\". Earlier, Salem had claimed to have married Kausar over the phone during a train journey in 2014 when he was being taken to Lucknow for a court hearing. Kausar had subsequently filed an application before a local court threatening to kill herself if she was not granted permission to marry the jailed gangster. She had claimed that the reports of her alleged nikah with Salem had defamed her. Salem has been in jail since his extradition from Portugal in 2005. According to his application, the extradition agreement spells out that he cannot be imprisoned for more than 25 years. Salem was convicted of the last year and sentenced to life imprisonment. ",
"description": "Salem had approached the Bombay high court seeking 45 days' parole to marry Mumbra resident Kausar Bahar The authorities had rejected his application in April on the grounds of security The convict, who is lodged in Taloja jail, had then challenged in the Bombay HC the order rejecting his parole plea",
"time_scraped": "2018-08-18 00:00:40.727345",
"article_id": "65303499",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65303506,imgsize-243554,width-400,resizemode-4/65303506.jpg",
"path": "full/410f53865eb4833e7ba978746da126a7f05011f1.jpg",
"checksum": "82778d7f32a87241eb2bf9809e2a050c"
}
]
}