{
"source_article_link": "https://timesofindia.indiatimes.com/india/the-only-point-of-business-karunanidhi-jayalalithaa-agreed-upon/articleshow/65315616.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "The only point of business Karunanidhi, Jayalalithaa agreed upon",
"date_published": "2018-08-08T05:59:08+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "MKarunanidhi and J as fierce political rivals could never accept the other’s decisions — except when it came to industrialisation, and this rare consensus brought fortune to , making it the second richest state. When the economy was opened up in the 1990s, TN benefited from a wave of investments, starting with the entry of Ford India during AIADMK’s tenure. Hyundai, Saint Gobain, Nokia, Huawei, Renault, Daimler and others followed over the decades, doing business in a conducive environment no matter which government was in power. “Karunanidhi was always receptive to suggestions and inputs. He was sensitive to the needs of industry,” said N Srinivasan, vice-chairman and MD of The India Cements. Srinivasan first met in 1968 when the latter was public works minister. “When it came to business, he always looked ahead,” said Srinivasan. The DMK government’s focus on industry resulted in TN gaining manufacturing capabilities across sectors. In the run-up to the year 2000, when IT companies were busy setting up base in Bengaluru and Hyderabad, it dawned on Karunanidhi that 80% of the workforce in those two cities and that sector were migrants from TN. In less than a year, his government not only drew up a roadmap for the IT sector but also promoted a massive IT office space project, Tidel Park. While bankers considered it merely a real estate project, the state stood guarantee for the lenders. Chennai joined the country’s elite IT club and there was no looking back. Chennai’s was designated the ‘IT Corridor’ and a six-laning plan led to the development of the stretch for office, industrial and residential projects. The DMK government also set aside 1,000 acres at the other end of IT corridor for companies to develop their own IT parks.",
"description": "MKarunanidhi and J as fierce political rivals could never accept the other’s decisions — except when it came to industrialisation, and this rare consensus brought fortune to , making it the second richest state. When the economy was opened up in the 1990s, TN benefited from a wave of investments, starting with the entry of Ford India during AIADMK’s tenure. Hyundai, Saint Gobain, Nokia, Huawei, Renault, Daimler and others followed over the decades, doing business in a conducive environment no matter which government was in power. “Karunanidhi was always receptive to suggestions and inputs. He was sensitive to the needs of industry,” said N Srinivasan, vice-chairman and MD of The India Cements. Srinivasan first met in 1968 when the latter was public works minister. “When it came to business, he always looked ahead,” said Srinivasan.",
"time_scraped": "2018-08-17 03:01:08.834828",
"article_id": "65315616",
"article_category": "IndiaNews",
"image_details": []
}