{
"source_article_link": "https://timesofindia.indiatimes.com/india/china-not-conducting-any-mining-activity-in-arunachal-pradesh-india/articleshow/65321185.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "China not conducting any mining activity in Arunachal Pradesh: India",
"date_published": "2018-08-08T14:11:13+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65316641,imgsize-62248,width-400,resizemode-4/65316641.jpg"
],
"article_body": "NEW DELHI: India has clarified that China is not conducting any mining activity inbut reiterated strongly that China's claim on 90,000 sq km in Arunachal Pradesh is baseless and that this has been raised at the highest level in Beijing.The clarification on reported mining activity by China in Arunachal Pradesh was recently submitted by MEA in.\"No such activity has been carried out by China inside the territory of the Indian state of Arunachal Pradesh,\" MoS External Affairs V K Singh said in Rajya Sabha recently.\"China disputes the international boundary between India and China. In the Eastern Sector, China claims approximately 90,000 square kilometers of Indian territory in the state of Arunachal Pradesh. The fact that Arunachal Pradesh is an integral and inalienable part of India has been clearly conveyed to the Chinese side on several occasions, including at the highest level,\" the Minister clarified.The Government keeps a constant watch on all developments having a bearing on India’s security and takes all necessary measures to safeguard it, the Minister assured.In May Hong Kong based South China Morning Post claimed in a report that Beijing has begun large-scale mining operations on its side of the border with Arunachal Pradesh where a huge trove of gold, silver and other precious minerals valued at about US 60 billion has been found.The mine project is being undertaken in Lhunze county under Chinese control adjacent to the Indian border, the report claimed.Projecting the mining operations as part of China's move to take over Arunachal Pradesh, the report said \"people familiar with the project say the mines are part of an ambitious plan by Beijing to reclaim\".\"China's moves to lay claim to the region'swhile rapidly building upcould turn it into 'another' they said,\" it said.",
"description": "NEW DELHI: India has clarified that China is not conducting any mining activity inbut reiterated strongly that China's claim on 90,000 sq km in Arunachal Pradesh is baseless and that this has been raised at the highest level in Beijing.The clarification on reported mining activity by China in Arunachal Pradesh was recently submitted by MEA in.\"No such activity has been carried out by China inside the territory of the Indian state of Arunachal Pradesh,\" MoS External Affairs V K Singh said in Rajya Sabha recently.",
"time_scraped": "2018-08-16 06:02:47.732610",
"article_id": "65321185",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65316641,imgsize-62248,width-400,resizemode-4/65316641.jpg",
"path": "full/134ff8dd2dd7f4dcd1e44b9716a83dc61e26526d.jpg",
"checksum": "ea90dc5c1702a0e28ea0b3846ee058bb"
}
]
}