{
"source_article_link": "https://timesofindia.indiatimes.com/india/bihars-social-welfare-minister-manju-verma-resigns-over-muzaffarpur-shelter-home-rape-scandal/articleshow/65327924.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Bihar's social welfare minister Manju Verma resigns over Muzaffarpur shelter home rape scandal",
"date_published": "2018-08-09T01:46:04+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65330131,imgsize-183099,width-400,resizemode-4/65330131.jpg"
],
"article_body": "PATNA:PATNA: Bihar social welfare minister on Wednesday resigned after a section of media, quoting police sources and call data record (CDR), reported that her husband Chandeshwar Verma had talked to accused Brajesh Thakur at least 17 times between January-June. Manju’s resignation came soon after Thakur admitted to mediapersons at the court campus that he used to speak to Chandeshwar “on political issues”. Sources said Manju met CM in the afternoon and put in her papers. Manju was in the eye of the storm ever since Shiba Kumari, wife of jailed child protection officer Ravi Kumar Raushan, alleged that Chandeshwar used to frequently visit the Muzaffarpur shelter home where 34 girls were allegedly raped over a period of time. Shiba had alleged that Chandeshwar used to go to the upper floor, where minor girls used to stay, while asking the accompanying officers to stay put on the ground floor. Manju said: “My husband is innocent and will be proved innocent. But I resigned on moral grounds after media reports appeared that my husband had spoken to Thakur 17 times.” “I also request the Patna HC to make the CDR of Thakur’s phone public as it would reveal how many other whitecollar people had talked to him,” she said. Manju said action should also be taken against all those whose names would figure in the CDR.",
"description": "Manju Verma's husband has been accused of having links with the alleged mastermind of the shelter home scandal Opposition leaders have alleged that Manju Verma was aware of her husband's frequent visits to the Muzaffarpur shelter home where 34 minor girls were raped",
"time_scraped": "2018-08-18 06:00:27.681396",
"article_id": "65327924",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65330131,imgsize-183099,width-400,resizemode-4/65330131.jpg",
"path": "full/0c86717b860114119f738314c0de8bcc52dffd6f.jpg",
"checksum": "e29ce91f5f3a16296225062dc9b8319f"
}
]
}