{
"source_article_link": "https://timesofindia.indiatimes.com/india/bihar-minister-manju-verma-plays-caste-card-in-muzaffarpur-aftermath/articleshow/65321874.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Bihar minister Manju Verma plays caste card in Muzaffarpur aftermath",
"date_published": "2018-08-08T15:03:00+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65316374,imgsize-1147849,width-400,resizemode-4/65316374.jpg"
],
"article_body": "Bihar’s social welfare minister , 48, is the sole woman in Nitish Kumar’s cabinet. But, more important, she belongs to the Kushwaha community, a factor she has determinedly used as a shield in the wake of the nationwide uproar over the serial sexual abuse case that has erupted on her watch and tarnished Kumar’s image as ‘sushasan babu’ or good administrator. Kushwahas account for 9 per cent of the state population, making them the third largest community in Bihar after Muslims and Yadavs. Verma, a two-time MLA from Begusarai, was quick to turn the demands for her resignation into a caste issue, saying she was being targeted because she belonged to a backward community. This reduced Kumar’s options further. With the likely exit of Upendra Kushwaha from the BJP-led NDA, Verma’s sacking could alienate her community from the ruling coalition ahead of the 2019 general election. Hers, according to those aware of the matter, is a classic case of an influential husband pulling the strings from the shadows. In posters in Begusarai, her husband, Chandrashekhar Verma, calls himself a “senior leader” of JDU. His father was an MLA from Cheria Baraipur constituency in Begusarai in 1980 from CPI, but it was his wife who took forward the political legacy by winning from the same seat in 2010 on a JDU ticket. She repeated the win in 2015 on the seat. The husband has been working behind the scenes and usually accompanies his wife, said political functionaries in Bihar. This was the case when the couple visited Muzaffarpur in February 2016 for a felicitation function, and his wife also paid a visit to the child shelter run by the main accused Brajesh Thakur. “If I resign, it will prove that my husband is guilty. Instead, if he is found guilty in the CBI probe, I will ensure that he is hanged,” the minister has said. The crux of the allegation is the testimony of the wife of an arrested child protection officer Ravi Roshan that her husband used to visit the child shelter run by Thakur.",
"description": "Bihar’s social welfare minister , 48, is the sole woman in Nitish Kumar’s cabinet. But, more important, she belongs to the Kushwaha community, a factor she has determinedly used as a shield in the wake of the nationwide uproar over the serial sexual abuse case that has erupted on her watch and tarnished Kumar’s image as ‘sushasan babu’ or good administrator. Kushwahas account for 9 per cent of the state population, making them the third largest community in Bihar after Muslims and Yadavs. Verma, a two-time MLA from Begusarai, was quick to turn the demands for her resignation into a caste issue, saying she was being targeted because she belonged to a backward community. This reduced Kumar’s options further.",
"time_scraped": "2018-08-18 06:00:27.612857",
"article_id": "65321874",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65316374,imgsize-1147849,width-400,resizemode-4/65316374.jpg",
"path": "full/3f62bba525f991bd9e7d5d3e5e295e2ccaeb7031.jpg",
"checksum": "74110bea9747a50e69fd491843d6a4ff"
}
]
}