{
"source_article_link": "https://timesofindia.indiatimes.com/india/kerala-rains-pm-modi-speaks-with-kerala-cm-offers-assistance-to-those-affected/articleshow/65344152.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Kerala rains: PM Modi speaks with CM Pinarayi Vijayan, offers assistance to those affected",
"date_published": "2018-08-09T22:39:25+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65344168,imgsize-82009,width-400,resizemode-4/65344168.jpg"
],
"article_body": "NEW DELHI: Prime Minister Narendra Modi on Thursday spoke with Kerala chief minister in the wake of heavy rains and floods in the state, and offered all possible assistance to those affected. \"Spoke to Kerala CM Shri Pinarayi Vijayan and discussed the situation arising due to floods in various parts of the state. Offered all possible assistance to those affected. We stand shoulder to shoulder with the people of Kerala in the wake of this calamity,\" the PM said in a tweet. At least 22 people have died in the state due to incessant rainfall and flooding in the past two days, the home ministry said today. Minister of state for tourism KJ Alphons told the media earlier in the day that personnel from the the army, the navy and air force will reach Kerala shortly to assist in the rescue and relief operations. An inter-ministerial team of the central government is also visiting the flood-affected areas in Kerala, while army troops are being mobilised from Bengaluru for deployment in the rain-battered southern state. With water levels rising in various dams and reaching almost their maximum capacity, shutters of at least 22 reservoirs in Kerala have been opened to drain out excess water. Heavy rains for the past two days and release of water from the Idamalayar dam yesterday, resulted into localised flooding in low-lying areas in the northern districts of Kerala. The flood water also triggered landslides at some places.",
"description": "NEW DELHI: Prime Minister Narendra Modi on Thursday spoke with Kerala chief minister in the wake of heavy rains and floods in the state, and offered all possible assistance to those affected. \"Spoke to Kerala CM Shri Pinarayi Vijayan and discussed the situation arising due to floods in various parts of the state. Offered all possible assistance to those affected. We stand shoulder to shoulder with the people of Kerala in the wake of this calamity,\" the PM said in a tweet. At least 22 people have died in the state due to incessant rainfall and flooding in the past two days, the home ministry said today. Minister of state for tourism KJ Alphons told the media earlier in the day that personnel from the the army, the navy and air force will reach Kerala shortly to assist in the rescue and relief operations.",
"time_scraped": "2018-08-18 00:00:40.313333",
"article_id": "65344152",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65344168,imgsize-82009,width-400,resizemode-4/65344168.jpg",
"path": "full/e30e4e1bf0ab0a3a8c0d26b96a0e83a72df45eea.jpg",
"checksum": "99816ab8d9aa6bc71a3d976a4518fba6"
}
]
}