{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-us-in-touch-over-invite-to-donald-trump-sources/articleshow/65343361.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India, US in touch over invite to Donald Trump: Sources",
"date_published": "2018-08-09T21:42:12+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65343414,imgsize-182477,width-400,resizemode-4/65343414.jpg"
],
"article_body": "NEW DELHI: India and the US are in touch over New Delhi's invite to President to visit the country, and the date, time and occasion of the possible trip are under consideration, official sources said on Thursday. The sources indicated that India was not exclusively looking at his presence at the celebrations as the Chief Guest and that various other options are also being explored. \"The date, time and occasion of the visit is still under consideration,\" said an official source. India has extended an invitation to the US President to visit the country and the option of his gracing the Republic Day celebrations as the chief guest was explored during meetings between the two sides on the invite, it added. Last week, White House press secretary Sarah Sanders said that Trump has received an invitation to visit India, but no decision has been taken yet. \"I know that the invitation has been extended, but I do not believe that a final decision has been made,\" Sanders told reporters when asked whether PM Modi has invited Trump to be the Chief Guest at the next year's Republic Day celebrations in New Delhi. Prime Minister had invited President Trump for a bilateral visit to India during their talks in Washington in June 2017. If Trump accepts the invitation, it is expected to give a major boost to ties between the two strategic partners in key areas of defence, security and trade. The Trump administration has been pushing for deeper strategic cooperation with India, particularly in the Indo-Pacific region where China was expanding its influence. Every year, India invites world leaders to attend its Republic Day celebrations. In 2015, the then US President had attended it as the chief guest which was his second visit to India as American President. This year, leaders from 10 ASEAN countries had attended the Republic Day celebrations. In 2016, the then French President Francois Hollande was the chief guest of the parade while Japanese Prime Minister Shinzo Abe was the chief guest at the celebrations in 2014. The heads of state and government who have attended the Republic Day celebrations include Nicolas Sarkozy, Vladimir Putin, Nelson Mandela, John Major, Mohammed Khatami and Jacques Chirac.",
"description": "Sources indicated that India was not exclusively looking at his presence at the Republic Day celebrations as the Chief Guest and that various other options are also being explored Last week, White House press secretary Sarah Sanders said that Trump has received an invitation to visit India, but no decision has been taken yet",
"time_scraped": "2018-08-16 09:01:16.507097",
"article_id": "65343361",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65343414,imgsize-182477,width-400,resizemode-4/65343414.jpg",
"path": "full/14b3b221ef5bb381b36a467139bacdca9bd8eee6.jpg",
"checksum": "2275a8880861e7109fdf287964fad177"
}
]
}