{
"source_article_link": "https://timesofindia.indiatimes.com/india/rajya-sabha-passes-three-bills/articleshow/65343132.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Rajya Sabha passes three bills",
"date_published": "2018-08-09T21:23:03+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: The Rajya Sabha on Thursday passed three important Bills, completing their discussion, consideration and passage in a matter of three hours. While the (Prevention of Atrocities) Amendment Bill, 2018, saw a proper discussion and was unanimously passed by voice vote, noisy protests by Congress demanding a joint parliamentary committee (JPC) probe into Rafale deal marred the discussion and passage of and Homeopathy Central Council (Amendment) Bill. The Congress members stormed the well of House soon after passage of SC/ST Amendment Bill, with MP Anand Sharma first reminding the chair of his notice under Rule 273 to raise the Rafale ‘scam’. When Chairperson Venkaiah Naidu did not pay heed and proceeded with discussion on the National Sports University Bill, Congress members trooped into the well, shouting slogans in favour of their demand for a JPC probe. Venkaiah refused to adjourn the House despite the din and the discussion and voting on National Sports University Bill and Homeopathy Central Council (Amendment) Bill was conducted amid the sloganeering. Olympic medallist and boxing champion Mary Kom, a nominated MP since 2016, too struggled to speak in favour of the National Sports University Bill in the din. Venkaiah later reminded the MPs that the Congress had agreed to consideration and passage of the said Bills at the business advisory meeting in the morning. He added it was on the basis of consensus within BAC that he took up three bills, while a fourth Bill - the Insolvency and Bankrupty Code (Second Amendment) Bill — was not considered after Congress expressed some reservations. Soon after House reassembled post-lunch, the government took up discussion on SC/ST Amendment Bill. Congress leader Kumari Selja faulted the government for not bringing an ordinance earlier to nullify the Supreme Court order of March 20, 2018, that had introduced safeguards against arrest of public servants and others while also doing away with the ban on anticipatory bail for the accused. Selja criticised the decision of the government to appoint the judge who delivered the ‘anti-Dalit’ judgement to NGT. “This shows the anti-Dalit mentality of the government,” she said and pressed for bringing the amendments under Ninth Schedule. Social justice and empowerment minister Thaawar Chand Gahlot however said Prime Minister Narendra Modi had assured his government’s commitment to upliftment of SC/STs and had not acted under any “pressure” to restore the Act to its original form. He said 14 states had set up 195 special courts to decide cases relating to SC & ST Act. Earlier during the discussion, Kirori Lal Meena of BJP pressed for ending collegium system of appointing judges, while Ram Gopal Yadav of the SP wondered if the Supreme Court had become the third House of legislature after the Lok Sabha and Rajya Sabha, and was making laws. Sanjay Raut of the Shiv Sena, which was earlier criticised by Union minister Ram Vilas Paswan for opposing SC/ST Act amendment, said while people of Maharashtra, where B R Ambedkar was born, were fully with the Dalits, the Supreme Court would have reviewed the law only after it was convinced it was prone to misuse.",
"description": "NEW DELHI: The Rajya Sabha on Thursday passed three important Bills, completing their discussion, consideration and passage in a matter of three hours. While the (Prevention of Atrocities) Amendment Bill, 2018, saw a proper discussion and was unanimously passed by voice vote, noisy protests by Congress demanding a joint parliamentary committee (JPC) probe into Rafale deal marred the discussion and passage of and Homeopathy Central Council (Amendment) Bill. The Congress members stormed the well of House soon after passage of SC/ST Amendment Bill, with MP Anand Sharma first reminding the chair of his notice under Rule 273 to raise the Rafale ‘scam’. When Chairperson Venkaiah Naidu did not pay heed and proceeded with discussion on the National Sports University Bill, Congress members trooped into the well, shouting slogans in favour of their demand for a JPC probe. Venkaiah refused to adjourn the House despite the din and the discussion and voting on National Sports University Bill and Homeopathy Central Council (Amendment) Bill was conducted amid the sloganeering. Olympic medallist and boxing champion Mary Kom, a nominated MP since 2016, too struggled to speak in favour of the National Sports University Bill in the din.",
"time_scraped": "2018-08-19 06:00:17.830663",
"article_id": "65343132",
"article_category": "IndiaNews",
"image_details": []
}