{
"source_article_link": "https://timesofindia.indiatimes.com/india/monsoon-session-productivity-of-lok-sabha-118,-best-since-2000/articleshow/65359028.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Monsoon session: Lok Sabha records 118% productivity, best since 2000",
"date_published": "2018-08-10T23:00:09+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65359205,imgsize-72221,width-400,resizemode-4/65359205.jpg"
],
"article_body": "NEW DELHI: As many as 20 bills were passed by both Houses in the Monsoon Session of which concluded on Friday and the productivity of was 118 per cent, while that of 74 per cent. Parliamentary affairs minister termed the session a festival of social justice as a bill to give constitutional status to the OBC Commission and the Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Bill, were passed. The Monsoon Session had commenced on July 18 and it concluded today. Both Houses were adjourned sine die. The session provided 17 sittings spread over a period of 24 days. The productivity of Lok Sabha was 118 per cent and that of Rajya Sabha was 74 per cent, minister of state for parliamentary affairs Vijay Goel said. During the session, a motion of no confidence against the government was also defeated with a massive margin. Twenty-two bills -- 21 in the Lok Sabha and one in the Rajya Sabha -- were introduced. The Lok Sabha passed 21 bills and the Rajya Sabha passed 14 bills during the session. Twenty bills were passed by both the Houses of Parliament, the ministry said in a statement. This was an achievement considering that it was a short session of Parliament and a considerable time was devoted to discussions on issues of national importance and the election of the deputy chairman of Rajya Sabha to the office, it added. According to the PRS Legislative Research, it was the \"most productive\" for Lok Sabha since 2000. Time spent on legislative business in this session was the highest by both Houses in the 16th Lok Sabha and second highest since 2004, according to the think tank's data. Fewer bills (26 per cent) were referred to parliamentary committees, as compared to the 15th Lok Sabha (71 per cent) and the (60 per cent), the think-tank said. The Lok Sabha and the Rajya Sabha functioned for 84 per cent and 68 per cent of their scheduled Question Hour time respectively, the data said. The highest number of 999 private member bills were introduced in the Lok Sabha since 2000, it added. In the 16th Lok Sabha, the highest number of bills were introduced by the Ministry of Law and Justice and the Ministry of Health and Family Welfare. A statement from the Rajya Sabha Secretariat said the facility of simultaneous interpretation of the proceedings in all 22 languages listed in the Eighth Schedule to the Constitution was introduced in the session. During the session, it said, more than 27 hours were lost on issues such as demand for Special Category Status for Andhra Pradesh, issue of unaccounted deposits by Indians in banks in Switzerland, reported incidents of lynching in various parts of the country, final draft of the National Register of Citizen in Assam, reported harassment of girls at a shelter home in Uttar Pradesh's Deoria district, and the Rafael deal.",
"description": "NEW DELHI: As many as 20 bills were passed by both Houses in the Monsoon Session of which concluded on Friday and the productivity of was 118 per cent, while that of 74 per cent. Parliamentary affairs minister",
"time_scraped": "2018-08-17 06:00:20.342749",
"article_id": "65359028",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65359205,imgsize-72221,width-400,resizemode-4/65359205.jpg",
"path": "full/4516cf8e241af9ba44b7d771fbca8b5b7356f1d1.jpg",
"checksum": "f6be39898a193116915468f5a8adb84e"
}
]
}