{
"source_article_link": "https://timesofindia.indiatimes.com/india/india-afghanistan-highlight-chabahar-ports-importance-in-strengthening-trade-economic-ties/articleshow/65359440.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India, Afghanistan highlight Chabahar Port's importance in strengthening trade, economic ties",
"date_published": "2018-08-10T23:16:52+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65359458,imgsize-22878,width-400,resizemode-4/65359458.jpg"
],
"article_body": "KABUL: The viability of the strategic in as a route for trade and commerce was highlighted by India and Afghanistan, citing the role it played in the timely delivery of goods from India in the drought-hit areas of this year. The Chabahar Port, inaugurated in December last year, has opened a new strategic transit route between India, Iran and Afghanistan that bypassed . During the second meeting of India-Afghanistan Joint Working Group on Development Cooperation (JWG-DC) in Kabul yesterday, officials from the two countries underscored the importance of access through Chabahar Port for strengthening trade and economic relations. The Afghan side highly appreciated India's timely assistance of 170,000 tonnes of wheat and 2,000 tonnes of pulses this year when large parts of the country are suffering from drought, a press release from the ministry of external affairs said. Both sides expressed satisfaction that these largescale deliveries were made from India to Afghanistan via Chabahar, highlighting the viability of the Port as a route for trade and commerce. While India and Iran are signatories to the Chabahar Port development project, a second agreement on connectivity was also signed by India, Iran and Afghanistan. This pact allows Afghanistan to use thr Port to ship its goods to markets like India, thereby reducing its dependence on Pakistan and its Karachi port. During the JWG-DC meeting, India and Afghanistan discussed several ongoing development projects spread over varied areas of cooperation such as capacity building, infrastructure, education, healthcare, good-governance and human resource development. The JWG-DC is one of the four Joint Working Groups formed under the India-Afghanistan Strategic Partnership Council, which is headed by the external affairs minister of India and the foreign minister of Afghanistan. The Strategic Partnership Council is mandated for the overall management of the strategic relationship between India and Afghanistan. The two sides also expressed satisfaction over the successful completion of several development projects such as the Afghan Parliament building, Afghan-India Friendship Dam, the first phase of Chabahar Port and others.",
"description": "KABUL: The viability of the strategic in as a route for trade and commerce was highlighted by India and Afghanistan, citing the role it played in the timely delivery of goods from India in the drought-hit areas of this year. The Chabahar Port, inaugurated in December last year, has opened a new strategic transit route between India, Iran and Afghanistan that bypassed",
"time_scraped": "2018-08-21 06:00:14.363772",
"article_id": "65359440",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65359458,imgsize-22878,width-400,resizemode-4/65359458.jpg",
"path": "full/17919390e1af24afad7f78afe9ef50305a07a5a9.jpg",
"checksum": "69a4affc64093980ab1f65a8e6c75a5c"
}
]
}