{
"source_article_link": "https://timesofindia.indiatimes.com/india/rafale-biggest-ever-defence-scam-rahul-gandhi/articleshow/65358150.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Rafale 'biggest ever' defence scam: Rahul Gandhi",
"date_published": "2018-08-10T21:42:17+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65358201,imgsize-195980,width-400,resizemode-4/65358201.jpg"
],
"article_body": "RAIPUR: Congress president on Friday termed the as the country's \"biggest ever\" defence scam and alleged that Prime Minister Narendra Modi was a \"partner\" in the corruption. Addressing a party event here, he also said that Modi has not yet spoken a word on the rape incidents in Uttar Pradesh, Bihar and Rajasthan. He said the situation related to the condition of women has not been as bad in the \"last 3000 years\" and \"everybody is asking the BJP and the NDA where are 'acche din' (good days).\" The Congress leader said the promises made by Modi to farmers, youth and the poor people have remained unfulfilled. He also attacked the Prime Minister over the resignation of two journalists and alleged that \"those who try and bring the truth out are stifled.\" Rahul Gandhi was addressing Congress workers after inaugurating the newly-constructed office of the party's unit in the state which is slated to go to the polls later this year. Raking up the issue of the Rafale jet deal with France, Rahul alleged that it was the \"biggest ever\" corruption and \"the 'chowkidaar' (watchman) has been a 'bhagidaar'\". He was obviously referring to Modi who has been saying that in his position as the Prime Minister he is the country's 'chowkidaar'. India had signed an inter-governmental agreement with France in 2015 for procurement of 36 Rafale figher planes. \"The UPA government had readied the Rafale contract, according to which the price for each jet was approximately Rs 540 crore. The contract was ready and Modi ji only had to take a decision. \"But, Modi ji goes to France and scraps the previous contract and the defence minister and other cabinet ministers do not know about it,\" Gandhi said. \"Magically, the price of each Rafale jet shoots up from Rs 540 crore to Rs 1400 crore,\" he added. He maintained that the secrecy pact with France did not have any clause wherein the price of the jets could not be disclosed to the country. The Congress leader claimed that the contract was earlier given to state-owned Hindustan Aeronautics Limited (HAL) and Modi handed it over to \"his friend Anil Ambani\". \"The fun part is that the contract was given to Ambani ji, who has never made an aeroplane in his life nor has he ever taken a contract for defence,\" Gandhi said. \"The company, which was given the contract, was in a debt of Rs 45,000 crore,\" he claimed. Ambani has already rejected Rahul Gandhi's allegations and emphasised that the government had no role in the Rafale-manufacturer French company Dassault picking up his company as a local partner. He had written to Rahul Gandhi on December 12, 2017, refuting allegations of his Reliance Group lacking experience to get the Rafale fighter jet deal. He had written that Reliance Defence has the largest shipyard in the private sector at Pipavav in Gujarat and is currently building five Naval Offshore Patrol Vessels (NOPVs) for the Indian Navy and 14 Fast Patrol Vessels for the Indian Coast Guard. Invoking his family's \"respectful relationship\" with the Gandhi family over generations, Ambani had said he was \"personally saddened\" by the \"unfortunate statements\" against him and his group by several functionaries of the Congress party. Rahul Gandhi, while addressing the event today, said when he raised the Rafale issue in Parliament, the PM could not even look into his eyes. The Congress chief also raised the issue of rape incidents reported from various parts of the country. \"Women are being raped in Uttar Pradesh, Bihar and Rajasthan and despite the involvement of (some) BJP legislators, the \"56-inch chest\" Prime Minister does not speak a word over these incidents,\" Gandhi said. \"Today, women are scared of even going out of their homes. The situation has not been so bad in the last 3000 years,\" he said. He said that when the NDA government came to power four years back, Modi promised \"acche din\" but the slogan has been forgotten now. \"One after the other, promises are being broken ... People trusted your (Modi's) words but their trust is being broken one after the other,\" he said. \"Modi ji says Congress has not done anything in its 70-year-rule but in the four-year rule of BJP government, the women are scared of even stepping out of their homes,\" he said. Rahul Gandhi claimed that a union minister has \"conceded\" that putting Rs 15 lakh in bank accounts was just an election 'jumla' (slogan) and that it was just a ploy to fool the people. \"Recently, Gadkari ji asked where is employment. Gadkari ji, we are asking this question and crores of youth are also asking. You have to answer us not ask us questions,\" he said. \"Now they don't talk about employment but talk about making 'pakodas',\" the Congress leader said. Gandhi also attacked Chhattisgarh chief minister Raman Singh once again over his son's name allegedly appearing in the Panama Papers. \"Even Pakistan's (former) prime minister (Nawaz Sharif) has been jailed for the same reason but no action has been taken in the case of Abhishek Singh,\" he said. \"I know it must be pricking you that the money which could have been used to repair colleges and install computers, has been put in some bank by Raman Singh's son,\" he said.",
"description": "RAIPUR: Congress president on Friday termed the as the country's \"biggest ever\" defence scam and alleged that Prime Minister Narendra Modi was a \"partner\" in the corruption. Addressing a party event here, he also said that Modi has not yet spoken a word on the rape incidents in Uttar Pradesh, Bihar and Rajasthan. He said the situation related to the condition of women has not been as bad in the \"last 3000 years\" and \"everybody is asking the BJP and the NDA where are 'acche din' (good days).\"",
"time_scraped": "2018-08-21 00:00:11.500191",
"article_id": "65358150",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65358201,imgsize-195980,width-400,resizemode-4/65358201.jpg",
"path": "full/da34e4b7f12b32663029f17c40a68d6051e1a9f2.jpg",
"checksum": "ca9a58b31918aa81dc2c478fa4b75337"
}
]
}