{
"source_article_link": "https://timesofindia.indiatimes.com/india/lok-sabha-churns-out-most-productive-monsoon-session-since-2000/articleshow/65360312.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Lok Sabha churns out most productive monsoon session since 2000",
"date_published": "2018-08-11T11:32:14+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65360319,imgsize-204350,width-400,resizemode-4/65360319.jpg"
],
"article_body": "NEW DELHI: With the government agreeing to the contentious no-confidence motion moved by the Telugu Desam Party early on, the saw the most productive monsoon session since 2000, one that ended on Friday with the passage of amendments to the law that empowered homebuyers in insolvency cases. The amendments seek to replace the June 6 ordinance that places homebuyers as “financial creditors” on a par with banks. Data compiled by shows that 18 of 20 bills introduced during the session were passed. The LS worked for 110% of the scheduled hours and the Rajya Sabha for 66%.   The Lok Sabha and the Rajya Sabha spent 50% and 48% of their time on legislative business, respectively, the data said. This is the highest by both Houses in the 16th Lok Sabha and the second-highest since 2004. Among significant legislations, granting constitutional status to the National Commission for Backward Classes and restoring the immediate arrest provision in the SC/ST Act are a major political gain for the ruling party, which has been facing flak on Dalit issues. Fewer bills (26%) were referred to parliamentary committees as compared to the 15th Lok Sabha (71%) and the (60%) — a fallout of the Modi government’s big majority. The Lok Sabha sat for over 20 hours beyond the scheduled time to make up for over eight hours lost in disruptions. The session has also been one of the most productive for question hours in the 16th Lok Sabha. The Lok Sabha and the Rajya Sabha functioned for 84% and 68% of their scheduled question hour time. As many as 999 private member bills, the most since 2000, were introduced, PRS said. In the 16th Lok Sabha, so far the most government bills have been introduced by the ministry of law and justice and the ministry of health and family welfare. In the 15th Lok Sabha, the highest number of bills were introduced by the ministry of finance, ministry of home affairs and ministry of law and justice. “I have several times laid stress on the conduct of the House which is essential to maintain credibility of Parliament,” Lok Sabha Speaker Sumitra Mahajan said after she adjourned the House sine die on Friday. “The session was more productive and satisfactory compared to the past two other productive sessions — the second part of budget session 2017 and the last monsoon session,” she said. Rajya Sabha chairperson M said the session proved to be about three times more productive than the budget session, whose productivity was only about 25%. “This is a remarkable improvement and the credit goes to all,” he said. The House discussed the supplementary demands for grants (general) and demands for excess grants (general) for 2015-16 and the approved the relevant appropriation bills.",
"description": "The Lok Sabha saw the most productive monsoon session since 2000 The LS worked for 110% of the scheduled hours and the Rajya Sabha for 66% Data compiled by PRS Legislative Research shows that 18 of 20 bills introduced during the session were passed",
"time_scraped": "2018-08-17 06:00:20.483993",
"article_id": "65360312",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65360319,imgsize-204350,width-400,resizemode-4/65360319.jpg",
"path": "full/ce17981560f292cb17539ee4e8f5df3c292e4478.jpg",
"checksum": "4fd062a3cc8e790d7bdf30722f3536af"
}
]
}