{
"source_article_link": "https://timesofindia.indiatimes.com/india/tough-policy-for-international-students-in-us/articleshow/65360658.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Tough policy for international students in US",
"date_published": "2018-08-11T10:02:42+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65360656,imgsize-128782,width-400,resizemode-4/65360656.jpg"
],
"article_body": "MUMBAI: in the US will find the going tougher after the final policy guidelines were published by the US government. Starting August 9, students and their dependants will automatically begin to accrue unlawful presence in the US the day after they violate their “student status” even if the period of stay granted has not expired. The new policy reverses the prior rules under which the clock to calculate unlawful presence began to tick from the day the violation was found or an immigration judge passed an order. The tweaked policy has serious repercussions as individuals who accrue over 180 days of unlawful presence before they leave the US can be barred from re-entry for three to 10 years. After the Chinese, Indians are the largest group of foreign students in the US. International student data from the Open Doors Report (2017) shows that there are 1.86 lakh Indian students in the US. Unlawful presence can be triggered by various reasons, not just overstay. It could kick in, for instance, if a student does not meet the minimum number of hours per week the educational institution determines is necessary for completion of their study programme (this is referred to as falling below a full course of study). It can also be triggered in cases of unauthorised employment or overstaying in the US beyond the grace period available after completion of study. There is a slight relaxation as compared to the draft policy, as covered by TOIin its edition of May 14. Under the revised final policy memorandum, international students who fall out of status and timely file (within five months) for reinstatement of that status will have their accrual of unlawful presence suspended while the application is pending. If the reinstatement application is denied, the accrual of unlawful presence resumes on the day after the denial, said an official USCIS statement. Cyrus D Mehta, New Yorkbased immigration attorney and managing partner of a law firm, explained to TOIthat the improvement (over the draft guidelines) is insignificant, especially for a student who may have unknowingly violated his/her status earlier. If this is discovered many years later, the accrual will be from the day of violation and the student could find himself or herself debarred from entering the US. Rajiv S Khanna, managing attorney of Immigration.com, gave TOI a live illustration. “One example of unknowing violation of student status is where the educational institute commits errors in entering information into the SEVIS system (data base to be maintained for foreign students). We had a case where a student authorised to work on campus was the victim of such inaccuracy, where the university authorities wrongly entered the work hours, thus reflecting that he had put in more hours than he was allowed to...” Mehta added: “Students in practical training can also be found to have violated status if their training is later found to have not been consistent with their degree, and STEM students under will be even more in jeopardy if they work at third-party sites and the authorities find that they were not adequately supervised.” Khanna pointed out that even errors made by the USCIS can land a student in trouble. “Once students finish their coursework and exhaust their 60 days grace period (available to students on F-1 visa), they start accruing unlawful presence, even if the USCIS has made an error in adjudication of their further applications, such as for optional practical training. An appeal against such errors takes months and the student may find himself barred from entering the US for several years, destroying his or her career,” explains Khanna. Mehta concludes by saying that the new policy will violate due process rights of students as they will suffer severe consequences for perceived status violations for which they were not given timely warning or notice.",
"description": " Starting August 9, students and their dependants will automatically begin to accrue unlawful presence in the US the day after they violate their “student status”  The new policy reverses the prior rules under which the clock to calculate unlawful presence began to tick from the day the violation was found or an immigration judge passed an order",
"time_scraped": "2018-08-19 06:00:10.340316",
"article_id": "65360658",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65360656,imgsize-128782,width-400,resizemode-4/65360656.jpg",
"path": "full/6112d0e070891461dd0fdc374614add2e18aa76b.jpg",
"checksum": "f9e63d1b54265201c7c32db6ad05a27e"
}
]
}