{
"source_article_link": "https://timesofindia.indiatimes.com/india/gau-rakshak-among-3-held-in-maha-for-plotting-bomb-blasts/articleshow/65360681.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Gau rakshak among 3 held in Maha for plotting bomb blasts",
"date_published": "2018-08-11T03:33:33+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "MUMBAI: Barely five days before Independence Day, ATS arrested three persons, including two from Nalasopara, on Friday for plotting bomb blasts to disturb communal harmony and having links with terrorist organisations. Twenty bombs and bombmaking materials were found in a bungalow in the northern suburb. Vaibhav Raut, 40, a gau rakshak with the Hindu Govansh Raksha Samiti, and his associate Sharad Kalaskar, 25, were detained in Nalasopara late on Thursday. Sudhanav Ghondalekar, 39, who claims to be a businessman, was nabbed in Pune and brought to Mumbai. The opposition Congress said Raut has been associated with the Sanatan Sanstha for long and shared dais with Sanatan leaders, and called for the group to be declared a terrorist organisation. The state junior home minister said it was too early to link Raut and the others to any organisation as the ATS has not completed its probe, but they will be probed for links with the murders of Narendra Dabholkar, and M M Kalburgi. “We have booked all three accused for criminal conspiracy under the IPC, having association with a terrorist gang or organisation under UAPA, and other laws,” said Atulchandra Kulkarni, state ATS chief. “We got information that a group was planning to carry out bomb blasts to disturb communal harmony,” an officer said.",
"description": "MUMBAI: Barely five days before Independence Day, ATS arrested three persons, including two from Nalasopara, on Friday for plotting bomb blasts to disturb communal harmony and having links with terrorist organisations. Twenty bombs and bombmaking materials were found in a bungalow in the northern suburb. Vaibhav Raut, 40, a gau rakshak with the Hindu Govansh Raksha Samiti, and his associate Sharad Kalaskar, 25, were detained in Nalasopara late on Thursday. Sudhanav Ghondalekar, 39, who claims to be a businessman, was nabbed in Pune and brought to Mumbai. The opposition Congress said Raut has been associated with the Sanatan Sanstha for long and shared dais with Sanatan leaders, and called for the group to be declared a terrorist organisation. The state junior home minister said it was too early to link Raut and the others to any organisation as the ATS has not completed its probe, but they will be probed for links with the murders of Narendra Dabholkar, and M M Kalburgi.",
"time_scraped": "2018-08-19 00:44:11.423844",
"article_id": "65360681",
"article_category": "IndiaNews",
"image_details": []
}