{
"source_article_link": "https://timesofindia.indiatimes.com/india/manned-mission-isro-to-hold-2nd-test-of-reusable-launch-vehicle-next-year/articleshow/65377953.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Manned mission: Isro to hold 2nd test of reusable launch vehicle next year",
"date_published": "2018-08-12T22:59:52+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65378981,imgsize-575547,width-400,resizemode-4/65378981.jpg"
],
"article_body": "NEW DELHI: In a bid to fulfil its dream of the manned mission,() is gearing up for the second demonstration test of the(RLV) next year. However, this time, the RLV will be tested on an airstrip and not on the sea.Isro chairmansaid, \"We will conduct an RLV test sometime next year where a helicopter will take the vehicle to a height of 3 km and from that height, it will be dropped. The RLV will then glide and land on an airstrip.\"Isro conducted the first demonstration test of India's winged body aerospace vehicle on May 23, 2016. A solid rocket booster carrying RLV-TD lifted off fromand coasted to a height of 56km. At that height, RLV-TD separated from HS9 booster and further ascended to a height of 65km and then started its descent and successfully glided down to the defining landing spot over the Bay of Bengal.Sivan said, \"The third experiment will include testing the RLV from the orbit. The vehicle will be integrated into a new rocket, which will take it up to the orbit. There, the vehicle will get detached and re-entre the earth's atmosphere and land.\"The RLV technology is just one but significant part of India's manned mission programme. There are other technologies too like \"pad-abort\" (human capsule which will get detached from the rocket if any untoward incident happens) which the space agency has to develop for the manned mission.Once Isro has mastered the RLV technology, it will also be able to cut down the launch vehicle cost to 10 per cent of the original price.",
"description": "NEW DELHI: In a bid to fulfil its dream of the manned mission,() is gearing up for the second demonstration test of the(RLV) next year. However, this time, the RLV will be tested on an airstrip and not on the sea.Isro chairman",
"time_scraped": "2018-08-16 01:32:59.152297",
"article_id": "65377953",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65378981,imgsize-575547,width-400,resizemode-4/65378981.jpg",
"path": "full/780359fc704cbc620df41a71d2992a46076dd845.jpg",
"checksum": "50bb6901c64c1d2a41bafc9eea9a107a"
}
]
}