{
"source_article_link": "https://timesofindia.indiatimes.com/india/774-dead-in-monsoon-rain-floods-in-7-states/articleshow/65378513.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "774 dead in monsoon rain, floods in 7 states",
"date_published": "2018-08-12T22:56:13+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65378906,imgsize-247952,width-400,resizemode-4/65378906.jpg"
],
"article_body": "NEW DELHI: As many as 774 people have died in incidents related to floods and rains in seven states during the so far, the said on Sunday. According to the home ministry's National Emergency Response Centre (NERC), 187 people have lost their lives in Kerala, 171 in Uttar Pradesh, 170 people in West Bengal and 139 in Maharashtra due to the floods and rain. As many as 52 people lost their lives in Gujarat, 45 in Assam and eight in Nagaland. A total of 27 people were also missing in Kerala (22) and West Bengal (5), while 245 others received injuries in rain-related incidents in the states. The deluge and rains have hit 26 districts in Maharashtra, 23 in Assam, 22 in West Bengal, 14 in Kerala, 12 in Uttar Pradesh, 11 Nagaland and 10 in Gujarat. In Assam, 11.45 lakh people have borne the brunt of the rains and floods, which also hit crops in 27,552 hectres of land. Altogether 15 teams of the National Disaster Response Force (NDRF) are engaged in rescue and relief operations in Assam, the NERC said. A team of the NDRF comprises 45 personnel. Eight NDRF teams were deployed in Uttar Pradesh, eight in West Bengal, seven in Gujarat, four each in Kerala and Maharashtra and one in Nagaland.",
"description": "NEW DELHI: As many as 774 people have died in incidents related to floods and rains in seven states during the so far, the said on Sunday. According to the home ministry's National Emergency Response Centre (NERC), 187 people have lost their lives in Kerala, 171 in Uttar Pradesh, 170 people in West Bengal and 139 in Maharashtra due to the floods and rain. As many as 52 people lost their lives in Gujarat, 45 in Assam and eight in Nagaland.",
"time_scraped": "2018-08-19 03:00:37.383287",
"article_id": "65378513",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65378906,imgsize-247952,width-400,resizemode-4/65378906.jpg",
"path": "full/e0dc1f5054484c88503268c296a35cd8f772ab93.jpg",
"checksum": "92246e2b3c408f21dde03a751f7ad3d1"
}
]
}