{
"source_article_link": "https://timesofindia.indiatimes.com/india/on-poll-drive-rahul-accuses-pm-of-committing-theft-in-rafale-deal/articleshow/65370989.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "On poll drive, Rahul accuses PM of committing ‘theft’ in Rafale deal",
"date_published": "2018-08-12T04:48:35+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "JAIPUR: Launching the party’s election campaign in pollbound Rajasthan on Saturday, Congress president accused Prime Minister of committing a “theft” in the Rafale aircraft deal. Targeting Modi on issues related to youths, farmers, women, SC/ST, minorities and small businessmen, he made poll promises like introducing single-slab GST and bringing petrol/diesel under this new tax system if the Congress was voted to power in 2019 parliamentary elections. Rahul’s speech hinted that in the upcoming poll, BJP would use the Rafale deal to target BJP the same way as the latter had used the Bofors gun deal to attack Congress. His speech also suggested that Congress would focus on direct attacks on Modi, just as BJP had been training its guns on him (Rahul) more. His “road show” earlier in the day witnessed a large turnout of youths in a city that is considered to be BJP’s bastion. Involving the youths with the Rafale deal, Rahul said Modi had deprived them of job opportunities. “The aircraft will now be made in France. The benefit that the country and the youths would have got will now go to Modi’s friend, who is under a debt of Rs 45,000 crore,” Rahul said, naming industrialist as the beneficiary of the deal. “You do not get work because your name is not Anil Ambani,” he said. Making blunt attacks on the PM,Rahul said, “In response to media questions, the (then) defence minister ( ) had said that he did not make changes in the Rafale deal, the PM did. The deal that the UPA finalised for Rs 520 crore per aircraft has been changed by Modi to Rs 1,600 crore apiece.” The Congress president targeted Rajasthan chief minister Vasundhara Raje too on the job issue. “Your CM claims she gave jobs to lakhs of people but you know the truth behind her claims. She promised 24-hour electricity supply but people are getting it just for five hours,” he said.",
"description": "JAIPUR: Launching the party’s election campaign in pollbound Rajasthan on Saturday, Congress president accused Prime Minister of committing a “theft” in the Rafale aircraft deal. Targeting Modi on issues related to youths, farmers, women, SC/ST, minorities and small businessmen, he made poll promises like introducing single-slab GST and bringing petrol/diesel under this new tax system if the Congress was voted to power in 2019 parliamentary elections. Rahul’s speech hinted that in the upcoming poll, BJP would use the Rafale deal to target BJP the same way as the latter had used the Bofors gun deal to attack Congress. His speech also suggested that Congress would focus on direct attacks on Modi, just as BJP had been training its guns on him (Rahul) more. His “road show” earlier in the day witnessed a large turnout of youths in a city that is considered to be BJP’s bastion. Involving the youths with the Rafale deal, Rahul said Modi had deprived them of job opportunities. “The aircraft will now be made in France. The benefit that the country and the youths would have got will now go to Modi’s friend, who is under a debt of Rs 45,000 crore,” Rahul said, naming industrialist",
"time_scraped": "2018-08-21 00:00:13.116157",
"article_id": "65370989",
"article_category": "IndiaNews",
"image_details": []
}