{
"source_article_link": "https://timesofindia.indiatimes.com/india/sunil-gavaskar-to-skip-imran-khans-oath-taking/articleshow/65370861.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Sunil Gavaskar to skip Imran Khan’s oath-taking",
"date_published": "2018-08-12T08:23:49+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65371558,imgsize-85052,width-400,resizemode-4/65371558.jpg"
],
"article_body": "MUMBAI: Batting legend Sunil Gavaskar has said that he will not attend Pakistan’s World Cup-winning captain Imran Khan’s oath-taking ceremony as the PM on August 18. Imran has also invited former India cricketers and for the function. Both, it’s learnt, have accepted Imran’s invitation and are awaiting government’s clearance to go for the event. Imran and Gavaskar faced each other on the ground several times during the 1970s and 80s as the captains of their respective teams, and have been good friends over the years. Speaking to ‘India Today’, Gavaskar confirmed that he had spoken to Khan, who had invited him for his oath-taking. “Yes, I did speak to Imran. He was enquiring if I’d be able to make it. I told him that because of my commentary commitments, I will not be able to do so. But my best wishes are with him,” he said. Apparently, Gavaskar has a contractual commitment with Sony Pictures Network India, which is telecasting the ongoing India-England series. After the Lord’s Test, he will be in England for the last three Tests to be played at Trent Bridge, The Ageas Bowl and The Oval. “I’ve known him for plenty of years. It’s a huge moment for the cricketing fraternity that one of them has gone on to become the PM of a country, so I wish him very well,” Gavaskar said. “He is the only PM (of Pakistan) who has actually spent a lot of time in India. He is probably the only Pakistani after partition who has been to India several times, has met with the common man apart from all the dignitaries and therefore understands India better than any other Pakistan PM. Therefore, I’m hoping that with that kind of understanding, he will have an outlook towards India perhaps different from the other PM,” he said. Meanwhile, Kapil Dev and Navjot Singh Sidhu have accepted Imran’s invitation to attend his oath-taking. Sidhu, currently a Punjab minister, has more than three decades of association with Imran as a cricketer and commentator. The former India opener said that he received the invite in personal capacity. “Khan Saab even called me up, inviting for the event on Friday,” Sidhu told TOI.",
"description": " Sunil Gavaskar has said that he will not attend Imran Khan’s oath-taking ceremony as the PM on August 18 Gavaskar won't be attending owing to commentary commitments.",
"time_scraped": "2018-08-17 06:00:39.371667",
"article_id": "65370861",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65371558,imgsize-85052,width-400,resizemode-4/65371558.jpg",
"path": "full/751514df05d980f40f4320894d14b67e20633b73.jpg",
"checksum": "462d952b46eda27f071165f73791388a"
}
]
}