{
"source_article_link": "https://timesofindia.indiatimes.com/india/delhi-cs-assault-case-chargesheet-against-arvind-kejriwal-manish-sisodia-and-11-aap-mlas/articleshow/65387081.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Delhi CS assault case: Chargesheet against Arvind Kejriwal, Manish Sisodia and 11 AAP MLAs",
"date_published": "2018-08-13T20:28:03+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: The Delhi police have filed a chargesheet against chief minister , deputy chief minister and 11 MLAs in connection with a case of alleged assault on Delhi chief secretary . The 11 legislators include Amanatullah Khan, Prakash Jarwal, Nitin Tyagi, Rituraj Govind, Sanjeev Jha, Ajay Dutt, Rajesh Rishi, Rajesh Gupta, Madan Lal, Parveen Kumar and Dinesh Mohania. Additional public prosecutor Atul Srivastava, who appeared before the court in February when the complaint was filed, had argued that the alleged assault on Prakash was an “unfortunate and shameful” incident in which the senior-most officer of the state was criminally intimidated and assaulted by the MLAs. \"The alleged assault happened at the chief minister's residence where 11 MLAs had held a meeting with Prakash. We say 'Atiti Devo Bhava' where guests should be honoroubly treated, but treat them like this? (sic)\" submitted Srivastava. The prosecutor added that the bureaucrat was forced to \"consent on a certain thing\" during the meeting. \"He was intimidated and assaulted by two people. He had also sustained injuries. The injured areas - both ears - show tenderness and mild swelling. There are bruises too,\" asserted Srivastava. The prosecutor also argued that both the accused had threatened to falsely implicate the chief secretary and have filed a frivolous complaint against him. Srivastava pointed out the accused had criminal antecedents. Prakash was allegedly assaulted during a meeting at Kejriwal's official residence on February 19. The police said the chief minister was present when the alleged assault took place. The police had already questioned the 11 MLAs present at the chief minister's residence for the meeting. Two of the party MLAs -Amantullah Khan and Prakash Jarwal - were arrested in the case. The police have booked the MLAs under sections 186/323/332/342/353/504/506(ii)/120B/109/114/149/34 and 36 of the IPC. ",
"description": "Kejriwal and Sisodia are among 13 AAP leaders who have been booked by the police in the assault case Prosecutor Atul Srivastava had argued that the alleged assault on Prakash was an “unfortunate and shameful” incident Prakash was allegedly assaulted during a meeting at Kejriwal's official residence on February 19",
"time_scraped": "2018-08-19 03:00:43.346434",
"article_id": "65387081",
"article_category": "IndiaNews",
"image_details": []
}