{
"source_article_link": "https://timesofindia.indiatimes.com/india/jnu-student-umar-khalid-survives-attack-outside-delhis-constitution-club-attacker-escapes/articleshow/65385813.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "JNU student leader Umar Khalid attacked in Delhi, escapes unhurt",
"date_published": "2018-08-13T19:58:42+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: Some unidentified men targeted JNU student leaderand gunshots were heard at the Constitution Club near Parliament today, but he escaped unhurt, police said.Joint commissioner of police Ajay Chaudhary confirmed that Khalid was attacked at a tea stall outside the Club.\"We were at a tea stall when a man came and attacked us with a pistol. This was in the heart of Delhi. I don't know who those people were. I appeal to the police to investigate the matter,\" Umar Khalid was quoted as saying by news agency ANI.\"A man attacked Umar from behind while he and his associates were having tea at a stall. Khalid fell down as a result. He is safe now. We are investigating the matter,\" Chaudhary said.District commissioner of police, Madhur Verma said that the police is trying to verify Khalid's claim.\"It is being verified. He said that he was attacked. Somebody pounced on Umar Khalid and pushed, thereafter he tried to fire at Khalid. But the person immediately couldn't fire. People started chasing him thereafter according to Khalid the attacker fired in the air,\" Verma was quoted as saying by ANI.Witnesses claimed that two shots were fired when Khalid was at the entrance of the club.The student leader was at the venue to attend an event titled '', organised by 'United Against Hate'.\"We had gone to have tea when three people came towards us. One of them got hold of Khalid which he resisted,\" said Saifi, who was accompanying Khalid at the time of the attack.\"There was a melee as a gunshot was heard, but Khalid was not injured. While the accused were fleeing, they fired one more shot,\" the eyewitness added.Khalid said that the attack on him is an attempt to silence the anti-government voices.\"There is an atmosphere of fear in the country and anybody who speaks against the government is threatened.\"The Jawaharlal Nehru University Students' Union called the attack as a \"culmination of the hate-filled propaganda spewed by the Modi government\" against Khalid and all those who have questioned the regime.\"It is with grave concern that we wish to stand in complete solidarity with Umar Khalid. Today, an unidentified man opened fire on him. We see this cowardly act as a culmination of the hate-filled propaganda that this Modi government has spewed against Umar, JNU students and all those voices who have questioned this regime,\" the JNUSU said in a statement.Former chief minister of Jammu and Kashmir Omar Abdullah said that the attack is \"direct result\" of \"relentless hate campaign\" on media.Khalid, along with Kanhaiya Kumar and Anirban Bhattacharya, was arrested in February 2016 on charges of sedition in connection with the controversial event in which alleged anti-India slogans were raised at an event.",
"description": "Umar Khalid was at the venue to attend an event titled 'Khauff Se Azaadi', organised by an organisation named 'United Against Hate'Khalid, along with Kanhaiya Kumar and Anirban Bhattacharya, was arrested in February 2016 on charges of sedition",
"time_scraped": "2018-08-16 01:33:35.365796",
"article_id": "65385813",
"article_category": "IndiaNews",
"image_details": []
}