{
"source_article_link": "https://timesofindia.indiatimes.com/india/kerala-floods-claim-39-lives-top-developments/articleshow/65381979.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Kerala floods claim 39 lives: Top developments",
"date_published": "2018-08-13T14:20:34+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65382031,imgsize-164291,width-400,resizemode-4/65382031.jpg"
],
"article_body": "* Water level in the, recorded at 5 am on Monday, was 2397.94 feet. The Full Reservoir Level of the dam is 2403 feet.* As per the latest reports on Monday morning, the death toll stood at 39.* The National Disaster Management Authority (NDMA) had on Sunday warned that heavy to very heavy rains were expected in 16 states, including Kerala, till tomorrow.* The weather department has issued a 'Red alert', asking people to be cautious as there was a possibility of heavy to very heavy rainfall in most places in Idukki, Wayanad, Kannur, Ernakulam, Palakkad and Malappuram districts.* Union home minister, who conducted an aerial survey of the flood-affected areas along with chief ministeron Sunday evening, said that the situation in the state is 'very serious'.* Following the survey, the minister announced an immediate relief of additional Rs 100 crores for the state.* The chief minister submitted a memorandum to the visiting Union minister Singh seeking Rs 8,316 crore as a special package for dealing with the situation arising from unprecedented floods following heavy monsoon rains.* External affairs minister Sushma Swaraj announced that passports damaged in floods in Kerala will be replaced free of cost by the government.* CM Vijayan assured the affected people that they need not worry as the state government will do everything to ensure them relief. \"Every loss that has been suffered will be addressed, including loss of houses, other properties and crops. Once you return to your homes, you will face a lot of problems. Necessary steps will be taken to clean up your homes,\" he said.* Officials in Ernakulam and Thrissur said that the flood situation was under control even as parts of both districts still remained submerged. The Periyar river water level had come down to enable some of the affected persons to return home, they said.* Ten columns of the Army, a unit of Madras Regiment along with personnel of the Navy, Air Force and NDRF are engaged in relief and rescue work in badly-hit districts, including Kozhikode, Idukki, Malappuram, Kannur and Wayanad, Defence sources said.* DMK Working President MK Stalin announced Rs one crore flood relief to the Kerala government, on behalf of his party and expressed his condolences to the bereaved families.",
"description": "Kerala has been witnessing one of the worst floods since 1924. Union home minister Rajnath Singh, who conducted a survey of the state yesterday, described the situation as something never witnessed by the state since Independence. So far at least 39 people have been killed and thousands of people have been accommodated in relief camps set up in different areas",
"time_scraped": "2018-08-16 01:32:53.533538",
"article_id": "65381979",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65382031,imgsize-164291,width-400,resizemode-4/65382031.jpg",
"path": "full/d73640ff4c3d561e1f327367c46b3e4c2ff26e7c.jpg",
"checksum": "46d33ba73668f3b6e802914790ec6558"
}
]
}