{
"source_article_link": "https://timesofindia.indiatimes.com/india/report-claims-chinese-firm-won-contract-to-print-indian-currency-congress-questions-govt/articleshow/65385328.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Report claims Chinese firm won ‘contract’ to print Indian currency; Congress questions govt",
"date_published": "2018-08-14T09:45:52+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: The Congress today sought a clarification from the government following a report published in South China Morning Post claiming that has been given the license to print Indian currency notes, along with notes of several other nations. Congress leader Shashi Tharoor asked Union ministers, Arun Jaitley and Piyush Goyal, to clarify. \"If true, this has disturbing national security implications. Not to mention making it easier for Pak to counterfeit,\" he tweeted as quoted another tweet carrying the SCMP report.   The report, published by South China Morning Post, claims that China Banknote Printing and Minting Corporation has been running to full capacity, despite registering a fall in the local demand owing to a rise in mobile payments in the recent years. The report quoted the president of the China Banknote Printing and Minting Corporation, Liu Guisheng as saying that his company won contracts for printing currency notes of a number of countries, including Thailand, Bangladesh, Sri Lanka, Malaysia, Brazil, Poland and India. A major portion of these currency notes, the report claimed, are from other nations. So much so the Chinese currency makes a small portion of the currency notes being processed inside the state-owned currency printing company, which describes itself as the world's largest money printer. The company started the process of printing foreign currency notes in 2013, close on the heels of the inauguration of its ambitious belt and road plan, which aims to establish an economic corridor across 60 countries from Asia, Europe to Africa. The report further claimed that the actual number of countries, who have given a contract to the company to print their currency notes, may be much larger. \"But that could be just the tip of the iceberg,\" it read. It was this report, which prompted Congress leaders to accuse the government of compromising with the security of the nation today. Congress spokesperson Randeep S Surjewala asked if it is part of China's design to engulf Southeast Asia.  ",
"description": "A report has claimed that China Banknote Printing and Minting Corporation has won a contract to print Indian currency notes Congress leader Shashi Tharoor sought a clarification from Union ministers Congress leader Randeep S Surjewala asked if it is part of China's design to engulf Southeast Asia",
"time_scraped": "2018-08-20 18:00:50.752569",
"article_id": "65385328",
"article_category": "IndiaNews",
"image_details": []
}