{
"source_article_link": "https://timesofindia.indiatimes.com/india/just-27-of-judges-in-lower-courts-women-reveals-study/articleshow/65380343.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Just 27% of judges in lower courts women, reveals study",
"date_published": "2018-08-13T05:53:40+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65380343,width-400,resizemode-4/65380343.jpg"
],
"article_body": "NEW DELHI: Out of the 16,600 judges in district and subordinate courts across the country, less than 4,500 are women. Legal think tank released data which showed that out of 16,660 judges in lower courts, only 4,487 were women, or 27%. The figure was 11% in high courts and 9% in the SC, the think tank said. Citing , TOI had reported in January that Other Backward Classes comprised just 12% of judges in the lower judiciary. Speaking at a conference on judicial diversity organised by Vidhi Centre, former Law Commission chairman Justice A P Shah said on Saturday that there was a “marked bias” when it came to choosing between a man and woman of equal merit for judgeship. Almost invariably, the man was selected, he added.  Justice Shah, who retired as chief justice of Delhi HC, said once he had recommended a woman advocate for elevation to HC judgeship but she was rejected for being “rude”. “Similar behaviour from a male counterpart would not have induced a similar judgment from selection body,” he said. “The discourse on judiciary today is dominated by questions of case pendency, backlog and delay. Representativeness of judiciary as an institution remains somewhere in background, surfacing when a ‘minority’ candidate’s name is suggested for appointment,” he said. He said diversity as a policy issue had never received the attention it deserved from the higher judiciary, perhaps explained by the fact that in 68 years, the SC had only once elevated a woman from the bar, in January.",
"description": "NEW DELHI: Out of the 16,600 judges in district and subordinate courts across the country, less than 4,500 are women. Legal think tank released data which showed that out of 16,660 judges in lower courts, only 4,487 were women, or 27%. The figure was 11% in high courts and 9% in the SC, the think tank said. Citing , TOI had reported in January that Other Backward Classes comprised just 12% of judges in the lower judiciary.",
"time_scraped": "2018-08-20 03:00:13.405854",
"article_id": "65380343",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65380343,width-400,resizemode-4/65380343.jpg",
"path": "full/3ac1dd8408b917a46d86815c99d5fd5facf11681.jpg",
"checksum": "9e77d3c261a69c859698483bc2ae839c"
}
]
}