{
"source_article_link": "https://timesofindia.indiatimes.com/india/al-qaeda-ideologically-inclined-to-carry-out-attacks-in-india-un-report/articleshow/65396199.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Al-Qaida 'ideologically inclined' to carry out attacks in India: UN report",
"date_published": "2018-08-14T17:12:03+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65396305,imgsize-283111,width-400,resizemode-4/65396305.jpg"
],
"article_body": "UNITED NATIONS: Al-Qaida in the Indian Subcontinent (AQIS), the terror group's newest affiliate, is \"ideologically inclined\" to carry out attacks inside India but its capability is believed to be low and is relatively isolated owing to increased security measures in the region, according to a UN report. The 22nd report of the Analytical Support and Sanctions Monitoring Team was submitted to the UN Security Council al-Qaida Sanctions Committee here. The report said that AQIS is \"relatively isolated owing to increased security measures within the wider region, but the group continues to seek security gaps for opportunistic attacks. The group is \"ideologically inclined to carry out attacks inside India but its capability is believed to be low, it said, adding that according to Member States, the strength of AQIS in Afghanistan is estimated at several hundred people, located in Laghman, Paktika, Kandahar, Ghazni and Zabul provinces. Noting that al-Qaida still maintains a presence in South Asia, the report said the terror group adapts to the local environment, trying to embed itself into local struggles and communities and is closely allied with the Taliban. According to one Member State, although the Islamic State in Iraq and the Levant (ISIL), also known as ISIS, poses an immediate threat, al-Qaida is the intellectually stronger group and remains a longer-term threat. The report added that some members of the al-Qaida core, including Aiman al-Zawahiri and son of slain al-Qaida terrorist , are reported to be in the Afghanistan-Pakistan border areas. Other members of the al-Qaida core may leave for more secure areas, it said. The report said that between 20,000 and 30,000 Islamic State fighters remain in Iraq and Syria and among these there is still a significant component of the many thousands of active foreign terrorist fighters. One Member State reports that some recent plots detected and prevented in Europe had originated from ISIL in Afghanistan. In addition to establishing a presence across Afghanistan, ISIL also attempts to have an impact on other countries in the region. \"According to one Member State, ISIL in Afghanistan is responsible for at least one attack in the Kashmir region, the report said. However, no details about the attack in Kashmir were given in the report. The sanctions monitoring team submits independent reports every six months to the Security Council on the Islamic State, al-Qaida and associated individuals, groups, undertakings and entities. The report added that in Afghanistan, ISIL persistently tried to expand its presence, despite pressure from the Afghan National Defence and Security Forces, the international coalition and the Taliban. ISIL currently has its main presence in the eastern provinces of Kunar, Nangarhar and Nuristan, and is also active in Jowzjan, Faryab, Sari Pul and Badakhshan provinces in the north. The group has the intention to expand into Ghazni, Kunduz, Laghman, Logar and Uruzgan provinces. In Kabul, Herat and Jalalabad, ISIL already has sleeper cells and has committed disruptive, high-profile attacks, including against both Government and Taliban targets during the Eid al-Fitr ceasefire, it added. The report noted that that ISIL has between 3,500 and 4,000 members in Afghanistan, including between 600 and 1,000 in northern Afghanistan (with both numbers on the increase). It is led by Abu Sayed Bajauri who is not listed and the majority of its members and leaders were formerly members of Tehrik-e Taliban Pakistan and it may represent an emerging threat to Central Asian States.",
"description": "The report said that some members of the Al-Qaida core, including Aiman al-Zawahiri and Hamza bin Laden are reported to be in the Afghanistan-Pakistan border areas Noting that Al-Qaida still maintains a presence in South Asia, the report said the terror group is \"ideologically inclined to carry out attacks inside India but its capability is believed to be low",
"time_scraped": "2018-08-20 21:00:37.437211",
"article_id": "65396199",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65396305,imgsize-283111,width-400,resizemode-4/65396305.jpg",
"path": "full/3fe08bf00d1ff626d6a90369fd930779a5ef969a.jpg",
"checksum": "ca2b25c38215bde238a7824eca807a73"
}
]
}