{
"source_article_link": "https://timesofindia.indiatimes.com/india/attack-on-umar-khalid-culmination-of-hate-filled-propaganda-by-modi-government-jnusu/articleshow/65390033.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Attack on Umar Khalid culmination of hate-filled propaganda by Modi government: JNUSU",
"date_published": "2018-08-13T19:47:14+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: The Jawaharlal Nehru University Students' Union called the attack on its leadertoday as a \"culmination of the hate-filled propaganda spewed by the\" against him and against all those who have questioned this regime.Some unidentified men targeted Khalid at Constitution Club in the high security area near Parliament and gunshots were heard, but he escaped unhurt, according to eyewitnesses, even as the police asserted it will verify the incident.\"It is with grave concern that we wish to stand in complete solidarity with Umar Khalid. Today, an unidentified man opened fire on him. We see this cowardly act as a culmination of the hate-filled propaganda that this Modi government onwards has spewed against Umar,students and all those voices who have questioned this regime,\" thesaid in a statement.In the new India, mob lynching and attacks on common people have become the norm and cow vigilantes are being given impunity which has further aggregated these incidents, they said.\"From the JNUSU, we would like to make it clear that no voice can be curbed and the students movement will continue to produce fearless voices. We also demand that the Delhi Police take appropriate action against those conspirators behind this attack. In this need of hour, we shall unconditionally stand by Umar Khalid and demand speedy justice,\" they said in the statement.",
"description": "NEW DELHI: The Jawaharlal Nehru University Students' Union called the attack on its leadertoday as a \"culmination of the hate-filled propaganda spewed by the\" against him and against all those who have questioned this regime.Some unidentified men targeted Khalid at Constitution Club in the high security area near Parliament and gunshots were heard, but he escaped unhurt, according to eyewitnesses, even as the police asserted it will verify the incident.\"It is with grave concern that we wish to stand in complete solidarity with Umar Khalid. Today, an unidentified man opened fire on him. We see this cowardly act as a culmination of the hate-filled propaganda that this Modi government onwards has spewed against Umar,",
"time_scraped": "2018-08-16 01:33:34.477391",
"article_id": "65390033",
"article_category": "IndiaNews",
"image_details": []
}