{
"source_article_link": "https://timesofindia.indiatimes.com/india/sc-to-hear-tns-plea-against-ngt-order-giving-vedanta-limited-access-to-tuticorin-plant/articleshow/65397238.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "SC to hear TN's plea against NGT order giving Vedanta limited access to Tuticorin plant",
"date_published": "2018-08-14T11:52:48+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65397511,imgsize-137032,width-400,resizemode-4/65397511.jpg"
],
"article_body": "NEW DELHI: The Supreme Court today agreed to hear on August 17 the plea of government challenging an order of the National Green Tribunal allowing mining major Vedanta access to the administrative unit inside its closed copper plant at Tuticorin in the state. A bench comprising Chief Justice and Justice A M Khanwilkar considered the submission of the state government and posted its plea for hearing on August 17. The NGT had on August 9 allowed Vedanta to enter its administrative unit inside its Sterlite copper plant, observing that no environmental damage would be caused by allowing access to the administrative section. The tribunal, however, had said that the plant would remain closed and the company would not have access to its production unit and directed the district magistrate to ensure this. The Tamil government had, on May 28, ordered the state pollution control board to seal and \"permanently\" close the mining group's copper plant following violent protests over pollution concerns. Sterlite's factory had made headlines in March 2013 when a gas leak led to the death of one person and injuries to several others, after which then chief minister J had ordered its closure. The company had then appealed to the NGT, which had overturned the government order. The state had then moved the Supreme Court against it and the case is still pending. The Supreme Court had then ordered the company to pay Rs 100 crore as compensation for polluting the environment. Following the latest protests and police firing, the plant was closed on March 27. After Sterlite announced its plans to expand the Tuticorin plant, villagers around it started fresh protests that continued for over 100 days, culminating in the May 22 police firing on protestors that claimed 13 lives and left scores injured.",
"description": "NEW DELHI: The Supreme Court today agreed to hear on August 17 the plea of government challenging an order of the National Green Tribunal allowing mining major Vedanta access to the administrative unit inside its closed copper plant at Tuticorin in the state. A bench comprising Chief Justice and Justice A M Khanwilkar considered the submission of the state government and posted its plea for hearing on August 17.",
"time_scraped": "2018-08-21 03:00:38.128075",
"article_id": "65397238",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65397511,imgsize-137032,width-400,resizemode-4/65397511.jpg",
"path": "full/19537ae996a3169fc972724128d6e4dac5827a9a.jpg",
"checksum": "7b7ac9badadea648a6793345797f1045"
}
]
}