{
"source_article_link": "https://timesofindia.indiatimes.com/india/signs-of-joy-autistic-disabled-attend-independence-day-celebration-at-red-fort/articleshow/65413306.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Signs of joy: Autistic, disabled attend Independence Day celebration at Red Fort",
"date_published": "2018-08-15T15:30:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65413372,imgsize-813065,width-400,resizemode-4/65413372.jpg"
],
"article_body": "NEW DELHI: Several sign language instructors moved their hands up and down as Prime Minister'saddress to the nation from the historicprogressed. Students with disabilities cheered and smiled. All of them were excited.Nearly 120 persons with disabilities, including a number of children from schools and NGOs, sat patiently in the lawns of the 17-century monument, listening to Modi's address with help from the women instructors.They were at the Red Fort to listen to their prime minister on the 72nd Independence Day.And the prime minister ensured his address had words for his special guests. He mentioned the rights of the disabled and a common sign language dictionary prepared for them by the government.The First Indian Sign Language Dictionary of 3,000 words was launched in March. It was developed by Indian Sign Language Research & Training Centre.Throughout the over 80-minute address of Modi, the instructors stood facing the disabled people in an enclosure marked for them. They ensured Modi's message reached them in a language they understood comfortably.The instructors, with their back against the Red Fort, were there under the government's 'Sugamya Bharat' initiative, which aims to serve the differently-able community.New Delhi-based Pt.National Institute For Persons with Physical Disabilities, an autonomous organisation under the administrative and financial control of the Ministry of Social Justice & Empowerment, had facilitated the visit of the 120 people, a senior official said.Sanskriti Bhatia, programme manager at Sai Swayam Society, a non-profit organization, was among the four people who interpreted the prime minister's speech.Bhatia said she \"meaningfully interpreted\" the prime minister's address and not literally, to make the visitors understand it better.Asked, how difficult it was to hear the speech from behind and interpret it simultaneously, Tanu Tomar, another instructor, said, \"It was not difficult at all.\"\"We made the sign gestures for various emotions like pride, honesty, patriotism and nationalism an they cheered when Modiji talked about people with disabilities,\" she said.\"The youths, aged 13-18, came from schools run by Deendayal Upadhyaya institute, and a couple of NGOs. They were really excited to be a part of the event and cheered in their own language,\" an official of the institute said.\"Most of them who attended the celebration are speech-impaired or hearing-impaired. Some of them are autistic or have bone disorder,\" the official said.",
"description": "NEW DELHI: Several sign language instructors moved their hands up and down as Prime Minister'saddress to the nation from the historicprogressed. Students with disabilities cheered and smiled. All of them were excited.Nearly 120 persons with disabilities, including a number of children from schools and NGOs, sat patiently in the lawns of the 17-century monument, listening to Modi's address with help from the women instructors.",
"time_scraped": "2018-08-16 01:33:53.250710",
"article_id": "65413306",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65413372,imgsize-813065,width-400,resizemode-4/65413372.jpg",
"path": "full/a135963cc763ecf42e1d8a57c8ca1099f53f85af.jpg",
"checksum": "6dd9e28df82bb31b115d711442d3b552"
}
]
}