{
"source_article_link": "https://timesofindia.indiatimes.com/india/atal-bihari-vajpayee-critical-put-on-life-support-system-aiims/articleshow/65416356.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Atal Bihari Vajpayee critical, put on life support system: AIIMS",
"date_published": "2018-08-15T22:42:10+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65416442,imgsize-116910,width-400,resizemode-4/65416442.jpg"
],
"article_body": "NEW DELHI: Former Prime Ministeris critical and on full life support. His condition has sharply deteriorated in the last 24 hours,said this in a statement issued late in the night on Wednesday, hours after Prime Minister Narendra Modi visited the ailing BJP stalwart.Modi reached the hospital at around 7.15pm. He spent around 10 minutes meeting the treating doctors and inquiring about Vajpayee’s health and left thereafter. Textiles minister Smriti Irani had also visiting the ailing BJP stalwart in the afternoon.Vajpayee was admitted to AIIMS on June 11 with kidney tract infection, chest congestion and his urine output being on the lower side. Sources said his condition is critical. He is on ventilator support and a team of doctors are constantly monitoring his condition in the ICU at CN tower where he is admitted. Vajpayee, a diabetic, has one functional kidney. He suffered a stroke in 2009, weakening his cognitive abilities. Later, he developed dementia.Vajpayee was thrice elected the prime minister between 1996 and 1999 and is the only non-Congress prime minister to complete the full term of five years, from 1999 to 2004.As his health deteriorated, he had slowly withdrawn himself from public life and was confined to his residence for years.",
"description": "Vajpayee was admitted to AIIMS on June 11 with kidney tract infection, chest congestion and his urine output being on the lower side. Sources said his condition is critical. He is on ventilator support and a team of doctors are constantly monitoring his condition in the ICU at CN tower where he is admitted.",
"time_scraped": "2018-08-16 01:33:17.962167",
"article_id": "65416356",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65416442,imgsize-116910,width-400,resizemode-4/65416442.jpg",
"path": "full/e1036f9f18a5dbd7518ff5b221bf5cdf5692c9c0.jpg",
"checksum": "857b7ee818ae622fe08511112340cd17"
}
]
}