{
"source_article_link": "https://timesofindia.indiatimes.com/india/london-police-returns-stolen-12th-century-buddha-statue-to-india-on-i-day/articleshow/65414251.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "London Police return stolen 12th century Buddha statue to India on I-Day",
"date_published": "2018-08-15T21:38:21+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65414224,imgsize-144247,width-400,resizemode-4/65414224.jpg"
],
"article_body": "LONDON: A 12th century bronze Buddha statue stolen from a museum at Nalanda in Bihar nearly 60 years ago was returned to India on Wednesday by the London's Metropolitan Police as part of a ceremony here to mark India's Independence Day.The bronze statue with silver inlay is one of the 14 statues stolen in 1961 from the Archaeological Survey of India (ASI) site museum in Nalanda and changed several hands over the years before surfacing at a London auction.Once the dealer and the owner were made aware the sculpture was the same one that had been stolen from India, the Metropolitan Police said they cooperated with the Met's Art and Antiques Unit and agreed for the piece to be returned to India.The statue was identified at a trade fair in March this year by Lynda Albertson of the Association for Research into Crimes Against Art (ARCA) and Vijay Kumar from the, who then alerted the police.returned the statue stolen to the Indian High Commissioner to the UK, YK Sinha, as part of a ceremony to mark Independence Day at India House in London today.\"I am delighted to return this piece of history. This is an excellent example of the results that can come with close cooperation between law enforcement, trade and scholars,\" said Met police detective chief inspector Sheila Stewart, who was accompanied by officials from the UK's Department for digital, culture, media and sport at the handover ceremony.\"Although this was stolen over 50 years ago, this did not prevent the piece being recognised and the credit must go to the eagle eye informants who made us aware that the missing piece had been located after so many years,\" she said.Sinha described the return of the \"priceless Buddha\" as a \"wonderful gesture\" and a particular honour given his own roots in Bihar.\"I hope it will now go back to where it originally belongs ... On our Independence Day, it (return of the statue) highlights the multi-faceted cooperation between our two countries,\" he said, after a Tricolour-hoisting ceremony to mark India's 72nd Independence Day at the Indian High Commission in London.Detective constable Sophie Hayes of the Met's Art and Antique Unit said it had been established that there was no criminality by the current owner or the dealer who had been offering the stolen statue for sale.\"Indeed, from the outset they have cooperated fully with the police to resolve this matter and they have made the decision to return the sculpture via the police,\" Hayes said.\"We are delighted to be able to facilitate the return of this important piece of cultural heritage to India,\" she added.The Art and Antiques Unit was founded 50 years ago and is one of the oldest specialist units in the. The unit prides itself on a \"long history of reuniting owners with their stolen property\".Michael Ellis, UK minister for arts, heritage and tourism, said: \"As we celebrate India's Independence Day, I am proud to highlight the latest example of the UK's cultural diplomacy in action. Thanks to the work of the Metropolitan Police's Arts and Antiques Unit, we are one of the first countries to recover one of the 14 elusive Buddha statues stolen from Nalanda nearly 60 years ago.\"\"This underlines how law enforcement and the London art market are working hand in hand to deliver positive cultural diplomacy to the world\".",
"description": "The bronze statue with silver inlay is one of the 14 statues stolen in 1961 from the Archaeological Survey of India (ASI) site museum in Nalanda The statue was identified at a trade fair in March this year by Lynda Albertson of the Association for Research into Crimes Against Art and Vijay Kumar from the India Pride Project, who then alerted the police",
"time_scraped": "2018-08-16 01:33:13.989227",
"article_id": "65414251",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65414224,imgsize-144247,width-400,resizemode-4/65414224.jpg",
"path": "full/9794af7735c6079087d4516b04c86562c5a17b2b.jpg",
"checksum": "88bbb028d47922aacc686866759a1cbe"
}
]
}