{
"source_article_link": "https://timesofindia.indiatimes.com/india/the-tale-of-ins-khukri-and-its-brave-captain-mahendra-nath-mulla/articleshow/65412495.cms",
"title": "The tale of INS Khukri, and its brave Captain, Mahendra Nath Mulla",
"date_published": "2018-08-15T17:22:13+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65412777,imgsize-58639,width-400,resizemode-4/65412777.jpg"
],
"article_body": "BENGALURU: As India celebrates its 72nd Independence Day, here’s a tale of extraordinary courage and selflessness.It’s a tale that has been told before, but there is now more information about theand its Captain, Mahendra Nath Mulla, who died with the ship during the 1971 Indo-Pakistan war.Commodore (retd) SN Singh, one of the survivors of the tragedy, recalls it was 8.45pm on December 9, right after Akashvani broadcast that two torpedoes from PNS Hangor had hit the ship. Mulla realised the ship could not be saved and gave the command to abandon ship. Six officers and 61 men survived that fateful night. 18 officers and 178 men died. The most poignant moment for those who survived was the sight of the 45-year-old Capt Mulla on the bridge, puffing his cigarette as the ship went down. Embracing the best of naval traditions, Mulla chose not to save himself.A TOI report dated Dec 11, 1971, titled 'Captain goes down after saving shipmates' says, \"Many of the younger, inexperienced sailors preferred the false security of the sturdy steel deck of the frigate below their feet to the unknown dangers lurking in the bosom of the sea. There was no confusion, no panic because the Captain's calm transmitted itself to the men.\"Major General (retd) Ian Cardozo in his book, 'The Sinking of INS Khukri: Survivors’ Stories,' recounts how Mulla exhorted and ensured everyone left the ship. He gave away the last life jacket on board – his own – to a young sailor and said, \"Go on, save yourselves, do not worry about me.\"Despite this, many drowned when they were caught in the whirlpool (suction) created by the sinking ship.Mulla’s act, however, had a worriedsend out an order to all its officers, \"While the highest traditions of a Captain going down with his ship are fully appreciated, the Royal Navy cannot afford to lose experienced commanding officers. They are, therefore, to endeavour to save themselves so that they may live to fight another day.\"After INS Kukhri went down, many stories said that Capt Mulla did not make wise decisions; that his staff was not prepared.However, Commodore (retd) SN Singh, who was then a 20-year-old midshipman, dismisses these stories. \"It is ridiculous to say we were not prepared or we were exhausted. We were on high alert and ready for combat. We had just left Bombay Harbour on December 7th evening after a couple of days of rest. We were on 'action stations relaxed,’ when the torpedo hit us,\" he says.Some naval experts, including Major Cardoza in his book, have wondered whether INS Khukri was hit because it was travelling at 12 knots an hour, while INS Kirpan travelling at 14 knots an hour and in a zigzag pattern was better able to evade torpedoes. Cardoza recounts, \"Lieutenant VK Jain, a bright electrical officer, who had researched on an attachment to improve the sonar performance of the 170/174 set on board. It is known that Captain Mulla did not favour this slow speed, but had to give in to this young officer's request.\"But research now shows neither INS Khukri nor INS Kirpan stood a chance against Pakistan's French Daphne subs with a sonar detection range of 25,000 yards. “Jain was trying to improve the sonar detection capability of the vessel. There was no time for him to experiment at length. The vessel had a detection capability of only 1,500 yards; whereas the Pak submarine, because it’s silent under the ocean, would have been able to hear the approaching ship's engine from as far off as 30 nautical miles. So it was imperative for them to improve their sonar capability,\" says Cdr (retd) Allan Rodrigues, anexpert, who has commanded three warships, including INS Himgiri.And on the decision of Commander Rishi Raj Sood of INS Kirpan to leave and rescue survivors 14 hours later, Rodrigues says, \"He would have been a sitting duck had he chosen to remain behind. He didn't have a fighting chance unless he was able to detect the sub. He'd have been fighting in the dark – the Pak sub would have noted the ship's arrival long before the ship was able to detect the sub. It was a prudent decision to go back and come with reinforcements for the search and rescue operations – or it would have been a horrendous loss of life for INS Kirpan too.\"Naval experts point to the fact that Pakistan was already well-versed in the art of submarine warfare, having bought its first subs in the early 1960s. India waited till 1968 before making its first purchase from the Soviet Union and started operating a sub fleet as late as 1970. Frigates like Khukri had little in the way of operational experience against the French subs, when they set out for battle in 1971.One of the ways to counter the ships' limited sonar range – between 1,500-2,500 yards (detection range is affected by temperature, pressure and salinity of the deep seas) – was to send out helicopters with dunking sonars ahead to ensure the safety of the ship that followed. \"Khukri and Kirpan were not supported by available anti-sub aircraft assets at the time of attack. That evening, two Sea King helicopters with dunking sonars forced PNS Hangor to remain passive. They, however, departed at the end of their sortie, and returned to shore base. PNS Hangor, realising that the Sea Kings had departed, attacked,\" says Mumbai-based lawyer and military and naval historian, Rabindra Hazari.This gap in the Indian Navy has been noted. In 'Transition to Triumph,’ Vice Admiral (retd) GM Hiranandani quotes 'The Story of the,’ to describe the movements of the Pak sub: \"At 1915 PNS Hangor went to action stations. Fifteen minutes later she came up to periscope depth but could see nothing in the dark night, as her periscope radar was only 9,800 metres. The ships were completely darkened. Commanding Officer Ahmed Tasnim decided to go down to 55 metres depth and make a sonar approach for the final phase of the attack. Unaware of the submarine’s presence the frigates continued on their track. PNS Hangor fired. The torpedo was tracked but no explosion was heard. A second torpedo was fired. After five tense minutes a tremendous explosion was heard. The torpedo had found its mark.\"Capt Mulla's daughter Ameeta Mulla Wattal also tries to deal with this question in her contribution to Cardozo's book: \"I have often wondered what made my father decide to go down with his ship. Did he want his name to be enshrined in history books as a man of valour? Did he do it because it was part of an old archaic naval tradition or did he accompany his ship to the womb of the sea, because he felt it was the right thing to do?\"Fellow officers tell us the tale of a man who was brave, inured to hardship, and with an iron will. Commodore Singh recounts his steely calm in the face of tragedy. \"He was our infallible Captain, a man we were all proud of.\"Late Surgeon Commander Dr EJ Job, Mulla’s neighbour in Navy Nagar, Colaba, and then serving on INS Vikrant, in his letters home recounts how he never used to take medication. One of his principles was that the body should get acclimatised to hardship. And Dr Job would joke, \"You are going to drive us all out of business.\"Something that Mulla’s wife Sudha (80) also remembers. \"He believed strongly in self-control and his attitude to pain was unbelievable. I once accompanied him to a dentist, when a troublesome tooth had to be removed. The dentist was a young and inexperienced naval dental officer. My husband refused the painkilling injection. The dental officer struggled a great deal to remove the tooth and discovered to his horror, after he had removed it, that he had removed the wrong tooth. I was furious, but Mahendra did not get angry and told the dentist to go ahead and get on with the job of removing the bad tooth, this too without a painkiller. So two teeth were removed without any painkillers and he bore the pain without flinching. The person most affected by this whole episode was the dentist. Mahendra calmly walked out and went to work as if nothing happened.\"In the last few minutes before he died, Capt Mulla would have known he wouldn’t be the only one among his men to meet that fate. He knew his men were trapped. Men like Commander and engineer MO Oomen, who was last seen rushing to take up his position at the engine room. Men like Lt VK Jain, who was last seen going down to get red and blue colour pencils to plot courses on a chart to illustrate the working range of his improved sonar. Men like Lt Commander and specialist communication officer JK Suri, who was last seen going below deck to fetch more life jackets for the crew.\"When you call out action station, the ship is in full readiness for combat. Every single man would be at his post. For the sailors and technical crew, this would have been the lower decks of the ship, below the waterline, where the engines and machinery are located. When the torpedo hits, it usually would hit just below the waterline, and the chances of survival for those in the lower decks would be much less than those above. No sailor would dare say this aloud but they would be thinking, \"It's easy for you. You are on the bridge.\" But they never do, because they trust their captain. That is why captains choose to stay back with the ship. It’s on their conscience. He ordered those men to go below deck. Captains are trained never to forsake their men,\" says Rodrigues.Commodore Singh recalls that the last sight he remembers from that night was his Captain still on duty, still on the bridge.\"What Capt Mulla did that fateful day has had an enormous and positive impact on the service he loved and on the men who continue to serve it to this day,” says Rodrigues. “It reminds every one of us chosen to command of the qualities of leadership needed under duress, and of the ultimate responsibility we have to the families of the men we command. You never forsake your men, you never leave a man behind.\"In Mulla’s daughter Ameeta's words, \"On December 9, 1971, when his ship was hit, he spared no effort in getting as many sailors and officers to the safety of the lifeboats and the sea. And when he had done his duty he took the decision to go down with his ship. I suppose he saw himself as the master of a ship hundreds of years ago, nurtured by the traditions of the sea that required him to stay with his vessel. Not because it was the right thing to do, nor because it was expected of him, but because knowing him as I did, it was the only thing to do.\"",
"description": "On December 9, 1971, two torpedoes from Pakistani ship hit INS KhukriMahendra Nath Mulla, the Captain of INS Khukri, realised the ship could not be saved and gave the command to abandon the vesselSix officers and 61 men survived that fateful night. 18 officers and 178 men died",
"time_scraped": "2018-08-16 01:32:29.389229",
"article_id": "65412495",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65412777,imgsize-58639,width-400,resizemode-4/65412777.jpg",
"path": "full/531d50de78af231127405ec9f4bcb6682249a390.jpg",
"checksum": "d181610ffd75fde84557ef16be8243e4"
}
]
}