{
"source_article_link": "https://timesofindia.indiatimes.com/india/heres-why-rampur-in-up-is-the-worst-city-to-live-in/articleshow/65417522.cms",
"title": "Here’s why Rampur in UP is the worst city to live in",
"date_published": "2018-08-16T02:54:14+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417550,imgsize-156046,width-400,resizemode-4/65417550.jpg"
],
"article_body": "RAMPUR: There are no city buses, no waste disposal site, the local hospital can’t handle emergencies, schools are without textbooks, and power supply is erratic. Rampur’s residents have long said it is a city in name only, and now the Centre has made it official. “We stand vindicated. We have always said it can’t get worse than this elsewhere in India,” Lakshya Saxena, a 25-year-old sales executive, told TOI afterfinished last among 111 cities in the Ease of Living Index 2018 that was released by the ministry of housing and urban affairs (Mo-HUA) on Monday.Rampur’s 3.25 lakh residents throw about 165 tonnes, or 20 truckloads, of garbage daily. Some of it is dumped in Ghatampur village nearby, and the rest rots on streets and in drains because there is no waste management facility. “We were promised that Rampur municipality will generate electricity from waste. We have waste everywhere but no electricity,” said Syed Amir Mian, an advocate.Chief sanitation officer and food inspector TPS Verma blamed Rampur’s insanitary conditions on severe staff shortage. “According to a government order of 1991, there should be 28 sweepers for a population of 10,000. However, we have only 199 sweepers against the 355 permanent posts, and 170 against the 534 contractual posts. We have had to outsource the cleaning in 21 of 43 wards.”The district hospital is working at half strength as well. There are 13 doctors against 27 sanctioned posts who see more than 4,000 out-patients every day. In the women’s ward, two patients often share a bed. The hospital does not have specialists like cardiologist, neurologist, skin specialist and ENT, so, at times, “we have no option but to refer patients to medical colleges in Meerut and Aligarh,” chief medical superintendent Dr B MNagar said.No government or private hospital in the city has an MRI machine. Education is a textbook case, too. At the Kasturba residential school in Loha, TOI found a student sweeping classrooms. “If sweepers are absent, students clean classrooms,” head teacher Yogita Rathore said. The adjoining primary school boasts of English-medium instruction but does not have electricity. It has two classrooms for 147 students, and no benches.Classes I and II, and IV and V have been merged while Class III students sit in the verandah. Textbooks are awaited. With no city buses, Rampur’s public transport is made up of tempos and autos—less than 50 each—and 350 e-rickshaws. Shahnaz Begum, a housewife and resident of Civil Lines, said, “It’s difficult to commute without your own vehicle.”While assistant regional transport officer Arun Kumar said there is a proposal to introduce CNG-operated Tempos in the city, there is no timeframe for it. More than a car or bike, Rampur residents need power backup at home because outages of 5-6 hours are routine. Power theft from overhead lines is also rampant, and the unpaid bills add up to Rs 35 crore.The electricity department is laying underground cables to stop power theft, but executive engineer Sachin Kumar Singh said some residents have been resisting this. “In the past six months, we have received over 10 cases of locals trying to stop underground cabling work.” The department and police have lodged 478 FIRs and collected Rs 15.6 lakh in fines from raids since April 14. While chief development officer S K Singh refused to comment on the city index, district magistrate Mahendra Bahadur Singh said, “We will aim to be among the top 50 cities.”",
"description": "Some of the garbage is dumped in Ghatampur village nearby, and the rest rots on streets and in drains because there is no waste management facilityThe district hospital does not have specialists like cardiologist, neurologist, skin specialist and ENTNo government or private hospital in the city has an MRI machine",
"time_scraped": "2018-08-16 05:27:00.277895",
"article_id": "65417522",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417550,imgsize-156046,width-400,resizemode-4/65417550.jpg",
"path": "full/eefa668178f1e54eafad804c1f67aba20fedb363.jpg",
"checksum": "667aa4ae2b9d95363494de31da2c8de4"
}
]
}