{
"source_article_link": "https://timesofindia.indiatimes.com/india/dont-destroy-weaken-the-system-but-transform-it-cji-dipak-misra/articleshow/65412677.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Don't destroy, weaken the system but transform it: CJI Dipak Misra",
"date_published": "2018-08-15T14:24:25+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65412766,imgsize-345043,width-400,resizemode-4/65412766.jpg"
],
"article_body": "NEW DELHI: Chief Justice of India on Wednesday said that it was easy to criticise, attack and destroy a system but instead an endeavour should be made to transform and reform it. \"There may be some elements who try to weaken the institution,\" but the judiciary will refuse to succumb, Chief Justice Misra said in an apparent reference to discordant voices coming from within the top judiciary and outside. Mishra made the statement while speaking at the function organised in the by the . Referring to the mention of \"polity of identity\" in law minister 's speech at the event, Chief Justice Misra said: \"I am happy that the law minister has talked about the identity of the citizens. This identity has to be founded on the idea of humanism which is fundamentally constitutional and legitimate. \"How far we follow this path only the future will tell.\" Prasad called for striking a healthy balance between the three organs of the state saying that the governance of the country must be left to the elected representatives as governance and accountability go together. The law minister while recalling the trauma of partition, said that despite large-scale destruction and dislocations, India chose not to be theocratic. Referring to the different phases of development over last seven decades, the law minister said initially it was a \"polity of want, then came polity of identity and now we have polity of aspiration and hope\".",
"description": "NEW DELHI: Chief Justice of India on Wednesday said that it was easy to criticise, attack and destroy a system but instead an endeavour should be made to transform and reform it. \"There may be some elements who try to weaken the institution,\" but the judiciary will refuse to succumb, Chief Justice Misra said in an apparent reference to discordant voices coming from within the top judiciary and outside. Mishra made the statement while speaking at the function organised in the",
"time_scraped": "2018-08-17 06:00:16.624750",
"article_id": "65412677",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65412766,imgsize-345043,width-400,resizemode-4/65412766.jpg",
"path": "full/c620f49651b3b1ecd15adeea8cc126858964d65b.jpg",
"checksum": "f659aad42ce643b13fcfad316e4a31e9"
}
]
}