{
"source_article_link": "https://timesofindia.indiatimes.com/india/state-councils-blame-mci-for-mess-in-data-on-doctors/articleshow/65417837.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "State councils blame MCI for mess in data on doctors",
"date_published": "2018-08-16T05:48:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417836,imgsize-81080,width-400,resizemode-4/65417836.jpg"
],
"article_body": "NEW DELHI: Several State Medical Councils have expressed shock at the Medical Council of India (MCI) submitting outdated and wrong data to Parliament year after year. According to the officebearers of these councils, they have been sending updated lists to the MCI but do not see it reflected in the Indian Medical Register (IMR). Maintaining the IMR is one of the fundamental and statutory duties of the MCI. While the MCI told TOI the state councils were to blame for not regularly sending information on registered doctors to it, most state councils refuted this allegation. In the case of Karnataka, for instance, the MCI data submitted to Parliament recently showed 1.04 lakh doctors registered. The data MCI gave TOI also said the state council had not submitted any data in 2015 or 2016. However, the state council insisted it has been submitting data every quarter. The Medical Council started the process of re-registration of doctors every five years in 2013 and after renewal had about 123,436 doctors in the registry as of March 2018, nearly 20,000 more than the MCI data shows. “It is disrespect to Parliament to not make any effort whatsoever to give the latest data and not even explain to Parliament that the data being submitted has not been updated,” said KMC president, Dr H Veerbhadrappa. The Medical Council (MMC) has not only done the process of reregistration of doctors every five years, the entire list of 86,567 doctors registered with it is available on the council’s website. “We have the most modern system. The revalidated data has been shared with the MCI, but it is still not reflected in the IMR,” said MMC president Dr Shivkumar S Utture. The MCI data shows 1.59 lakh doctors in Maharashtra, nearly twice as many as the state council’s number. The MCI responded to the state councils’ claims by insisting the Karnataka figures it had put out were correct and that in Maharashtra’s case the state council had submitted no data for 2016 and data in a “wrong format” for 2017 only this month. It said, “as per the office records, we assure you that no wrong information has been submitted to the parliament.” Since Karnataka and Maharashtra have a large number of medical colleges, they have many out-of-state students registering with these councils immediately after completing MBBS. But then they take no objection certificates (NOC) and go to their respective states. The NOCs issued are tracked and the names are removed from the register. “Even office-bearers of the Medical Council that registers all doctors in , who have sent their details to the MCI so many times find their names have not yet been included in the IMR. Then you can imagine just how well they are maintaining the database,” pointed out Dr VG Pradeep Kumar, vice-president of the council.",
"description": "Maintaining the IMR is one of the fundamental and statutory duties of the MCI While the MCI told TOI the state councils were to blame for not regularly sending information on registered doctors to it, most state councils refuted this allegation",
"time_scraped": "2018-08-20 12:00:23.058317",
"article_id": "65417837",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417836,imgsize-81080,width-400,resizemode-4/65417836.jpg",
"path": "full/ce38ba6c2bed81ede1ccc7e047ca1f0b1129a019.jpg",
"checksum": "63895e99fb89d1ddb13628a0406387a4"
}
]
}