{
"source_article_link": "https://timesofindia.indiatimes.com/india/indias-first-all-women-swat-team-ensures-red-fort-in-safe-hands-on-i-day/articleshow/65412687.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "India's first all-women SWAT team ensures red fort in safe hands on I-Day",
"date_published": "2018-08-15T14:17:26+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65412691,imgsize-134178,width-400,resizemode-4/65412691.jpg"
],
"article_body": "NEW DELHI: India's first all-women SWAT team from the north east beamed with pride as it provided security cover to the historic Red Fort today on the Independence Day.The 36-member all-women Special Weapons And Tactics (SWAT) team has been trained by the NSG for anti-terrorism duty under the's Special Cell.Rabta, a member of the team, said it has been her life-long dream to protect the country.\"I will always remember this day when I got the opportunity to provide security on one of the key events in the country,\" Rabta said.Dipti Barman, another member, said to hear the prime minister speak on her team made her beam with pride.\"I can feel the responsibility and my team would give its complete support in fulfilling every task assigned to it,\" Barman said.She hoped people change their perception towards the citizens of the north east and realise their capability.Another team member, Mihnhunsa, felt proud to don the uniform.\"Even though it is difficult task to change people's set notions about our region, we can try to do so through our uniform,\" she said.Prime Minister, in his Independence Day speech, said the government has brought Delhi close to the north east and the region has become an inspiration for everyone.The 36 women commandos, who broke the traditional male stronghold to enter the SWAT team, were formally inducted on August 10.They are equipped with AK-47 rifles, MP5 machine guns,17 or 26 pistols and corner shot devices for enhanced night vision. The women commandos were also trained in Krav Maga, which is a self-defence system developed for the Israel Defence Forces, the police said.The women commandos were trained to undertake complex operations during terrorist attacks at crowded markets, residential complexes or government premises.",
"description": "NEW DELHI: India's first all-women SWAT team from the north east beamed with pride as it provided security cover to the historic Red Fort today on the Independence Day.The 36-member all-women Special Weapons And Tactics (SWAT) team has been trained by the NSG for anti-terrorism duty under the's Special Cell.Rabta, a member of the team, said it has been her life-long dream to protect the country.\"I will always remember this day when I got the opportunity to provide security on one of the key events in the country,\" Rabta said.",
"time_scraped": "2018-08-16 01:33:48.946097",
"article_id": "65412687",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65412691,imgsize-134178,width-400,resizemode-4/65412691.jpg",
"path": "full/d4588134a01c291581a29423e23a01d8a35d55c5.jpg",
"checksum": "0bbf509816d658b20d9da2e5eaac042d"
}
]
}