{
"source_article_link": "https://timesofindia.indiatimes.com/india/in-independence-day-speech-pm-modi-hails-indias-rise-under-his-government/articleshow/65415585.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "In Independence Day speech, PM Modi hails India's rise under his government",
"date_published": "2018-08-15T22:17:39+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "NEW DELHI: In the lastof his tenure, Prime Minister Narendra Modi on Wednesday presented a picture of \"rising\" India under his government and contrasted it with what he termed as \"policy paralysis\" during the UPA rule, making a pitch for retaining power in the 2019 Lok Sabha polls.Addressing the nation from the ramparts of theon the 72nd Independence Day, his fifth speech after the NDA came to power in 2014,also announced the launch date of his signature healthcare scheme for 50 crore Indians, permanent commissioning of women in the armed forces and a plan to send Indian astronauts into space by 2022.In the nearly 80-minute speech, Modi devoted much of the time in presenting the report card of his government and also touched on a host of burning issues including the situation in Jammu and Kashmir, crime against women, legislation on instant triple talaq, state of the economy and the farm sector.\"When 125 crore people move towards achieving a goal, there is nothing that cannot happen. In 2014, the people of the country did not just stop at forming the government. They moved together towards nation-building and are continuing to do so,\" he said.The Prime Minister also talked about how India \"moved\" on the path of \"reform, perform and transform\" from the time of \"policy paralysis\" and \"corruption\" under the UPA rule.Accused by the opposition of running a pro-business and pro-rich dispensation, Modi dwelt at length about his government's initiatives to improve the lives of the poor and the backward sections and claimed that five crore people have been lifted out of poverty in the last two years.Showcasing achievements of his government, Modi said negative reports about India, delayed reforms, fragile economy and red tape were the terms often used for the country under the United Progressive Alliance (UPA), while it is now being looked at as a multi-trillion dollar economy, offering red carpet welcome to investors.\"India was earlier a sleeping elephant which has woken up now and started running,\" said Modi, who was wearing a saffron-and-red, Rajasthani-style turban.On Kashmir, the Prime Minister said, \"We will move forward by embracing people and not with bullet and abuse (Goli and Gaali).\"Hitting out at the previous Congress regimes, Modi said if the country moved forward at the same pace as in 2013, the last year of the UPA government, it would have taken decades to accomplish what has been achieved in the past four years.Quoting Tamil nationalist icon Subramania Bharti, Modi said in Tamil, \"India will show the path to the world.\"\"I am restless, I am agitated and I am also impatient for my country to lead the fourth industrial revolution, the revolution that is based on knowledge, the revolution which will be led by those who have IT skills. I am impatient for my country to lead it,\" he said.Among the dignitaries present at the Red Fort included BJP president Amit Shah and his wife who was sitting next to Congress chief Rahul Gandhi. Former prime ministers Manmohan Singh and H D Deve Gowda also attended the celebrations along with cabinet ministers, chiefs of the three services, top echelon of the judiciary, civil servants as well as thousands of schoolchildren.One of the big announcements Modi made was the rollout of the Ayushman Bharat-National Health Protection Scheme, described as the world's largest healthcare measure, on September 25, the birth anniversary of Hindutva icon Deen Dayal Upadhyay. He said the scheme will initially cover nearly 50 crore people from 10 crore families.He also announced permanent commissioning of women in the armed forces like men.\"Women officers inducted into the short service commission (SSC) will get opportunity for permanent commission like their male counterparts,\" the prime minister said.He did not elaborate whether it will be applicable to women in combat roles or in non-combat fields such as IT, military police, engineering, etc.Referring to recent incidents of rape, the prime minister said the law is supreme, and asserted that the society must be free from this \"demonic\" mindset. He hailed a recent judgment by a fast-track court in Madhya Pradesh to hang a rape convict. He made no specific mention of recent cases of lynching -- another hot button topic being debated in the country.Modi also highlighted his government's efforts to protect the interests of Dalits and backward classes -- the two communities being wooed by the ruling BJP ahead of the crucial elections -- and said the recent Parliament session was totally dedicated to social justice.He said by 2022, India will send a \"son or daughter\" to the space with the national flag in hand.He vowed not to spare corrupt and black money hoarders, saying efforts of his government have freed corridors of power from brokers, enhanced the number of taxpayers and saved Rs 90,000 crore by eliminating bogus beneficiaries of many schemes.Modi said the government is committed to a law banning the practice of instant triple talaq and blamed \"some people\", an apparent reference to opposition parties, for stalling its passage in Parliament.He recited a poem to describe how his government was changing India's destiny and that it was capable of taking tough and courageous decisions in the interests of the country.Modi ended his speech with a call for housing, power, cooking gas, sanitation, health, connectivity and water for all and said his government is working with this mantra.",
"description": "In the nearly 80-minute speech, Modi devoted much of the time in presenting the report card of his governmentIn his speech, PM Modi also touched on a host of burning issues including the situation in Jammu and Kashmir, crime against women, legislation on instant triple talaq, state of the economy and the farm sector",
"time_scraped": "2018-08-16 01:32:55.482352",
"article_id": "65415585",
"article_category": "IndiaNews",
"image_details": []
}