{
"source_article_link": "https://timesofindia.indiatimes.com/india/wont-tolerate-corruption-will-protect-honest-taxpayers-pm-modi/articleshow/65417767.cms",
"title": "Won’t tolerate corruption, will protect honest taxpayers: PM Modi",
"date_published": "2018-08-16T05:19:41+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417766,imgsize-112093,width-400,resizemode-4/65417766.jpg"
],
"article_body": "NEW DELHI:said on Wednesday the government will not tolerate black money and corruption, indicating that he will continue with the drive, while assuring honest taxpayers that the Centre will protect their interests.“I would like to assure taxpayers that your worries are our worries. We are with you because the country will develop due to your contribution and, therefore, we will not tolerate black money and corruption. Despite the difficulties we face, I will not abandon this path because they have wreaked havoc by eating into the country’s resources like termites,”said in his I-Day address.He said the income tax base as well as the number of entities paying indirect taxes had significantly increased in the last four years. For instance, government data showed that the number of income taxpayers increased from around 4 crore in 2013 to 6.75 crore in 2018, a rise of around 70%.Similarly, with the introduction of GST, the base increased to 1.16 crore from around 70 lakh, which was the pool of those paying indirect taxes ranging from central excise and state VAT to services tax and entertainment tax.The comments on income taxpayers were aimed at critics of demonetisation, who have repeatedly questioned the move even as the government has maintained it will help in expanding the tax base. Similarly, the numbers on GST were probably meant to assure consumers and taxpayers about a wider base resulting in higher compliance.The government has repeatedly said that a more robust base will help reduce tax rates and lower the overall burden on consumers. The PM also sought to allay the grievance of many individuals, who complain of being burdened by tax liability without getting quality healthcare or education in return.“Taxes paid by honest taxpayers should get credit for the schemes that are being run by the government... Amindset is being created in the country against paying taxes. But when a taxpayer gets to know that the taxes he pays helps feed three poor people, it provides him with great satisfaction,” Modi said.",
"description": "PM said the income tax base as well as the number of entities paying indirect taxes had significantly increased in the last four yearsGgovernment data showed that the number of income taxpayers increased from around 4 crore in 2013 to 6.75 crore in 2018",
"time_scraped": "2018-08-16 06:03:19.361713",
"article_id": "65417767",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417766,imgsize-112093,width-400,resizemode-4/65417766.jpg",
"path": "full/cf0b754412bc7437e11a46d5eba82101ca6a0b4d.jpg",
"checksum": "c977006cbe57b388b406748050163aa8"
}
]
}