{
"source_article_link": "https://timesofindia.indiatimes.com/india/pm-fixes-2022-deadline-for-indias-manned-mission-isro-chief-says-first-gagannaut-could-be-a-woman/articleshow/65415138.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "PM fixes 2022 deadline for India's manned mission, Isro chief says first 'Gagannaut' could be a woman",
"date_published": "2018-08-15T21:50:32+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65415180,imgsize-142327,width-400,resizemode-4/65415180.jpg"
],
"article_body": "NEW DELHI: Giving a good news to space enthusiasts and scientists, Prime Ministeron Tuesday announced the long-awaited manned space mission by India. Speaking on the 72nd Independence Day celebrations, PM Modi said: \"Today, I am happy to announce from the ramparts of Red Fort that by 2022, the 75th Independence year, or if possible before that, we will launch a manned space mission. A son or daughter of India will go to space on board 'Gaganyaan' with a tricolor in hand.\"The PM said, \"With the launch of the manned mission, India will become the fourth country in the world (after Russia, US, and China) to send a human to space. I thank the scientific community for their achievements in space technology till now and for working towards the country's first manned mission.\"The PM, in his fifth and final I-Day speech before the LS polls, also announced that a NAVIC app for fishermen will be launched soon. This app based on the Indian navigation system will help fishermen navigate in the sea, help them find a fishing zone and also give them information about international boundaries to help them avoid getting caught for crossing sea borders.Exhilarated at the PM's announcement,(Isro) chairman K Sivan, in an exclusive interview to TOI, said, \"I am thankful to the PM for highlighting achievements of space scientists in his I-Day speech. For the first manned mission, 2022 will be a very, very tight schedule but we are committed to meet the PM's deadline. It is not an Isro mission but a national project and we will achieve it.\"On sending Indians to space, the chairman told TOI, \"As the PM said, India's first 'Gagannaut' could be a woman. In fact, women nowadays are very competitive and ready to take up any challenge. We will be glad to train a woman to send her to space on board the Gaganyaan.\"On technologies needed for the mission, Sivan said, \"We have already developed many technologies for the mission. We are half-way through.\" Till date, Isro has spent Rs 173 crore for developing critical technologies for the human space flight. He said, \"We hope the budget for the mission would not exceed Rs 10,000 crore.\" He said, \"An advanced version of GSLV MK III (Isro'f fat boy with over 4-tonne payload capability) will be used for the mission.\"Casting a light on various systems required for the manned mission, the Isro chief told TOI, \"A human space programme focuses on taking a human to space and bringing him back to the Earth safely. For that purpose, we will have to provide a life support system to our crew within the spacecraft. Therefore, we will have to make arrangement for continuous oxygen supply, controlled pressure, and environment system, food supply, human waste discharge system and crew protection system involving the escape capsule.\"With the PM fixing a deadline for the manned mission, Isro has to fast-track tests on all these technologies needed for the manned mission.The space agency is already working on the reusable launch vehicle (RLV). It had conducted the first RLV test on May 23, 2016, when the RLV was first lifted off by a rocket and after ascending to a height of 56km it separated and coasted to further 65km height with the help of boosters. It then started its descent and successfully glided back to the defining landing spot over the Bay of Bengal.Isro is now preparing for the second demonstration test of RLV next year. Sivan said, “We will conduct an RLV test sometime next year where a helicopter will take the vehicle to a height of 3 km and from that height, it will be dropped. The RLV will then glide and land on an airstrip. The third experiment later will include testing the RLV from the orbit.”Isro is simultaneously working on the pad-abort or crew escape system. The pad-abort will help the Gagannaut move to a safe distance in case of any untoward accident during the launch or flight. The space agency conducted the first test on the critical technology on the 12.5-ton crew module on July 5 this year to check the crew safety mechanism.",
"description": "Modi said: Today, I am happy to announce from the ramparts of Red Fort that by 2022, the 75th Independence year, or if possible before that, we will launch a manned space mission.A son or daughter of India will go to space on board 'Gaganyaan' with a Tricolor in hand, he said. ",
"time_scraped": "2018-08-16 01:33:06.206016",
"article_id": "65415138",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65415180,imgsize-142327,width-400,resizemode-4/65415180.jpg",
"path": "full/0a720aeff93ddbacec574243c50d2e8438d6ab58.jpg",
"checksum": "6b98db6b6bf86f5986a7fe57bc61ab99"
}
]
}