{
"source_article_link": "https://timesofindia.indiatimes.com/india/denied-for-centuries-naga-women-get-to-own-land-now/articleshow/65417974.cms",
"title": "Denied for centuries, Naga women get to own land now",
"date_published": "2018-08-16T06:12:16+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417975,imgsize-109302,width-400,resizemode-4/65417975.jpg"
],
"article_body": "DIMAPUR/KOHIMA: For centuries, Naga women couldn’t inherit land because of patriarchal customary laws. But a silent revolution has started in , and people are writing wills and preparing gift deeds to leave behind the land that they have acquired during their lifetime for their daughters. “In urban areas of Nagaland it is happening at large scale these days. Parents are transferring ownership of land to daughters, which was earlier unheard of,” says TL Kiusumona Tikhir, additional deputy commissioner of , also in-charge of the revenue department, which oversees transfer of land. What is being gifted is acquired land. Ancestral land cannot be sold to members of another tribe or gifted to daughters as they might marry into another tribe and end up reducing the village area, which is unthinkable for a Naga. Acquired land, on the other hand, are in urban settlements and do not affect tribal village boundaries. Land rights have been a touchy issue in Nagaland for centuries. “For Nagas, land is identity. He belongs to a village and he has his forefathers buried there. Therefore he can never foresake his ancestral village,” says Naga social activist and Tangkhul expert S Varah. IAS couple Anenla and Bendang Longchari have decided to gift land to their three daughters. “We bought plots of land for our first and third daughters in Kohima and gifted a plot to the second daughter in ,” says Anenla. But Anenla places education before land when it comes to empowering daughters. “I am the commissioner secretary to the government of Nagaland today because my father gave me the best education,” she adds. Empowered by education, women are also buying land on their own. “Given the high literacy rate and subsequent growth of women professionals in every field, there is an increasing trend of women buying their own land and property in Naga society today,” says Toshimenla Jamir, HoD at . With education, also comes awareness. “My father was illiterate and he sent my brother and me to private schools and my six sisters to a government school. But I realised that my sisters must get a share of the property,” says 38-year-old Pinman Konyak from Abhoi town, who has already gifted land to four of his sisters. A concerted effort has also begun to move towards an inheritance law in Nagaland that is not biased against women. “We have had detailed meetings with all tribal hohos — the apex decison-making body of Naga tribes — and 15 of the 16 recognised tribes are amenable to the idea of a law facilitating women inherit acquired property of their parents,” says Temsula Ao, chairperson of Nagaland State Commission for Women. Talks are, however, stuck in a limbo after the February 2017 violence over the issue of 33% reservation for women in urban legislative bodies. “These days, we are getting to hear of increasing number of cases where fathers are transferring land in the name of their daughters,” says Ao. She says that in certain cases where parents have only daughters and fear that relatives might try to usurp the property, they are taking the step of leaving behind wills, unheard of in Nagaland, where most land is still transferred or bequeathed by oral pronouncements. The Centre not only stands a mute spectator here, but data released by the ministry of health and family welfare creates a smokescreen around this gender injustice. The ministry-released National Family Health Survey 2015-16 says ‘women owning a house and/or land (alone or jointly with others)’ stands at 41% in rural Nagaland and 26% in urban areas of the state. Experts TOI spoke to trashed the data. Email and phone calls by TOI seeking clarification on the data fro",
"description": "People are now writing wills and preparing gift deeds to leave behind the land that they have acquired during their lifetime for their daughters Ancestral land cannot be sold to members of another tribe or gifted to daughters as they might marry into another tribe",
"time_scraped": "2018-08-16 09:00:03.932286",
"article_id": "65417974",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417975,imgsize-109302,width-400,resizemode-4/65417975.jpg",
"path": "full/ebeaa0f85e519365c29f6bd105e226a0e70e679a.jpg",
"checksum": "47b17e0caa7529ee7d71481d33225bb5"
}
]
}