{
"source_article_link": "https://timesofindia.indiatimes.com/india/rule-of-law-supreme-pm-on-rape-cases/articleshow/65410505.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Rule of law supreme: PM on rape cases",
"date_published": "2018-08-15T10:26:30+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65410564,imgsize-999559,width-400,resizemode-4/65410564.jpg"
],
"article_body": "NEW DELHI: Asserting that the rule of law is supreme for his government, Prime Minister today called for giving wide publicity to the cases in which rapists were awarded the death sentence, saying it would instill fear in people with \"demonic mindset\". \"The country, our society need to be rid off this demonic mindset,\" he said during his Independence Day address from the Red Fort. Modi said the society needs to feel a million times more pain that a rape victim endures.\"The rule of law is supreme for us and there can be no compromise with this,\" he said. He spoke about fast-track trial of rape cases in Madhya Pradesh and where the convicts were condemned to death within days and said such cases need to be given wide publicity to deter people from committing such crimes. \"The more the publicity, the more the fear it will instill in people with demonic mindset,\" Modi said. He asked people to inculcate values and respect for women in their children.The prime minister referred to the elevation of two women as judges of the Supreme Court. \"Now, in a first, there are three women judges in the top court,\" he said. Justices Indu Malhotra and were recently elevated as judges of the Supreme Court. Malhotra was the first senior woman advocate to be directly appointed as the judge of the top court. Among the three sitting women judges, Justice R Banumathi is the senior most and was elevated to the court on August 13, 2014.",
"description": "Prime Minister Narendra Modi today called for giving wide publicity to the cases in which rapists were awarded the death sentence, saying it would instill fear in people with \"demonic mindset\".  He applauded spoke about fast-track trial of rape cases in Madhya Pradesh and Rajasthan",
"time_scraped": "2018-08-17 03:01:32.543286",
"article_id": "65410505",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65410564,imgsize-999559,width-400,resizemode-4/65410564.jpg",
"path": "full/3137d4a2507639f9118f3440eb84ec190981cb43.jpg",
"checksum": "4a8201e4a2c87a07b42216dfb6fe5986"
}
]
}