{
"source_article_link": "https://timesofindia.indiatimes.com/india/govt-sc/st-staff-automatically-entitled-to-promotion-quota/articleshow/65417477.cms",
"title": "Govt: SC/ST staff automatically entitled to promotion quota",
"date_published": "2018-08-16T02:19:29+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417504,imgsize-129172,width-400,resizemode-4/65417504.jpg"
],
"article_body": "NEW DELHI: The Centre has told thethat SC/ST government employees were automatically entitled for quota in promotions and reiterated the need for reconsideration of the M Nagraj judgment, saying collection of data to determine their backwardness was neither feasible nor desirable. Filing its written note on the matter on Tuesday, the Centre said a community was added to the list of Scheduled Castes after Parliament passed a bill to that effect on being satisfied that members of that community suffered “extreme social and economic backwardness arising out of traditional practice of untouchability”.Similarly, a community was given Scheduled Tribe tag after Parliament was satisfied that the community members had primitive traits with a distinct culture accompanied by geographical isolation and were shy of contact with people and hence suffered backwardness for centuries. “Once a community is included as SC or ST based on backwardness, the test of ‘backwardness’ is met. Backwardness is an interplay of both socio-economic attributes. While economic backwardness may be quantifiable, it is difficult to find a proxy to determine social backwardness,” the Centre said.In 2006, the SC had said in the Nagraj judgment that if the state felt compelled to give reservation in promotion to SC/ST employees, it must collect quantifiable data to prove their backwardness while not compromising the Article 335 requirement to maintain administrative efficiency. On maintaining administrative efficiency, the Centre said quota in promotion was not available in sensitive posts which require great skill like judges of superior courts where efficiency in administration would exclude reservation in promotion.Arguing against testing the backwardness of SC/ST employees for the purpose of promotion, the Centre said, “SCs and STs are homogeneous groups and any action to re-group them based on economic and social advancement would not be appropriate. “Further, to determine the socio and economic backwardness of SCs and STs, it would not be feasible to decide about the kind of data required, periodicity of collection of data, sources from where such data are to be collected and the method for authentication of such data.”The Centre said it was of the view that need for collection of quantifiable data in the case of SCs/STs to determine their backwardness at the time of considering them for promotion may not arise, as their inclusion itself (in the scheduled category) was based on detailed process followed by the government and Parliament. Promotion in reservation was available only to scheduled communities and not to other backward classes (OBCs), it said.It said Article 16(4A) provided reservation in promotion to SC/ST employees because they were already considered backward and hence there was no need to repeat the process. “There is a difference between the OBCs and the SCs/STs and, therefore, evidence of backwardness may be relevant for OBCs, but not for SCs and STs,” the Centre said.“The policy of providing reservation in promotion to SCs and STs is to be implemented by each cadre controlling authority. It would be difficult for each cadre controlling authority to collect quantifiable data in each case as representation of SCs/STs in promotion posts keep changing,” it added.",
"description": "The Centre has told the SC that SC/ST government employees were automatically entitled for quota in promotionsCentre further said that collection of data to determine their backwardness was neither feasible nor desirable",
"time_scraped": "2018-08-16 05:26:59.723042",
"article_id": "65417477",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417504,imgsize-129172,width-400,resizemode-4/65417504.jpg",
"path": "full/fd7454c8a7868326ad483769b6d0e84121b6769d.jpg",
"checksum": "192981cb096a0eb4f26413cd1f62b96d"
}
]
}