{
"source_article_link": "https://timesofindia.indiatimes.com/india/easy-to-destroy-a-system-hard-to-make-it-work-cji/articleshow/65417403.cms?&utm_source=Articleshow&utm_medium=Organic&utm_campaign=Related_Stories",
"title": "Easy to destroy a system, hard to make it work: CJI Dipak Misra",
"date_published": "2018-08-16T09:37:24+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417402,imgsize-111077,width-400,resizemode-4/65417402.jpg"
],
"article_body": "NEW DELHI: Chief Justice of India said on Wednesday that it was quite easy to criticise, but very difficult to make it “perform” as he called for transcending “personal ambitions or grievances” and keeping a “positive mindset of reforms” to take any institution to the heights of glory. The CJI’s remarks were seen as his first public reaction to the rebellion by four most senior Supreme Court judges who, in an unprecedented press conference on January 12 this year, had accused him of breaching norms and rules by “selectively” assigning cases of far-reaching national importance to junior judges. \"It is necessary to be productive in a state of counter-productive times,” said in his address after unfurling the Tricolour at a function organised by the Supreme Court Bar Association. “There may be some elements that may endeavour to weaken the institution. But we refuse, we all together, to succumb to them,” the told the gathering which included law minister . Prasad said the judiciary should maintain restraint in interfering in issues of policy and governance and that governance must be left to the people’s representatives. Judiciary should only intervene when the government goes wrong, he said. He said the government has always respected the concept of Public Interest Litigation as a tool to protect the rights of the poor and disadvantaged, but the judiciary should discourage ‘fly-by-night’ PILs. “We have always respected PIL and judiciary must intervene to put things right I would also say that governance must be left to those who are elected by the people to govern,” Prasad said. K K Venugopal, however, used the occasion to bring to the notice the problem of over-crowding in court rooms.",
"description": "CJI’s remarks were seen as his first public reaction to the rebellion by four most senior Supreme Court judges \"It is necessary to be productive in a state of counter-productive times,” CJI Dipak Misra said  Dipak Misra also said that it was quite easy to criticise, attack and destroy a system but very difficult to make it “perform” ",
"time_scraped": "2018-08-17 06:00:16.013339",
"article_id": "65417403",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417402,imgsize-111077,width-400,resizemode-4/65417402.jpg",
"path": "full/1c158dea85d73000ed4e23b70e7df7ce99c52115.jpg",
"checksum": "98d1c06be9b28f2587ecbe9709a54518"
}
]
}