{
"source_article_link": "https://timesofindia.indiatimes.com/india/we-can-fulfil-pms-promise-isro-chief-on-manned-mission/articleshow/65413110.cms",
"title": "We can fulfil PM's promise: Isro chief on manned mission",
"date_published": "2018-08-15T16:38:22+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [],
"article_body": "BENGALURU: Hours after Prime Minister Narendra Modi announced theProgramme (HSP),chairman Sivan K said the space agency is confident of.\"It came as a surprise to us, I was not expecting this but it is a great gift to Isro and we are confident of sending Indians to space in the next four years, although it is a tight schedule,\" Sivan said.While acknowledging that Isro will now have to begin the process of identifying human resource and set up a project team, Sivan, however, said: \" ... all along, critical technology for HSP was going on. The technology related for this project, like the crew module, environmental control and life support system have all been developed. India also has a flight suit and other sub-systems for crew module almost ready.\"Confirming that the launch vehicle used will be the GSLV MK-III, he said: \"We know that so far we've only had one flight, but the next one will be next month and we are confident of have 10-15 by the time of HSP,\" he said.In his Independence Day address to the nation today, PM Modi vowed to put an Indian in space by 2022.\"When India celebrates 75th year of Independence in 2022, and if possible even before, an Indian son or daughter will undertake a manned space mission on board 'Gaganyaan' carrying the national flag,\" the PM announced from the ramparts of the Red Fort.",
"description": "Isro chief: It came as a surprise to us, I was not expecting this but it is a great gift to Isro and we are confident of sending Indians into spaceThe Isro chief said that all critical technology related to the project has been developed",
"time_scraped": "2018-08-16 01:32:29.372685",
"article_id": "65413110",
"article_category": "IndiaNews",
"image_details": []
}