{
"source_article_link": "https://timesofindia.indiatimes.com/india/300-kids-sold-to-us-buyers-at-rs-45l-each-kingpin-held/articleshow/65417558.cms",
"title": "300 kids sold to US buyers at Rs 45L each; kingpin held",
"date_published": "2018-08-16T03:37:14+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417575,imgsize-62865,width-400,resizemode-4/65417575.jpg"
],
"article_body": "MUMBAI: The Mumbai police arrested the kingpin of an international child trafficking racket that allegedly sent at least 300 children from India to the US. Rajubhai Gamlewala aka Rajubhai, a Gujarat resident, started the racket in 2007 and would charge Rs 45 lakh for each child from his US-based clients. The fate of the trafficked children is not yet clear. Some members of the racket were arrested in March.The children, aged 11-16, came from poor families, usually in Gujarat. “Finding it difficult to take care of them, their parents or guardians would sell them,” said a police officer. Police said after receiving an order from clients in the US, Gamlewala, 50, would instruct his gang to find a poor family, usually in Gujarat, willing to sell a child. They would also find families willing to rent out their children’s passports. A passport with a picture with some resemblance to the child would then be selected.The gang would then pay a carrier to take the child to the US. Before that, makeup would be applied on the child for a stronger resemblance with the picture on the passport. After the carrier returned from the US, the passport would be returned to the original holder. It is unclear how the passport would be stamped by immigration without its bearer’s presence, the police said.The racket was busted in March when actor Preeti Sood received a call from a friend that two minors were being applied makeup at a Versova salon. “I went there on a suspicion that the girls were being readied for brothels. But once there, I realised that the racket was bigger than I thought,” she told TOI on Wednesday. She said she found three men instructing the staff on how to apply makeup on two minors.“When I asked, the men claimed they were sending the children to their parents in the US. I asked them to accompany me to the police station, but they refused. I managed to stop two of the men and called the police. Meanwhile, the third escaped with the girls,” Sood said. Sood got four men arrested by the police, including a retired sub-inspector’s son.The four are Amir Khan (26; the policeman’s son), Tajuddin Khan (48), Afzal Shaikh (35) and Rizwan Chotani (39). Gamlewala was tracked with the help of anumber he used to communicate with his accomplices. “Gamlewala has been arrested before. In 2007, he was caught in Mumbai for passport forgery. We were led to his latest racket because of the March arrests,” said DCP (Zone IX) Paramjit Singh Dahiya.The accused have been booked under the IPC’s sections 34 (common intention) and 373 (buying minor for purposes of prostitution). Gamlewala will be in police custody till August 18. His four cronies are in judicial custody.",
"description": " Rajubhai, a Gujarat resident, started the racket in 2007 and would charge Rs 45 lakh for each child from his US-based clientsThe children, aged 11-16, came from poor families, usually in GujaratThe gang would find families willing to rent out their children’s passports",
"time_scraped": "2018-08-16 05:27:00.263440",
"article_id": "65417558",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417575,imgsize-62865,width-400,resizemode-4/65417575.jpg",
"path": "full/b95e3c135e66de85219d5820a5c07691d29827f5.jpg",
"checksum": "7cc5b7abbb7e23c9776714e0feaa7db4"
}
]
}