{
"source_article_link": "https://timesofindia.indiatimes.com/india/panel-asks-govt-to-focus-on-most-backward-sc/sts/articleshow/65417854.cms",
"title": "Panel asks govt to focus on ‘most backward’ SC/STs",
"date_published": "2018-08-16T05:56:37+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417851,imgsize-132442,width-400,resizemode-4/65417851.jpg"
],
"article_body": "NEW DELHI: A parliamentary committee has asked the Centre to identify the “most backward” communities among SCs/STs and focus on their targeted development, in what marks the first attempt to move away from looking at Dalits and tribals as homogeneous blocs. The government has been urged to identify the “most backward” communities urgently and “specific schemes should be chalked out and implemented for the amelioration of their socio-economic conditions”. The recommendation, made by the ‘committee on welfare of SCs and STs’, appears to nudge the government away from traditional methods of Dalit welfare where central schemes have focused on Dalits and tribals as generic groups. Hundreds of communities with varying deprivation levels have been clubbed together in broad categories of SCs and STs. There are complaints that castes with better education and economic conditions corner benefits of affirmative action like job reservations because “weaker castes” are unable to compete with them. The grievance has been at the root of demand for “subcategorisation” which entails division of the list of SCs into sub-groups based on their level of backwardness and dividing the 15% SC reservation among them in proportion to their population. However, unlike for OBCs, sub-categorisation of SCs and STs is viewed as constitutionally untenable after a constitution bench of the Supreme Court struck down the initiative of in 2004. Given the backdrop, the parliamentary panel’s recommendation provides an interesting turn to the debate by seeking focus on communities within the SC and ST lists without demanding their sub-classification. It is to be seen if the Centre heeds the advice to identify “backward” castes in the SC and ST list, and draft schemes for their targeted development. Importantly, the panel has also asked the Centre to frame a law on “SC Sub-Plan” which mandates earmarking of budget of Union ministries and departments for Dalit welfare in proportion to its population. The panel has cited the laws brought by and to back its demand for the schemes. The provision of “Dalit budget” has existed for decades but is riddled with problems of implementation and oversight. The committee has argued that “SCSP should have statutory backing to ensure serious and effective implementation of the plan”. A bill on SCSP was drafted by UPA-2 government but could not be passed. In 2017, the SCSP was rechristened as “Allocation for Welfare of SCs”.",
"description": "The government has been urged to identify the “most backward” communities urgently The recommendation, made by the ‘committee on welfare of SCs and STs’, appears to nudge the government away from traditional methods of Dalit welfare ",
"time_scraped": "2018-08-16 09:00:03.774201",
"article_id": "65417854",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417851,imgsize-132442,width-400,resizemode-4/65417851.jpg",
"path": "full/d3935898d19d7915315760a2aedd198d4535bc6f.jpg",
"checksum": "8d9876474b56486ff65ed3b3a629b86f"
}
]
}