{
"source_article_link": "https://timesofindia.indiatimes.com/india/pm-promises-to-give-kisans-access-to-global-markets/articleshow/65417782.cms",
"title": "PM promises to give kisans access to global markets",
"date_published": "2018-08-16T05:29:50+05:30",
"source_type": "news_article",
"source_name": "timesofindia.indiatimes.com",
"image_link": [
"https://timesofindia.indiatimes.com/thumb/msid-65417784,imgsize-98970,width-400,resizemode-4/65417784.jpg"
],
"article_body": "NEW DELHI: PM Modi said on Wednesday the country will soon have an ‘agriculture export policy’ so that Indian farmers can strongly compete in the. “Our granaries are full... but times have changed. Our farmers and agricultural markets have to face global challenges and competition. The changing times demand our agricultural methods should also be modern and more scientific. We want to bring value addition right from ‘beej se bazaar tak’ (seeds to market),” Modi said in his I-Day speech.His remarks came in the backdrop of concerns that farmers’ economic well-being could not improve much despite record production of foodgrain over the years. Modi also reiterated his government’s efforts to double farmers’ income by 2022 and emphasised that attempts were being made to modernise the sector through technological and policy interventions. He said he dreamed of achieving this goal by the time the country celebrated 75 years of Independence.The commerce ministry had in March come out with a draft policy aimed at doubling agricultural exports (from about $30 billion to over $60 billion by 2022) and integrating Indian farmers and agricultural goods with the global value chain. The policy is expected to be notified soon after incorporating stakeholders’ suggestions.In a response to his critics, the PM said, “We have a vision to double farmers’ income by the 75th year of Independence. Some people have doubts, which is quite natural. But we are determined. “Hum makkhan par lakeer nahi, patthar par lakeer kheenchne waale hain (decisions taken by us are cast in stone, not on butter).”He listed his government’s measures, such as promoting organic farming, blue revolution, sweet revolution and solar farming among others, and recalled his decision to increase the MSP ofby 1.5 times the cost of production",
"description": "Our farmers and agricultural markets have to face global challenges and competition, PM saidModi also reiterated his government’s efforts to double farmers’ income by 2022 and emphasised that attempts were being made to modernise the sector ",
"time_scraped": "2018-08-16 06:03:19.448434",
"article_id": "65417782",
"article_category": "IndiaNews",
"image_details": [
{
"url": "https://timesofindia.indiatimes.com/thumb/msid-65417784,imgsize-98970,width-400,resizemode-4/65417784.jpg",
"path": "full/d84c8d7360fe48354fa735f1e2ad385eff5f3c23.jpg",
"checksum": "ff67e9b60a12f7fe392e48469142ffc8"
}
]
}