{
"source_article_link": "https://www.thehindu.com/news/national/we-averted-a-possible-debacle-isro-chairman/article24660014.ece",
"title": "We averted a possible debacle: ISRO chairman - The Hindu",
"date_published": "2018-08-11T00:08:43+05:30",
"source_type": "news",
"source_name": "Hindu",
"image_link": [],
"article_body": "Indian Space Research Organisation could have faced a ₹1200-crore debacle in space had it not brought GSAT-11 back from the Guiana launch port in late April, its Chairman K. Sivan said on Friday. Speaking for the first time on issues raised about the 5,700-kg high throughput satellite, he justified ISRO’s unprecedented decision to recall the satellite midway between its reaching the French port and the launch. Dr. Sivan said an apex committee of former chairmen and former space commission members collectively decided to bring GSAT-11 back to Bengaluru for a thorough check. “There is ₹1,200 crore at stake as costs of the satellite and the launch, apart from India’s reputation. We cannot afford to take risks in such a high profile mission. We did lose our place in the launch queue when we brought our satellite back. But it turned out to be a wise decision. GSAT-11 had the same set of power system configuration that two older satellites had. RISAT-1 died prematurely and GSAT-6A lost communication contact soon after launch on March 29 because of suspected power system failure, harnesses etc... We had just sent GSAT-11 [to Guiana] and no one was sure if the same issue was there in GSAT-11,” he said. Checks found that the provision or “margin” for the deployment of the solar panel was much smaller than was required. “Had it gone in that configuration, the panel [which generates power for the 15-year life] would not have deployed in space. The satellite would have been a failure. We had a chance to improve a major system. We are also confident that the failure issue has been overcome.” Contrary to a few reports, there was no pressure on ISRO nor were the two new launches a quid pro quo for taking GSAT-11 to space, he said. GSAT-31 and 30 would be signed this month only because launches with Arianespace must be committed four months before launch date that ISRO sought — before December 15 — he said. The national space agency had envisioned that its two GSLV rockets would fully take over geostationary orbit launches and that GSAT-11 — its heaviest to date and most ambitious for digital communication — would be its last satellite to go outside India for a launch. But early this year, it realised that upgrading a GSLV-Mk2 engine would need more time. The bigger Mark 3 was also not available in time. “We already knew that we have to look for outside launch again for these two satellites,” Dr. Sivan said.",
"description": "‘Decision to recall GSAT-11 justified’",
"time_scraped": "2018-08-17 04:55:18.128092",
"article_id": "ISRO, Sivan, GSAT-11,",
"article_category": "National",
"image_details": []
}